
&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть();

	ОКСервер();
	
КонецПроцедуры // ОК()

&НаСервере
Процедура ОКСервер()
	
	Справочники[Параметры.Справочник].ПеренестиНоменклатуру(Параметры.Номенклатура, Новый Структура("Владелец,Родитель, ИерархическийСписок,ИсключаяВерхнийУровень,ПеремещатьСуществующие,ПомеченныеНаУдаление",
		Параметры.Владелец,
		Параметры.Родитель,
		Ложь,
		Ложь,
		ПеремещатьСуществующие,
		Истина));
	
КонецПроцедуры // ОКСервер()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПеремещатьСуществующие = Истина;
	
	Если (Параметры.Справочник = "Меню") Тогда
		ИскомаяПозиция = Справочники[Параметры.Справочник].НайтиПоНоменклатуре(Параметры.Номенклатура, Параметры.Владелец);
	Иначе
		ИскомаяПозиция = Справочники[Параметры.Справочник].НайтиПоНоменклатуре(Параметры.Номенклатура);
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ИскомаяПозиция) Тогда
		Отказ = Истина;
		ОКСервер();
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()
