
&НаКлиенте
Процедура НайтиКарту(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.КодКарты) Тогда
		Сообщить("Поле " + """" + "Код карты" + """" + " не заполнено");
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Текст = "ru = 'Все поля будут очищены. Продолжить?'; uk = 'Всі поля будуть очищені. Продовжити?'";
		Ответ = Вопрос(НСтр(Текст), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		ОчисткаПолей();
	КонецЕсли;
	НайтиКартуНаСервере();	
КонецПроцедуры

&НаСервере
Процедура НайтиКартуНаСервере()
	Ссылка = Справочники.ИнформационныеКарты.НайтиПоКодуКарты(СокрЛП(Объект.КодКарты));
	Если Ссылка.Пустая() Тогда
		Сообщить("Карта не найдена");
		Возврат;
	КонецЕсли;	
	Если Ссылка.ПометкаУдаления Тогда
		Сообщить("Карта помечена на удаление");
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Ссылка.ДатаНачалаПериода) Тогда
		Сообщить("Информация о владельце заполнена");
		Возврат;
	КонецЕсли;
	Объект.Ссылка = Ссылка;
	УстановитьДоступностьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКарту(Команда)
	ЗаписатьКартуНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКартуНаСервере()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СправочникОбъект 					= Объект.Ссылка.ПолучитьОбъект();
	СправочникОбъект.ДатаНачалаПериода 	= ТекущаяДата();
	СправочникОбъект.ВладелецКарты 		= СокрЛП(Объект.ВладелецКарты);
	СправочникОбъект.Пол 				= Объект.Пол;
	СправочникОбъект.ДатаРождения 		= Объект.ДатаРождения;
	СправочникОбъект.Телефон 			= СокрЛП(Объект.Телефон);
	СправочникОбъект.EMail 				= СокрЛП(Объект.EMail);
	СправочникОбъект.Адресс 			= СокрЛП(Объект.Адресс);
	СправочникОбъект.Компания 			= СокрЛП(Объект.Компания);
	СправочникОбъект.Менеджер 			= СокрЛП(Строка(ПараметрыСеанса.ТекущийПользователь));
	
	Если Объект.ЧленыСемьи.Количество() Тогда
		Для Каждого СтрокаТабличнойЧасти Из Объект.ЧленыСемьи Цикл
			НоваяСтрока = СправочникОбъект.ЧленыСемьи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		КонецЦикла;
	КонецЕсли;
	
	СправочникОбъект.ОбменДанными.Загрузка = Истина;
	
	Попытка
		СправочникОбъект.Записать();
		Объект.КодКарты = "";
		ОчисткаПолей();
		Сообщить("Карта успешно записана", СтатусСообщения.Информация);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьНаСервере()
	Элементы.ГруппаВладелецКарты.Доступность 		= ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.ГруппаКонтактнаяИнформация.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.ЧленыСемьи.Доступность 				= ЗначениеЗаполнено(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчисткаПолей()
	
	Объект.Ссылка 			= Неопределено;
	Объект.ВладелецКарты 	= Неопределено;
	Объект.ДатаРождения 	= Неопределено;
	Объект.Пол 				= Неопределено;
	Объект.Телефон 			= Неопределено;
	Объект.EMail 			= Неопределено;
	Объект.Адресс 			= Неопределено;
	Объект.Компания 		= Неопределено;
	
	Объект.ЧленыСемьи.Очистить();
	
	УстановитьДоступностьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КодКартыОчистка(Элемент, СтандартнаяОбработка)
	Объект.КодКарты = "";
	ОчисткаПолей();
КонецПроцедуры

&НаКлиенте
Процедура КодКартыПриИзменении(Элемент)
	ОчисткаПолей();
КонецПроцедуры
