
#Если Клиент Тогда
	
Функция ВывестиСлужебноеСообщение(ТекстСообщения, Статус = Неопределено, Заголовок = Ложь) Экспорт
	
	// Добавление сообщения.
	СтрокаТаблицы = СлужебныеСообщения.Добавить();
	СтрокаТаблицы.Статус = Статус;
	СтрокаТаблицы.ТекстСообщения = ТекстСообщения;
	СтрокаТаблицы.Заголовок = Заголовок;
	
	// Открытие формы.
	Форма = ПолучитьФорму("Форма");
	Если Не Форма.Открыта() Тогда
		Форма.СостояниеОкна = ВариантСостоянияОкна.Свободное;
	КонецЕсли;
	Форма.Открыть();
		
КонецФункции // ВывестиСлужебноеСообщение()


// Инициализация переменных.
СлужебныеСообщения.Колонки.Добавить("Статус", Новый ОписаниеТипов("СтатусСообщения"), "Статус");
СлужебныеСообщения.Колонки.Добавить("ТекстСообщения", Новый ОписаниеТипов("Строка"), "Текст сообщения");
СлужебныеСообщения.Колонки.Добавить("Заголовок", Новый ОписаниеТипов("Булево"));

#КонецЕсли
