
&НаКлиенте
Перем УдаляемаяНастройка;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Владелец 	= ЭтаФорма.Параметры.Владелец;
	ИмяОбъекта 	= ЭтаФорма.Параметры.ИмяОбъекта;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьТаблицуНастроекНаСервере(ИмяОбъекта, Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекНаименованиеНастройкиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные 		= Элементы.ТаблицаНастроек.ТекущиеДанные;
	ТекущиеДанные.Дата 	= ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Отказ = Ложь;
	
	ТекущиеДанные = Элементы.ТаблицаНастроек.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Настройка 	= ТекущиеДанные.НаименованиеНастройки;
	Дата 		= ТекущиеДанные.Дата;
	
	СохранитьНаСервере(Отказ, ИмяОбъекта, Настройка, Дата);
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере(Отказ, ИмяОбъекта, Настройка, Дата)
	
	
	НачатьТранзакцию();
	
	РегистрыСведений.НастройкаАктуальности.СохранитьНастройку(Отказ, ИмяОбъекта, Настройка, Дата);
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
	КонецЕсли; 
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНастроекНаСервере(ИмяОбъекта, Владелец)
	
	Настройки = РегистрыСведений.НастройкаАктуальности.СформироватьТаблицуНастроек(ИмяОбъекта, Владелец);
	
	ЗначениеВРеквизитФормы(Настройки, "ТаблицаНастроек");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные 		= Элементы.ТаблицаНастроек.ТекущиеДанные;
	УдаляемаяНастройка 	= ТекущиеДанные.НаименованиеНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПослеУдаления(Элемент)
	
	Если УдаляемаяНастройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	НачатьТранзакцию();
	
	РегистрыСведений.НастройкаАктуальности.УдалитьНастройкуИзРегистра(Отказ, ИмяОбъекта, УдаляемаяНастройка);
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
	КонецЕсли; 
	
	Если ТранзакцияАктивна() Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры



