
&НаКлиенте
Процедура КонтрагентПредставлениеПриИзменении(Элемент)
	
	// Автокорректировка наименования.
	УправлениеКонтрагентамиКлиентСервер.НаименованиеПриИзменении(Объект.КонтрагентПредставление, АвтокорректировкаНаименованийКонтрагентов);
	
КонецПроцедуры // КонтрагентПредставлениеПриИзменении()

&НаКлиенте
Процедура КоличествоКлиентовПриИзменении(Элемент)
	
	Объект.КоличествоКлиентов = Макс(Объект.КоличествоКлиентов, 1);
	
КонецПроцедуры // КоличествоКлиентовПриИзменении()

&НаКлиенте
Процедура ТелефонПредставлениеПриИзменении(Элемент)
	
	СтруктураТелефона = УправлениеКонтрагентамиКлиентСервер.ПолучитьПустуюСтруктуруТелефона();
	УправлениеКонтрагентамиКлиентСервер.РазложитьТелефонПоПолям(Объект.ТелефонПредставление, СтруктураТелефона);
	
	Объект.ТелефонПредставление = СтруктураТелефона.Представление;
	Объект.ТелефонПоиск = СтруктураТелефона.Поиск;
	
	Если ПустаяСтрока(Объект.ТелефонПредставление) Тогда
		Объект.ТелефонПредставление = Объект.ТелефонДополнительныйПредставление;
		Объект.ТелефонПоиск = Объект.ТелефонДополнительныйПоиск;
		Объект.ТелефонДополнительныйПредставление = Неопределено;
		Объект.ТелефонДополнительныйПоиск = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ТелефонПредставлениеПриИзменении()

&НаКлиенте
Процедура ТелефонДополнительныйПредставлениеПриИзменении(Элемент)
	
	СтруктураТелефона = УправлениеКонтрагентамиКлиентСервер.ПолучитьПустуюСтруктуруТелефона();
	УправлениеКонтрагентамиКлиентСервер.РазложитьТелефонПоПолям(Объект.ТелефонДополнительныйПредставление, СтруктураТелефона);
	
	Объект.ТелефонДополнительныйПредставление = СтруктураТелефона.Представление;
	Объект.ТелефонДополнительныйПоиск = СтруктураТелефона.Поиск;
	
	Если ПустаяСтрока(Объект.ТелефонПредставление) Тогда
		Объект.ТелефонПредставление = Объект.ТелефонДополнительныйПредставление;
		Объект.ТелефонПоиск = Объект.ТелефонДополнительныйПоиск;
		Объект.ТелефонДополнительныйПредставление = Неопределено;
		Объект.ТелефонДополнительныйПоиск = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ТелефонДополнительныйПредставлениеПриИзменении()

&НаКлиенте
Процедура НесколькоСтоловПриИзменении(Элемент)
	
	Если (НесколькоСтолов = 1) Тогда
		Если (ТекущийЭлемент = Элементы.Столы) Тогда
			ТекущийЭлемент = Элементы.Стол;
		КонецЕсли;
		Элементы.ГруппаВариантовСтолов.ТекущаяСтраница = Элементы.ГруппаСтол;
	Иначе
		Если (ТекущийЭлемент = Элементы.Стол) Тогда
			ТекущийЭлемент = Элементы.Столы;
		КонецЕсли;
		Элементы.ГруппаВариантовСтолов.ТекущаяСтраница = Элементы.ГруппаСтолы;
	КонецЕсли;
	
КонецПроцедуры // НесколькоСтоловПриИзменении()

&НаКлиенте
Процедура НесколькоСтоловПриИзмененииОтложенныйВызов()
	
	НесколькоСтоловПриИзменении(Неопределено);
	
КонецПроцедуры // НесколькоСтоловПриИзмененииОтложенныйВызов()

&НаКлиенте
Процедура СтолПриИзменении(Элемент)
	
	Столы.Очистить();
	Если ЗначениеЗаполнено(Объект.Стол) Тогда
		Столы.Добавить(Объект.Стол);
	КонецЕсли;
	
КонецПроцедуры // СтолПриИзменении()

&НаКлиенте
Процедура СтолыПриИзменении(Элемент)
	
	Если Столы.Количество() Тогда
		Объект.Стол = Столы[0].Значение;
	Иначе
		Объект.Стол = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // СтолыПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Создание.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли;
	
	// Автокорректировка наименования.
	АвтокорректировкаНаименованийКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьАвтокорректировкуНаименованийКонтрагентов");
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Столы.
	Для Каждого СтрокаТабличнойЧастиСтолы Из Объект.Столы Цикл
		Столы.Добавить(СтрокаТабличнойЧастиСтолы.Стол);
	КонецЦикла;
	Если ЗначениеЗаполнено(Объект.Стол) И (Столы.НайтиПоЗначению(Объект.Стол) = Неопределено) Тогда
		Столы.Добавить(Объект.Стол);
	КонецЕсли;
	
	// Настройка формы.
	НесколькоСтолов = Мин(Макс(Объект.Столы.Количество(), 1), 2);
	Если (НесколькоСтолов = 1) Тогда
		Элементы.ГруппаВариантовСтолов.ТекущаяСтраница = Элементы.ГруппаСтол;
	Иначе
		Элементы.ГруппаВариантовСтолов.ТекущаяСтраница = Элементы.ГруппаСтолы;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Настройка формы.
	ТолькоПросмотр = ТолькоПросмотр Или ТекущийОбъект.ПометкаУдаления;
	Элементы.ДекорацияРаспечатан.Видимость = Не ТекущийОбъект.ПометкаУдаления;
	Элементы.Распечатан.Видимость = Не ТекущийОбъект.ПометкаУдаления;
	Элементы.ДекорацияРаспечатанОтступ.Видимость = Не ТекущийОбъект.ПометкаУдаления;
	Элементы.ПричинаОтказа.Видимость = ТекущийОбъект.ПометкаУдаления;
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = Не ПроверитьЗаполнение();
	
	// Режим записи.
	УправлениеДокументамиКлиентСервер.ПолучитьРежимЗаписиДокумента(Объект, ПараметрыЗаписи.РежимЗаписи);

КонецПроцедуры // ПередЗаписью()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Столы.
	ТекущийОбъект.Столы.Очистить();
	Для Каждого ЭлементСпискаЗначенийСтолы Из Столы Цикл
		ТекущийОбъект.Столы.Добавить().Стол = ЭлементСпискаЗначенийСтолы.Значение;
	КонецЦикла;

КонецПроцедуры // ПередЗаписьюНаСервере()
