
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		// Заполнение.
		Запись.РежимыНастройкиРабочихЦентров = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Запись.РежимыНастройкиРабочихЦентров, Перечисления.РежимыНастройкиРабочихЦентров.НоменклатурныеГруппы);
		Запись.РежимНастройкиРабочихЦентровНоменклатурныеГруппы = (Запись.РежимыНастройкиРабочихЦентров = Перечисления.РежимыНастройкиРабочихЦентров.НоменклатурныеГруппы) Или
																  (Запись.РежимыНастройкиРабочихЦентров = Перечисления.РежимыНастройкиРабочихЦентров.НоменклатурныеГруппыНоменклатура);
		Запись.РежимНастройкиРабочихЦентровНоменклатура = (Запись.РежимыНастройкиРабочихЦентров = Перечисления.РежимыНастройкиРабочихЦентров.Номенклатура) Или
														  (Запись.РежимыНастройкиРабочихЦентров = Перечисления.РежимыНастройкиРабочихЦентров.НоменклатурныеГруппыНоменклатура);
														  
		//Костенюк Александр-Старт 12.04.2016
		Запись.УчетРабочегоВремениУчетРабочихСмен 				= ?(Запись.УчетРабочегоВремениИспользовать, Запись.УчетРабочегоВремениУчетРабочихСмен, Ложь);
		Запись.УчетРабочегоВремениКоэффициентОкругленияПериода 	= ?(Запись.УчетРабочегоВремениИспользовать, Запись.УчетРабочегоВремениКоэффициентОкругленияПериода, Неопределено);
		//Костенюк Александр-Финиш 12.04.2016

	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
