
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата();
	
	// Заполнение реквизитов.
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Запись.Получено = Запись.Получено Или Запись.Прочитано;
		
		Если Не ЗначениеЗаполнено(Запись.Сотрудник) Тогда
			Запись.Сотрудник = Запись.Документ.Сотрудник;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.ДатаНачалаПериода) Тогда
			Запись.ДатаНачалаПериода = ТекущаяДата;
		КонецЕсли;
		Если Запись.Прочитано Тогда
			Если Не ЗначениеЗаполнено(Запись.ДатаОкончанияПериода) Тогда
				Запись.ДатаОкончанияПериода = ТекущаяДата;
			КонецЕсли;
		Иначе
			Запись.ДатаОкончанияПериода = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
