
Процедура ПередЗаписью(Отказ)

	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Нормализация.
	МассивОснований = Состав.ВыгрузитьКолонку("Основание");
	
	// Поиск.
	Поиск = Строка(Неопределено);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПроизводственныеГруппы.Поиск КАК Поиск
	                      |ИЗ
	                      |	Справочник.ПроизводственныеГруппы КАК ПроизводственныеГруппы
	                      |ГДЕ
	                      |	ПроизводственныеГруппы.Ссылка В(&Основания)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Поиск");
	Запрос.УстановитьПараметр("Основания", МассивОснований);						  
	Выборка = Запрос.Выполнить().Выбрать();						  
	Первая = Истина; Пока Выборка.Следующий() Цикл
		Поиск = Поиск + Выборка.Поиск;
	КонецЦикла;
						  
	// Наименование и пометка удаления.
	Наименование = Строка(Неопределено); ПометкаУдаления = Ложь;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПроизводственныеГруппы.Наименование КАК Наименование,
	                      |	ПроизводственныеГруппы.ПометкаУдаления
	                      |ИЗ
	                      |	Справочник.ПроизводственныеГруппы КАК ПроизводственныеГруппы
	                      |ГДЕ
	                      |	ПроизводственныеГруппы.Ссылка В(&Основания)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Наименование");
	Запрос.УстановитьПараметр("Основания", МассивОснований);						  
	Выборка = Запрос.Выполнить().Выбрать();						  
	Первая = Истина; Пока Выборка.Следующий() Цикл
		Если Первая Тогда
			Наименование = Выборка.Наименование; Первая = Ложь;
		Иначе
			Наименование = Наименование + ", " + Выборка.Наименование; Первая = Ложь;
		КонецЕсли;
		ПометкаУдаления = ПометкаУдаления Или Выборка.ПометкаУдаления;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПередЗаписью()

