   Функция НайтиСписокВидовСертификатов() Экспорт
	   
	   Запрос = Новый Запрос("ВЫБРАТЬ
	   |	ВидыСертификатов.Ссылка
	   |ИЗ
	   |	Справочник.ВидыСертификатов КАК ВидыСертификатов
	   |ГДЕ
	   |	(НЕ ВидыСертификатов.ПометкаУдаления)");
	   Результат = Запрос.Выполнить().Выгрузить();
	   Возврат Результат.ВыгрузитьКолонку("Ссылка");
	   
   КонецФункции  
   
   Процедура СоздатьЗаписьВСправочнике(CODE, NAME, REQUIREDDISCOUNT, REQUIREDPASSWORD, СтрАнализа) Экспорт 
	   
	   Ссылка = НайтиЭлементВСправочнике(CODE);
	   
	   Если не Ссылка.Пустая() Тогда
		   НовыйСправочник  = Ссылка.ПолучитьОбъект();              
	   Иначе 	  
		   НовыйСправочник  = Справочники.ВидыСертификатов.СоздатьЭлемент();
		   //НовыйСправочник.УстановитьНовыйКод();
		   СтрАнализа.Новых = СтрАнализа.Новых + 1;
	   КонецЕсли;
	   
	   НовыйСправочник.Код =  CODE;
	   НовыйСправочник.Наименование = NAME;
	   НовыйСправочник.НеобходимаДисконтнаяКатрочка = REQUIREDDISCOUNT;
	   НовыйСправочник.НеобходимПароль = REQUIREDPASSWORD;
	   
	   Попытка
		   НовыйСправочник.ОбменДанными.Загрузка = Истина;
		   НовыйСправочник.Записать();
	   Исключение
		   //Ошибка = ОписаниеОшибки();
	   КонецПопытки;                             
	   
   КонецПроцедуры
   
   Функция НайтиЭлементВСправочнике(CODE) Экспорт
	   Запрос = Новый Запрос;
	   Запрос.УстановитьПараметр("Код", CODE);	
	   Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	   |	ВидыСертификатов.Ссылка
	   |ИЗ
	   |	Справочник.ВидыСертификатов КАК ВидыСертификатов
	   |ГДЕ
	   |	ВидыСертификатов.Код = &Код";
	   
	   Результат = Запрос.Выполнить();
	   
	   Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	   
	   Если Выборка.Следующий() Тогда
		   Возврат Выборка.Ссылка;   
	   Иначе 
		   Возврат Справочники.ВидыСертификатов.ПустаяСсылка();	   
	   КонецЕсли;
	   
   КонецФункции
   
   
// Рефакторинг: 
//	1. Перенести в соответсвующую загрузку;
//	2. Переименовать "НеобходимаДисконтнаяКатрочка" в "НеобходимаДисконтнаяКарточка" (опечатка в слове "Карточка").