
&НаКлиенте
Процедура УстановитьВидимость()
	
	// Командная панель.
	Элементы.ПодробныйРежим.Пометка = ПодробныйРежим;
	Элементы.РежимДокументовОснований.Пометка = РежимДокументовОснований;
	
	// Элементы.
	Элементы.ГруппаПериод.Видимость = (Не РежимВыбора) И ПодробныйРежим;
	Элементы.ДокументыОснования.Видимость = (Не РежимВыбора) И РежимДокументовОснований;
	Элементы.ДокументыОснованияГруппаПериод.Видимость = (Не РежимВыбора) И ПодробныйРежим;
	Элементы.ДокументыОснованияДокументОснованиеСуммаДокументаБезСкидок.Видимость = Элементы.ДокументыОснованияГруппаПериод.Видимость;
	Элементы.ДокументыОснованияДокументОснованиеСуммаНаценкиДокумента.Видимость = Элементы.ДокументыОснованияГруппаПериод.Видимость;
	Элементы.ДокументыОснованияДокументОснованиеСуммаСкидкиДокумента.Видимость = Элементы.ДокументыОснованияГруппаПериод.Видимость;
	Элементы.ДокументыОснованияДокументОснованиеОтветственный.Видимость = Элементы.ДокументыОснованияГруппаПериод.Видимость;
	Элементы.ДокументыОснованияДокументОснованиеКомментарий.Видимость = Элементы.ДокументыОснованияГруппаПериод.Видимость;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ПодробныйРежим(Команда)
	
	ПодробныйРежим = Не ПодробныйРежим;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПодробныйРежим()

&НаКлиенте
Процедура РежимДокументовОснований(Команда)
	
	РежимДокументовОснований = Не РежимДокументовОснований;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // РежимДокументовОснований()

&НаКлиенте
Процедура ОткрытьДокументОснование(Команда)
	
	Если (Не Элементы.ДокументыОснования.ТекущиеДанные = Неопределено) Тогда
		Если ЗначениеЗаполнено(Элементы.ДокументыОснования.ТекущиеДанные.ДокументОснование) Тогда
			ОткрытьЗначение(Элементы.ДокументыОснования.ТекущиеДанные.ДокументОснование);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ОткрытьДокументОснование()


&НаКлиенте
Процедура ДокументыОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьДокументОснование(Неопределено);
	
КонецПроцедуры // ДокументыОснованияВыбор()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Режим выбора.
	РежимВыбора = __РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список,
		"ПодробныйРежим,РежимДокументовОснований, ГруппаПериод,СуммаДокументаБезСкидок,СуммаНаценкиДокумента,СуммаСкидкиДокумента,Ответственный,Комментарий, ДокументыОснования");
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПриОткрытии()
