
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ПриИзмененииНоменклатурыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНоменклатурыНаСервере()
	
	ЭтотОбъект 				= РеквизитФормыВЗначение("Объект");
	СтрокаТабличнойЧасти 	= Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, , "Товары");
	ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, ЭтотОбъект.мВалютаРегламентированногоУчета, ЭтотОбъект.мВалютаРегламентированногоУчета, , Истина, "Товары");
	ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект, , "Товары");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ПриИзмененииКоличестваНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКоличестваНаСервере()
	
	ЭтотОбъект 	= РеквизитФормыВЗначение("Объект");
	Товары 		= Объект.Товары.Выгрузить();	
	
	ОбработкаТабличныхЧастей.РассчитатьСуммыПриПродаже(ЭтотОбъект, Товары);
	Объект.Товары.Загрузить(Товары);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ПриИзмененииЦеныНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииЦеныНаСервере()
	
	ЭтотОбъект 	= РеквизитФормыВЗначение("Объект");
	Товары 		= Объект.Товары.Выгрузить();	
	
	ОбработкаТабличныхЧастей.РассчитатьСуммыПриПродаже(ЭтотОбъект, Товары);
	Объект.Товары.Загрузить(Товары);
	
КонецПроцедуры



