
Функция ПолучитьНомерСокращенный(Номер) Экспорт
	
	Количество = Метаданные.РегистрыСведений.СоответствиеСокращенныхНомеров.Измерения.Номер.Тип.КвалификаторыЧисла.Разрядность;
	
	// Соответсвие.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СоответствиеСокращенныхНомеров.НомерСокращенный
	                      |ИЗ
	                      |	РегистрСведений.СоответствиеСокращенныхНомеров КАК СоответствиеСокращенныхНомеров
	                      |ГДЕ
	                      |	СоответствиеСокращенныхНомеров.Номер = &Номер");
	Запрос.УстановитьПараметр("Номер", ОбщегоНазначения.ПолучитьЧисло(УправлениеКонтактнойИнформацией.ПолучитьТолькоЦифры(Номер)) % Pow(10, Количество));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Строка(Неопределено);
	КонецЕсли;
	
	// Результат.
	Возврат Формат(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("НомерСокращенный")[0], "ЧЦ=" + Количество + "; ЧДЦ=0; ЧН=; ЧВН=; ЧГ=");
	
КонецФункции // ПолучитьНомерСокращенный()	
