
#Если Клиент Тогда
	
// Функция выбора стола через числовую экранную клавиатура.
//
// Параметры:
//  Стол, СправочникСсылка.Столы. Начальное значение стола;
//	РежимПоиска, Булево. Включает ввод стола в режиме поиска;
//	ТаблицаСтолов, ТаблицаЗначений. Таблица доступных для выбора столов.
//
// Возвращаемое значение:
//	Булево. Истина - если был осуществлен выбор стола;
//  Стол, СправочникСсылка.Столы. Выбранны стол;
//  ПостфиксСтола, Число.4.0. Постфикс выбранного стола (только для режима поиска).
//
Функция ВыборСтола(Стол = Неопределено, ПостфиксСтола = Неопределено, РежимПоиска = Ложь, ТаблицаСтолов, ПолныйНомерСтола = Неопределено) Экспорт
	
	// Перенос параметров.
	ЭтотОбъект.Стол = Стол;
	ЭтотОбъект.ПостфиксСтола = ПостфиксСтола;
	ЭтотОбъект.РежимПоиска = РежимПоиска;
	ЭтотОбъект.ТаблицаСтолов = ТаблицаСтолов;
	
	// Открываем форму выбора.
	Форма = ЭтотОбъект.ПолучитьФорму("Форма");
	
	// Выбор значения.
	ПараметрЗакрытия = Форма.ОткрытьМодально();
	Если (ТипЗнч(ПараметрЗакрытия) = Тип("Булево"))  Тогда
		Стол = ЭтотОбъект.Стол;
		ПостфиксСтола = ЭтотОбъект.ПостфиксСтола;
		ПолныйНомерСтола = Строка(ЭтотОбъект.Стол.Код); Если Булево(ПостфиксСтола) Тогда ПолныйНомерСтола = ПолныйНомерСтола + "." + Строка(ПостфиксСтола); КонецЕсли;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ВыборСтола()

#КонецЕсли
