
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	// Дата.
	Дата.Дата = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустуюДату(Дата.Дата);
	
КонецПроцедуры // ДатаПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Дата.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);	
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Дата.
	ЗаполнитьЗначенияСвойств(Дата, РегистрыСведений.КассовыеДаты.ПолучитьПараметрыКассовойДаты(ТекущийОбъект));
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Дата.
	Если Не Отказ Тогда
		РегистрыСведений.КассовыеДаты.УстановитьДату(ТекущийОбъект, Дата.Дата, Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписиНаСервере()
