
&НаКлиенте
Процедура УстановитьВидимость()
	
	// Командная панель.
	Элементы.ПодробныйРежим.Пометка = ПодробныйРежим;
	Элементы.РежимАктуальности.Пометка = РежимАктуальности;
	
	// Элементы.
	Элементы.ИндексАктуальности.Видимость = РежимАктуальности;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ПодробныйРежим(Команда)
	
	ПодробныйРежим = Не ПодробныйРежим;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПодробныйРежим()

&НаКлиенте
Процедура РежимАктуальности(Команда)
	
	РежимАктуальности = Не РежимАктуальности;
	
	// Параметры.
	Список.Параметры.УстановитьЗначениеПараметра("РежимАктуальности", РежимАктуальности);
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ВключаяНеактуальные()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Параметры.
	Список.Параметры.УстановитьЗначениеПараметра("РежимАктуальности", РежимАктуальности);
	
	// Режим выбора.
	__РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список,
		"ПодробныйРежим, ИндексАктуальности,Префикс,НаименованиеПолное,Комментарий");
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПриОткрытии()
