
// Функция ввода числа через числовую экранную клавиатура.
//
// Параметры:
//	Число - Число. Значение по умолчанию;
//	Подсказка - Строка. Заголовок формы выбора;
//	Длина - Число. Длинна числа;
//	Точность - Число. Точность числа;
//	Мин - Число. Минимальное допустимое значение;
//	Макс - Число. Максимальное допустимое значение.
//
// Возвращаемое значение:
//	Булево. Истина - если был осуществления выбор значения;
//  Число - Число. Введенное значение.
//
Функция ВводЧисла(Число, Подсказка = "", Длина = 0, Точность = 0, Мин = Неопределено, Макс = Неопределено) Экспорт
	
	// Определение типа значения.
	ОписаниеТипов = Новый ОписаниеТипов("Число",, Новый КвалификаторыЧисла(Длина, Точность, ДопустимыйЗнак.Неотрицательный));
	ЭтотОбъект.Значение = ОписаниеТипов.ПривестиЗначение(Число);
	
	// Открываем форму выбора.
	Форма = ЭтотОбъект.ПолучитьФорму("ФормаЧисла");
	Форма.ОписаниеТипов = ОписаниеТипов;
	Если ПустаяСтрока(Подсказка) Тогда
		Форма.Заголовок = "Введите число";
	Иначе
		Форма.Заголовок = Подсказка;
	КонецЕсли;
	ФорматнаяСтрока = "ЧЦ=" + Строка(ОписаниеТипов.КвалификаторыЧисла.Разрядность) +"; ЧДЦ=" + ОписаниеТипов.КвалификаторыЧисла.РазрядностьДробнойЧасти + "; ЧН=";
	Если (Не Мин = Неопределено) И Булево(Мин) И (Не Макс = Неопределено) Тогда
		Форма.Заголовок = Форма.Заголовок + " (от " + Формат(Мин, ФорматнаяСтрока) + " до " + Формат(Макс, ФорматнаяСтрока) + ")";
	ИначеЕсли (Не Мин = Неопределено) И Булево(Мин) Тогда
		Форма.Заголовок = Форма.Заголовок + " (от " + Формат(Мин, ФорматнаяСтрока) + ")";
	ИначеЕсли (Не Макс = Неопределено) Тогда
		Форма.Заголовок = Форма.Заголовок + " (до " + Формат(Макс, ФорматнаяСтрока) + ")";
	КонецЕсли;
	Форма.Мин = Мин;
	Форма.Макс = Макс;
	
	// Выбор значения.
	ПараметрЗакрытия = Форма.ОткрытьМодально();
	Если (ТипЗнч(ПараметрЗакрытия) = Тип("Булево"))  Тогда
		Число = ЭтотОбъект.Значение;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ВводДаты(Дата, Подсказка = "", ЧастьДаты = Неопределено) Экспорт
КонецФункции

Функция ВводСтроки(Строка, Подсказка = "", Длина = 0, Многострочность = Ложь) Экспорт
КонецФункции

// Функция ввода пароля через числовую экранную клавиатура.
//
// Возвращаемое значение:
//	Булево, Истина - если был осуществления ввода пароя;
//  ВведенныйПароль, Строка, введенный пароль.
//
Функция ВводПароля(ВведенныйПароль) Экспорт
	
	//// Определение типа значения.
	//ОписаниеТипов = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50));
	//ЭтотОбъект.Число = ОписаниеТипов.ПривестиЗначение("");
	//
	//// Открываем форму выбора.
	//Форма = ЭтотОбъект.ПолучитьФорму("Форма");
	//Форма.Заголовок = "Введите числовой код";
	//
	//// Выбор значения.
	//ПараметрЗакрытия = Форма.ОткрытьМодально();
	//Если (ТипЗнч(ПараметрЗакрытия) = Тип("Булево"))  Тогда
	//	ВведенныйПароль = Число;
	//	
	//	Возврат Истина;
	//КонецЕсли;
	//
	//Возврат Ложь;
	//
КонецФункции