
Функция НомерДняНедели(ДеньНедели) Экспорт
	
	// Метаданные не используются намеренно.
	Если (ДеньНедели = Перечисления.ДниНедели.Понедельник) Тогда
		Возврат 1;
	КонецЕсли; 
	Если (ДеньНедели = Перечисления.ДниНедели.Вторник) Тогда
		Возврат 2;
	КонецЕсли; 
	Если (ДеньНедели = Перечисления.ДниНедели.Среда) Тогда
		Возврат 3;
	КонецЕсли; 
	Если (ДеньНедели = Перечисления.ДниНедели.Четверг) Тогда
		Возврат 4;
	КонецЕсли; 
	Если (ДеньНедели = Перечисления.ДниНедели.Пятница) Тогда
		Возврат 5;
	КонецЕсли; 
	Если (ДеньНедели = Перечисления.ДниНедели.Суббота) Тогда
		Возврат 6;
	КонецЕсли; 
	Если (ДеньНедели = Перечисления.ДниНедели.Воскресенье) Тогда
		Возврат 7;
	КонецЕсли; 

	Возврат 0;

КонецФункции // НомерДняНедели()
 