
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не ЭтоГруппа Тогда
		Если Не __УправлениеДаннымиСервер.ПроверитьУникальностьРеквизитаСправочника(ЭтотОбъект, "Номенклатура") Тогда
			Отказ = Истина; // ERR
		КонецЕсли; 
	КонецЕсли;
	
	//// Проверка заполнения реквизитов.
	//Заголовок = "Запись элемента справочника «" + ОбщегоНазначения.ПредставлениеСправочникаДляЗаголовкаСообщения(ЭтотОбъект) + "»: ";	
	//Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Номенклатура) Тогда
	//	ОбщегоНазначения.СообщитьОбНезаполненомРеквизитеСправочника(Ссылка, "Наименование/Номенклатура", Отказ, Заголовок);
	//КонецЕсли;	
	//Если Не Отказ Тогда
	//	Если ЗначениеЗаполнено(Номенклатура) Тогда
	//		Если ТипЗнч(Номенклатура) =Тип("СправочникСсылка.Номенклатура") Тогда
	//			Наименование = Номенклатура.Наименование;
	//		ИначеЕсли  ТипЗнч(Номенклатура) =Тип("Строка") Тогда
	//			// Чистяков Павел 24.11.2011 12:06:23 
	//			Наименование = Номенклатура;
	//		КонецЕсли; 
	//	КонецЕсли;		
	//КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		Наименование = Неопределено;
		Номенклатура = Неопределено;
		Актуальность = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	// Заполнение реквизитов.
	Если Не ЭтоГруппа Тогда
		Наименование = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеНаименование(Номенклатура);
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый()); //Костенюк Александр 28.04.2015
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	//РегистрыСведений.НастройкиПравДоступаПользователей.УстановитьПраваДоступаПоВладельцу(Ссылка, ДополнительныеСвойства.Свойство("ЭтоНовый"), "ГруппыПользователей"); //Костенюк Александр 29.04.2015
	
КонецПроцедуры

