
// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Нормализация.
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.ПродолжительностьВыполнения = НачалоМинуты(Макс(Запись.ПродолжительностьВыполнения, '00010101001000'));
		Запись.ПродолжительностьДоставки = НачалоМинуты(Макс(Запись.ПродолжительностьДоставки, '00010101000500'));
		Запись.ПродолжительностьПроизводства = НачалоМинуты(Макс(Запись.ПродолжительностьПроизводства, '00010101000500'));
		
		Запись.ПродолжительностьВыполнения = Макс(Запись.ПродолжительностьВыполнения, 
												  Запись.ПродолжительностьЗадержки + ОбщегоНазначения.ПолучитьЧисло(Запись.ПродолжительностьПроизводства) + ОбщегоНазначения.ПолучитьЧисло(Запись.ПродолжительностьДоставки));
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
