
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если не ПустаяСтрока(Параметры.Кодировка) и ЗначениеЗаполнено(Параметры.ПолноеИмяФайла) Тогда
		ТаблицаЗагрузкиDBF = РеквизитФормыВЗначение("Объект").DBFвТаблицу(Параметры.ПолноеИмяФайла, Параметры.Кодировка);
	КонецЕсли;
	
	МассивДобавляемыеРеквизиты = Новый Массив;
	
	Для каждого КолонкаРезультата из ТаблицаЗагрузкиDBF.Колонки Цикл
		МассивДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(КолонкаРезультата.Имя, КолонкаРезультата.ТипЗначения, "ТаблицаЗагрузки" ));
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивДобавляемыеРеквизиты);
    ЗначениеВРеквизитФормы(ТаблицаЗагрузкиDBF,"ТаблицаЗагрузки");

	ЭлементДерево = Элементы.Добавить("ТаблицаЗагрузки", Тип("ТаблицаФормы"));
    ЭлементДерево.ПутьКДанным = "ТаблицаЗагрузки";
	ЭлементДерево.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	
	Для Каждого Колонка Из ТаблицаЗагрузкиDBF.Колонки Цикл
        НовыйЭлемент = Элементы.Добавить("Таблица_" + Колонка.Имя, Тип("ПолеФормы"), ЭлементДерево);
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлемент.ПутьКДанным = "ТаблицаЗагрузки." + Колонка.Имя;
	КонецЦикла;
	
	 ЭтаФорма.Заголовок = "Просматриваемый файл: "+ Параметры.ПолноеИмяФайла;
	
КонецПроцедуры
