
// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка заполнения реквизитов.
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Запись.Комментарий = СОКРЛ(Запись.Комментарий);
		
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРесурсеРегистра(ЭтотОбъект, "Номенклатура", Отказ);
		КонецЕсли;
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.НоменклатурнаяГруппа) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРесурсеРегистра(ЭтотОбъект, "НоменклатурнаяГруппа", Отказ);
		КонецЕсли;
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.ВидНоменклатуры) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРеквизитеРегистра(ЭтотОбъект, "ВидНоменклатуры", Отказ);
		КонецЕсли;
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.Дата) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРеквизитеРегистра(ЭтотОбъект, "Дата", Отказ);
		КонецЕсли;
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.Модуль) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРеквизитеРегистра(ЭтотОбъект, "Модуль", Отказ);
		КонецЕсли;
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.Номер) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРеквизитеРегистра(ЭтотОбъект, "Номер", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
