
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Состав = Метаданные.ПланыОбмена.ОбменДанными2K_CRS.Состав;
	СписокСоставаПоПолномуИмени = Новый Массив;
	Для каждого ЭлСостава Из Состав Цикл
		МДЭлемента = ЭлСостава.Метаданные;
		СписокСоставаПоПолномуИмени.Добавить(МДЭлемента.ПолноеИмя());
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСоставаПоПолномуИмени", СписокСоставаПоПолномуИмени);
	Запрос.УстановитьПараметр("УзелОбмена", Объект.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Ссылка
	|ПОМЕСТИТЬ ИдентификаторыМД
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя В(&СписокСоставаПоПолномуИмени)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИдентификаторыМД.Ссылка,
	|	ВЗУзелОбмена.ИдентификаторОбъектаНастройки
	|ИЗ
	|	ИдентификаторыМД КАК ИдентификаторыМД
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОбменДанными.ИдентификаторОбъектаНастройки КАК ИдентификаторОбъектаНастройки
	|		ИЗ
	|			ПланОбмена.ОбменДанными2K_CRS.НастройкиСвязейМеждуБазамиРС КАК ОбменДанными
	|		ГДЕ
	|			ОбменДанными.Ссылка = &УзелОбмена) КАК ВЗУзелОбмена
	|		ПО ИдентификаторыМД.Ссылка = ВЗУзелОбмена.ИдентификаторОбъектаНастройки
	|ГДЕ
	|	ВЗУзелОбмена.ИдентификаторОбъектаНастройки ЕСТЬ NULL ";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НС = Объект.НастройкиСвязейМеждуБазамиРС.Добавить();
		НС.ИдентификаторОбъектаНастройки = ВыборкаДетальныеЗаписи.Ссылка
		
	КонецЦикла;
	
	Объект.НастройкиСвязейМеждуБазамиРС.Сортировать("ИсточникДанныхОбъекта Убыв, ИдентификаторОбъектаНастройки");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбщуюФорму(Команда)
	ОткрытьФорму("ПланОбмена.ОбменДанными2K_CRS.Форма.ФормаОбъектаУпр") 
КонецПроцедуры
