
&НаКлиенте
Процедура ПравилаПринадлежностиПринадлежностьПриИзменении(Элемент)

	// Принадлежность.
	__РаботаСДаннымиКлиентСервер.ИзменитьПравилаПринадлежностиПодчиненных(Элемент, ПравилаПринадлежности);
	
КонецПроцедуры // ПравилаПринадлежностиПринадлежностьПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Принадлежность.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// Принадлежность.
	__РаботаСДаннымиКлиентСервер.ПолучитьПравилаПринадлежности(ТекущийОбъект, "Номенклатура", "КатегорияНоменклатуры", ПравилаПринадлежности);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Принадлежность.
	__РаботаСДаннымиКлиентСервер.УстановитьПравилаПринадлежности(ТекущийОбъект, "Номенклатура", "КатегорияНоменклатуры", ПравилаПринадлежности, Отказ);
	
КонецПроцедуры // ПриЗаписиНаСервере()
