
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	//ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Модуль", ПредопределенноеЗначение("Перечисление.МодулиИПодсистемы.Ресторан")));
	//ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, Строка(ПараметрыВыполненияКоманды.Уникальность) + "-Ресторан", ПараметрыВыполненияКоманды.Окно);
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаСписка", , ПараметрыВыполненияКоманды.Источник, Строка(ПараметрыВыполненияКоманды.Уникальность) + "-Ресторан", ПараметрыВыполненияКоманды.Окно); //Костенюк Александр 04.03.2014
	
КонецПроцедуры // ОбработкаКоманды()
