
Процедура Обновить(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура,
					ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, 
					ТабличноеПолеСравнениеПериодов, ТабличноеПолеТекущаяДата, ТабличноеПолеВыполнениеПлана, ТабличноеПолеПланФакт,
					Показатель, ДиаграммаСравнениеПериодов, ДиаграммаВыполнениеПланаСумма, ДиаграммаВыполнениеПланаВаловыйДоход,
					ДиаграммаИзменениеПоказателей, ДиаграммаПланФакт, 
					ДиаграммаСреднийЧек, ДиаграммаПоказатели) Экспорт
					
	Если Показатель = "СредняяТранзакция" ИЛИ Показатель = "КЦПТранзакция" Тогда
		ОбновитьСравнениеПериодовПоСотрудникамДиаграмма(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, Показатель, ДиаграммаСреднийЧек, ДиаграммаПоказатели);
	Иначе
		ОбновитьСравнениеПериодов(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, ТабличноеПолеСравнениеПериодов);
		ОбновитьСравнениеПериодовДиаграмма(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, Показатель, ДиаграммаСравнениеПериодов);
		ОбновитьТекущаяДата(НачалоДня(ТекущаяДата()), КонецДня(ТекущаяДата()), Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, ТабличноеПолеТекущаяДата);
		//ОбновитьТекущаяДата(НачалоДня(Дата('20170516')), КонецДня(Дата('20170516')), Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, ТабличноеПолеТекущаяДата);
		РезультатЗапроса = СформироватьЗапросПланФакт(НачалоМесяца(ТекущаяДата()), КонецДня(ТекущаяДата()), Ресторан, Оплата, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета);
		ОбновитьВыполнениеПлана(РезультатЗапроса, ТабличноеПолеВыполнениеПлана);
		ОбновитьВыполнениеПланаДиаграмма(РезультатЗапроса, ДиаграммаВыполнениеПланаСумма, ДиаграммаВыполнениеПланаВаловыйДоход);
		ОбновитьИзменениеПоказателейДиаграмма(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, ДиаграммаИзменениеПоказателей);
		ОбновитьПланФакт(НачалоМесяца(ТекущаяДата()), КонецДня(ТекущаяДата()), Ресторан, Оплата, РезультатЗапроса, ТабличноеПолеПланФакт);
		ОбновитьПланФактДиаграмма(НачалоМесяца(ТекущаяДата()), КонецДня(ТекущаяДата()), Ресторан, Оплата, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, Показатель, ДиаграммаПланФакт);
		ОбновитьСравнениеПериодовПоСотрудникамДиаграмма(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, Показатель, ДиаграммаСреднийЧек, ДиаграммаПоказатели);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСравнениеПериодов(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, ТабличныйДокумент)
	
	// Области макета
	Макет 							= ПолучитьМакет("МакетПоказатели");
	ОбластьЗаголовок 				= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка 					= Макет.ПолучитьОбласть("Шапка");
	ОбластьКоличествоГостей 		= Макет.ПолучитьОбласть("СтрокаКоличествоГостей");
	ОбластьСумма 					= Макет.ПолучитьОбласть("СтрокаСумма");
	ОбластьВаловыйДоход 			= Макет.ПолучитьОбласть("СтрокаВаловыйДоход");
	ОбластьСреднийЧек 				= Макет.ПолучитьОбласть("СтрокаСреднийЧек");
	ОбластьКЦП 						= Макет.ПолучитьОбласть("СтрокаКЦП");
	ОбластьЦена 					= Макет.ПолучитьОбласть("СтрокаЦена");
	ОбластьКоличествоГостейСреднее 	= Макет.ПолучитьОбласть("СтрокаКоличествоГостейСреднее");
	ОбластьСредняяТранзакция 		= Макет.ПолучитьОбласть("СтрокаСредняяТранзакция");
	ОбластьСебестоимостьПроцент 	= Макет.ПолучитьОбласть("СтрокаСебестоимостьПроцент");
	ОбластьВаловыйДоходПроцент 		= Макет.ПолучитьОбласть("СтрокаВаловыйДоходПроцент");
	ОбластьЧайКофеПроцент 			= Макет.ПолучитьОбласть("СтрокаЧайКофеПроцент");
	
	РезультатЗапросаПериоды = СформироватьЗапросПериоды(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета);
	
	Если РезультатЗапросаПериоды.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапросаПериоды.Выбрать();
	Выборка.Следующий();
	
	ТабличныйДокумент.Очистить();
	
	// Заголовок
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = "Сравнение периодов";
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	// Шапка
	ОбластьШапка.Параметры.Колонка1 = ФорматированнаяСтрока(НачалоПериода1, КонецПериода1);
	ОбластьШапка.Параметры.Колонка2 = ФорматированнаяСтрока(НачалоПериода2, КонецПериода2);
	ОбластьШапка.Параметры.Колонка3 = "Отклонение";
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	// Строки
	// КоличествоГостей
	ОбластьКоличествоГостей.Параметры.Значение1 = Выборка.КоличествоГостей1;
	ОбластьКоличествоГостей.Параметры.Значение2 = Выборка.КоличествоГостей2;
	ОбластьКоличествоГостей.Параметры.Значение3 = Выборка.КоличествоГостейАбсолютноеОтклонение;
	ОбластьКоличествоГостей.Параметры.Значение4 = Выборка.КоличествоГостейПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьКоличествоГостей);
	
	// Сумма
	ОбластьСумма.Параметры.Значение1 = Выборка.Сумма1;
	ОбластьСумма.Параметры.Значение2 = Выборка.Сумма2;
	ОбластьСумма.Параметры.Значение3 = Выборка.СуммаАбсолютноеОтклонение;
	ОбластьСумма.Параметры.Значение4 = Выборка.СуммаПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьСумма);
	
	// ВаловыйДоход
	ОбластьВаловыйДоход.Параметры.Значение1 = Выборка.ВаловыйДоход1;
	ОбластьВаловыйДоход.Параметры.Значение2 = Выборка.ВаловыйДоход2;
	ОбластьВаловыйДоход.Параметры.Значение3 = Выборка.ВаловыйДоходАбсолютноеОтклонение;
	ОбластьВаловыйДоход.Параметры.Значение4 = Выборка.ВаловыйДоходПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьВаловыйДоход);
	
	// СреднийЧек
	ОбластьСреднийЧек.Параметры.Значение1 = Выборка.СреднийЧек1;
	ОбластьСреднийЧек.Параметры.Значение2 = Выборка.СреднийЧек2;
	ОбластьСреднийЧек.Параметры.Значение3 = Выборка.СреднийЧекАбсолютноеОтклонение;
	ОбластьСреднийЧек.Параметры.Значение4 = Выборка.СреднийЧекПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьСреднийЧек);
	
	// КЦП
	ОбластьКЦП.Параметры.Значение1 = Выборка.КЦП1;
	ОбластьКЦП.Параметры.Значение2 = Выборка.КЦП2;
	ОбластьКЦП.Параметры.Значение3 = Выборка.КЦПАбсолютноеОтклонение;
	ОбластьКЦП.Параметры.Значение4 = Выборка.КЦППроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьКЦП);
	
		// Цена
	ОбластьЦена.Параметры.Значение1 = Выборка.Цена1;
	ОбластьЦена.Параметры.Значение2 = Выборка.Цена2;
	ОбластьЦена.Параметры.Значение3 = Выборка.ЦенаАбсолютноеОтклонение;
	ОбластьЦена.Параметры.Значение4 = Выборка.ЦенаПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьЦена);
	
	// КоличествоГостейСреднее
	ОбластьКоличествоГостейСреднее.Параметры.Значение1 = Выборка.КоличествоГостейСреднее1;
	ОбластьКоличествоГостейСреднее.Параметры.Значение2 = Выборка.КоличествоГостейСреднее2;
	ОбластьКоличествоГостейСреднее.Параметры.Значение3 = Выборка.КоличествоГостейСреднееАбсолютноеОтклонение;
	ОбластьКоличествоГостейСреднее.Параметры.Значение4 = Выборка.КоличествоГостейСреднееПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьКоличествоГостейСреднее);
	
	// СредняяТранзакция
	ОбластьСредняяТранзакция.Параметры.Значение1 = Выборка.СредняяТранзакция1;
	ОбластьСредняяТранзакция.Параметры.Значение2 = Выборка.СредняяТранзакция2;
	ОбластьСредняяТранзакция.Параметры.Значение3 = Выборка.СредняяТранзакцияАбсолютноеОтклонение;
	ОбластьСредняяТранзакция.Параметры.Значение4 = Выборка.СредняяТранзакцияПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьСредняяТранзакция);
	
	// СебестоимостьПроцент
	ОбластьСебестоимостьПроцент.Параметры.Значение1 = Строка(Формат(Выборка.СебестоимостьПроцент1, "ЧЦ=10; ЧДЦ=1")) + "%"; 
	ОбластьСебестоимостьПроцент.Параметры.Значение2 = Строка(Формат(Выборка.СебестоимостьПроцент2, "ЧЦ=10; ЧДЦ=1")) + "%";
	ОбластьСебестоимостьПроцент.Параметры.Значение3 = Выборка.СебестоимостьПроцентАбсолютноеОтклонение;
	ОбластьСебестоимостьПроцент.Параметры.Значение4 = Выборка.СебестоимостьПроцентПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьСебестоимостьПроцент);
	
	// ВаловыйДоходПроцент
	ОбластьВаловыйДоходПроцент.Параметры.Значение1 = Строка(Формат(Выборка.ВаловыйДоходПроцент1, "ЧЦ=10; ЧДЦ=1")) + "%";
	ОбластьВаловыйДоходПроцент.Параметры.Значение2 = Строка(Формат(Выборка.ВаловыйДоходПроцент2, "ЧЦ=10; ЧДЦ=1")) + "%";
	ОбластьВаловыйДоходПроцент.Параметры.Значение3 = Выборка.ВаловыйДоходПроцентАбсолютноеОтклонение;
	ОбластьВаловыйДоходПроцент.Параметры.Значение4 = Выборка.ВаловыйДоходПроцентПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьВаловыйДоходПроцент);
	
	// Данные по группе чай/кофе
	РезультатЗапросаПериодыПоГруппе = СформироватьЗапросПериодыПоГруппе(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата);
	
	Если РезультатЗапросаПериодыПоГруппе.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаПоГруппе = РезультатЗапросаПериодыПоГруппе.Выбрать();
	ВыборкаПоГруппе.Следующий();

	// ОбластьЧайКофеПроцент
	ОбластьЧайКофеПроцент.Параметры.Значение1 = Строка(Формат(ВыборкаПоГруппе.КоличествоТранзакцийПроцент1, "ЧЦ=10; ЧДЦ=1")) + "%";
	ОбластьЧайКофеПроцент.Параметры.Значение2 = Строка(Формат(ВыборкаПоГруппе.КоличествоТранзакцийПроцент2, "ЧЦ=10; ЧДЦ=1")) + "%";
	ОбластьЧайКофеПроцент.Параметры.Значение3 = ВыборкаПоГруппе.КоличествоТранзакцийПроцентАбсолютноеОтклонение;
	ОбластьЧайКофеПроцент.Параметры.Значение4 = ВыборкаПоГруппе.КоличествоТранзакцийПроцентПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьЧайКофеПроцент);
	
	Фиксация(ТабличныйДокумент, 14, 5);
	
КонецПроцедуры

Процедура ОбновитьСравнениеПериодовДиаграмма(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, Показатель, Диаграмма);
	
	РезультатЗапросаПериодыПоГруппам = СформироватьЗапросПериодыПоГруппам(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета);
	
	Если РезультатЗапросаПериодыПоГруппам.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапросаПериодыПоГруппам.Выбрать();
	
	// Диаграмма
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы = ТипДиаграммы.ГистограммаОбъемная;
	Диаграмма.ВидПодписей = ВидПодписейКДиаграмме.Значение;
	Диаграмма.АвтоУстановкаТекстаТочек = Ложь;
	Диаграмма.ФорматЗначенийВПодписях = "ЧЦ=10; ЧДЦ=1";
	Диаграмма.БазовоеЗначение = 0;
	Диаграмма.ШрифтПодписей = Новый Шрифт("Verdana", 6);
	
	Если Показатель = "КЦП" Тогда
		ИмяСерии = "КЦП";
	ИначеЕсли Показатель = "Цена" Тогда
		ИмяСерии = "Ср. цена";
	ИначеЕсли Показатель = "СебестоимостьПроцент" Тогда
		ИмяСерии = "FC, %";
	ИначеЕсли Показатель = "ВаловыйДоходПроцент" Тогда
		ИмяСерии = "ВП, %";
	КонецЕсли;
	
	Серия1 = Диаграмма.Серии.Добавить(ИмяСерии + " Пред");
	Серия1.ПриоритетЦвета = Истина;
	Серия1.Цвет = Новый Цвет(255, 255, 0); 
	
	Серия2 = Диаграмма.Серии.Добавить(ИмяСерии + " Тек");
	Серия2.ПриоритетЦвета = Истина;
	Серия2.Цвет = Новый Цвет(175, 238, 238); 

	Пока Выборка.Следующий() Цикл
		
		Точка = Диаграмма.УстановитьТочку(Выборка.ГруппаБлюда);
		
		Диаграмма.УстановитьЗначение(Точка, Серия1, Выборка[Показатель + "1"]);
		Диаграмма.УстановитьЗначение(Точка, Серия2, Выборка[Показатель + "2"]);
		
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

Процедура ОбновитьВыполнениеПлана(РезультатЗапроса, ТабличныйДокумент)
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	// Области макета показатели выполнения плана
	МакетВыполнениеПлана = ПолучитьМакет("МакетПоказателиВыполнениеПлана");
	ОбластьШапка = МакетВыполнениеПлана.ПолучитьОбласть("Шапка");
	ОбластьСтрока = МакетВыполнениеПлана.ПолучитьОбласть("Строка");
	
	ТабличныйДокумент.Очистить();
	
	// Шапка
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	// Строка
	ОбластьСтрока.Параметры.КоличествоГостей 		= Строка(Формат(?(Выборка.КоличествоГостейПлан = null, 0, ?(Выборка.КоличествоГостейПрогноз = null, 0, Выборка.КоличествоГостейПрогноз) / Выборка.КоличествоГостейПлан * 100), "ЧЦ=10; ЧДЦ=1")) + "%";
	ОбластьСтрока.Параметры.Цена 					= Строка(Формат(?(Выборка.ЦенаПлан = null, 0, ?(Выборка.ЦенаПрогноз = null, 0, Выборка.ЦенаПрогноз) / Выборка.ЦенаПлан * 100), "ЧЦ=10; ЧДЦ=1")) + "%";
	ОбластьСтрока.Параметры.СреднийЧек 				= Строка(Формат(?(Выборка.СреднийЧекПлан = null, 0, ?(Выборка.СреднийЧекПрогноз = null, 0, Выборка.СреднийЧекПрогноз)  / Выборка.СреднийЧекПлан * 100), "ЧЦ=10; ЧДЦ=1")) + "%";
	ОбластьСтрока.Параметры.КЦП 					= Строка(Формат(?(Выборка.КЦППлан = null, 0, ?(Выборка.КЦППрогноз = null, 0, Выборка.КЦППрогноз) / Выборка.КЦППлан * 100), "ЧЦ=10; ЧДЦ=1")) + "%";
	ОбластьСтрока.Параметры.СебестоимостьПроцент 	= Строка(Формат(?(Выборка.СебестоимостьПроцентПлан = null, 0, ?(Выборка.СебестоимостьПроцентПрогноз = null, 0, Выборка.СебестоимостьПроцентПрогноз) / Выборка.СебестоимостьПроцентПлан * 100), "ЧЦ=10; ЧДЦ=1")) + "%";
	ТабличныйДокумент.Вывести(ОбластьСтрока);
	
	Фиксация(ТабличныйДокумент, 2, 5);

КонецПроцедуры

Процедура ОбновитьВыполнениеПланаДиаграмма(РезультатЗапроса, ДиаграммаВыполнениеПланаСумма, ДиаграммаВыполнениеПланаВаловыйДоход)
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ОбновитьДиаграмму(Выборка, ДиаграммаВыполнениеПланаСумма, "Сумма");
	ОбновитьДиаграмму(Выборка, ДиаграммаВыполнениеПланаВаловыйДоход, "ВаловыйДоход");

КонецПроцедуры

Процедура ОбновитьДиаграмму(Выборка, Диаграмма, Показатель = "Сумма")
	
	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы = ТипДиаграммы.Измерительная;
	Диаграмма.ВидПодписей = ВидПодписейКДиаграмме.Значение;
	Диаграмма.АвтоУстановкаТекстаТочек = Ложь;
	Диаграмма.ФорматЗначенийВПодписях = "ЧЦ=10; ЧДЦ=1";
	Диаграмма.БазовоеЗначение = 0;
	Диаграмма.АвтоМаксимальноеЗначение = Ложь;
	Диаграмма.МаксимальноеЗначение = 120;
	Диаграмма.ПодписиШкалыЗначенийИзмерительнойДиаграммыВдольШкалы = Истина; 
	Диаграмма.ТолщинаВтулкиИзмерительнойДиаграммы = 5;
	Диаграмма.ТолщинаШкалыИзмерительнойДиаграммы  = 5;
	Диаграмма.ЦветВтулкиИзмерительнойДиаграммы = Новый Цвет(152, 255, 152); 
	
	Точка = Диаграмма.УстановитьТочку("");

	Серия = Диаграмма.Серии.Добавить("");
	Серия.ПриоритетЦвета = Истина;
	Серия.Цвет = Новый Цвет(152, 255, 152);
	
	Диаграмма.УстановитьЗначение(Точка, Серия, (?(Выборка[Показатель + "План"] = null, 0, ?(Выборка[Показатель + "Прогноз"] = null, 0, Выборка[Показатель + "Прогноз"]) / Выборка[Показатель + "План"])) * 100);
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

Процедура ОбновитьИзменениеПоказателейДиаграмма(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, Диаграмма);
	
	РезультатЗапросаИзменениеПоказателей = СформироватьЗапросИзменениеПоказателей(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета);
	
	Если РезультатЗапросаИзменениеПоказателей.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапросаИзменениеПоказателей.Выбрать();
	
	// Диаграмма
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы = ТипДиаграммы.ГистограммаОбъемная;
	Диаграмма.ВидПодписей = ВидПодписейКДиаграмме.Значение;
	Диаграмма.ФорматЗначенийВПодписях = "ЧЦ=10; ЧДЦ=1";
	Диаграмма.БазовоеЗначение = 0;
	Диаграмма.АвтоУстановкаТекстаТочек = Ложь;
	Диаграмма.ШрифтПодписей = Новый Шрифт("Verdana", 6);
	
	Выборка.Следующий();
	
	Точка = Диаграмма.УстановитьТочку("");
	
	// КЦП
	Серия1 = Диаграмма.Серии.Добавить("КЦП");
	Серия1.ПриоритетЦвета = Истина;
	Серия1.Цвет = Новый Цвет(152, 255, 152); 
	Диаграмма.УстановитьЗначение(Точка, Серия1, Выборка.КЦППроцентноеОтклонение);
	
	// СреднийЧек
	Серия2 = Диаграмма.Серии.Добавить("Ср. чек");
	Серия2.ПриоритетЦвета = Истина;
	Серия2.Цвет = Новый Цвет(255, 255, 0);
	Диаграмма.УстановитьЗначение(Точка, Серия2, Выборка.СреднийЧекПроцентноеОтклонение);
	
	// Цена
	Серия3 = Диаграмма.Серии.Добавить("Ср. цена");
	Серия3.ПриоритетЦвета = Истина;
	Серия3.Цвет = Новый Цвет(175, 238, 238); 
	Диаграмма.УстановитьЗначение(Точка, Серия3, Выборка.ЦенаПроцентноеОтклонение);
	
	Диаграмма.Обновление = Истина;

КонецПроцедуры

Процедура ОбновитьТекущаяДата(НачалоПериода, КонецПериода, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, ТабличныйДокумент)
	
	РезультатЗапроса = СформироватьЗапросТекущаяДата(НачалоПериода, КонецПериода, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ТабличныйДокумент.Очистить();
	
	// Области макета
	Макет 				= ПолучитьМакет("МакетПоказателиТекущаяДата");
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока 		= Макет.ПолучитьОбласть("Строка");
	
	// Заголовок
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = Строка("Сегодня " + Строка(Формат(НачалоПериода, "ДФ='dd.MM.yyyy ddd'")));
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	// Шапка
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	// Строка
	ОбластьСтрока.Параметры.КоличествоГостей 		= Выборка.КоличествоГостей;
	ОбластьСтрока.Параметры.Сумма 					= Формат(Выборка.Сумма, "ЧЦ=10");
	ОбластьСтрока.Параметры.СреднийЧек 				= Выборка.СреднийЧек;
	ОбластьСтрока.Параметры.КЦП 					= Выборка.КЦП;
	ОбластьСтрока.Параметры.Цена 					= Выборка.Цена;
	ОбластьСтрока.Параметры.СредняяТранзакция 		= Выборка.СредняяТранзакция;
	ОбластьСтрока.Параметры.СебестоимостьПроцент 	= Строка(Формат(Выборка.СебестоимостьПроцент, "ЧЦ=10; ЧДЦ=1")) + "%";
	ОбластьСтрока.Параметры.ВаловыйДоходПроцент 	= Строка(Формат(Выборка.ВаловыйДоходПроцент, "ЧЦ=10; ЧДЦ=1")) + "%";
	
	ТабличныйДокумент.Вывести(ОбластьСтрока);
	
	Фиксация(ТабличныйДокумент, 3, 8);
	
КонецПроцедуры

Процедура ОбновитьПланФакт(НачалоПериода, КонецПериода, Ресторан, Оплата, РезультатЗапроса, ТабличныйДокумент)
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	// Области макета показатели
	Макет 							= ПолучитьМакет("МакетПоказатели");
	ОбластьЗаголовок 				= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка 					= Макет.ПолучитьОбласть("Шапка");
	ОбластьКоличествоГостей 		= Макет.ПолучитьОбласть("СтрокаКоличествоГостей");
	ОбластьСумма 					= Макет.ПолучитьОбласть("СтрокаСумма");
	ОбластьВаловыйДоход 			= Макет.ПолучитьОбласть("СтрокаВаловыйДоход");
	ОбластьСреднийЧек 				= Макет.ПолучитьОбласть("СтрокаСреднийЧек");
	ОбластьКЦП 						= Макет.ПолучитьОбласть("СтрокаКЦП");
	ОбластьЦена 					= Макет.ПолучитьОбласть("СтрокаЦена");
	ОбластьКоличествоГостейСреднее 	= Макет.ПолучитьОбласть("СтрокаКоличествоГостейСреднее");
	ОбластьСредняяТранзакция 		= Макет.ПолучитьОбласть("СтрокаСредняяТранзакция");
	ОбластьСебестоимостьПроцент 	= Макет.ПолучитьОбласть("СтрокаСебестоимостьПроцент");
	ОбластьВаловыйДоходПроцент 		= Макет.ПолучитьОбласть("СтрокаВаловыйДоходПроцент");
	ОбластьЧайКофеПроцент 			= Макет.ПолучитьОбласть("СтрокаЧайКофеПроцент");
	
	ТабличныйДокумент.Очистить();
	
	// Заголовок
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = "План-фактный анализ";
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	// Шапка
	ОбластьШапка.Параметры.Колонка1 = "План";
	ОбластьШапка.Параметры.Колонка2 = "Прогноз";
	ОбластьШапка.Параметры.Колонка3 = "Отклонение";
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	// Строки
	// КоличествоГостей
	ОбластьКоличествоГостей.Параметры.Значение1 = Выборка.КоличествоГостейПлан;
	ОбластьКоличествоГостей.Параметры.Значение2 = Выборка.КоличествоГостейПрогноз;
	ОбластьКоличествоГостей.Параметры.Значение3 = Выборка.КоличествоГостейАбсолютноеОтклонение;
	ОбластьКоличествоГостей.Параметры.Значение4 = Выборка.КоличествоГостейПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьКоличествоГостей);
	
	// Сумма
	ОбластьСумма.Параметры.Значение1 = Выборка.СуммаПлан;
	ОбластьСумма.Параметры.Значение2 = Выборка.СуммаПрогноз;
	ОбластьСумма.Параметры.Значение3 = Выборка.СуммаАбсолютноеОтклонение;
	ОбластьСумма.Параметры.Значение4 = Выборка.СуммаПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьСумма);
	
	// ВаловыйДоход
	ОбластьВаловыйДоход.Параметры.Значение1 = Выборка.ВаловыйДоходПлан;
	ОбластьВаловыйДоход.Параметры.Значение2 = Выборка.ВаловыйДоходПрогноз;
	ОбластьВаловыйДоход.Параметры.Значение3 = Выборка.ВаловыйДоходАбсолютноеОтклонение;
	ОбластьВаловыйДоход.Параметры.Значение4 = Выборка.ВаловыйДоходПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьВаловыйДоход);
	
	// СреднийЧек
	ОбластьСреднийЧек.Параметры.Значение1 = Выборка.СреднийЧекПлан;
	ОбластьСреднийЧек.Параметры.Значение2 = Выборка.СреднийЧекПрогноз;
	ОбластьСреднийЧек.Параметры.Значение3 = Выборка.СреднийЧекАбсолютноеОтклонение;
	ОбластьСреднийЧек.Параметры.Значение4 = Выборка.СреднийЧекПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьСреднийЧек);
	
	// КЦП
	ОбластьКЦП.Параметры.Значение1 = Выборка.КЦППлан;
	ОбластьКЦП.Параметры.Значение2 = Выборка.КЦППрогноз;
	ОбластьКЦП.Параметры.Значение3 = Выборка.КЦПАбсолютноеОтклонение;
	ОбластьКЦП.Параметры.Значение4 = Выборка.КЦППроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьКЦП);
	
	// Цена
	ОбластьЦена.Параметры.Значение1 = Выборка.ЦенаПлан;
	ОбластьЦена.Параметры.Значение2 = Выборка.ЦенаПрогноз;
	ОбластьЦена.Параметры.Значение3 = Выборка.ЦенаАбсолютноеОтклонение;
	ОбластьЦена.Параметры.Значение4 = Выборка.ЦенаПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьЦена);
	
	// КоличествоГостейСреднее
	ОбластьКоличествоГостейСреднее.Параметры.Значение1 = Выборка.КоличествоГостейСреднееПлан;
	ОбластьКоличествоГостейСреднее.Параметры.Значение2 = Выборка.КоличествоГостейСреднееПрогноз;
	ОбластьКоличествоГостейСреднее.Параметры.Значение3 = Выборка.КоличествоГостейСреднееАбсолютноеОтклонение;
	ОбластьКоличествоГостейСреднее.Параметры.Значение4 = Выборка.КоличествоГостейСреднееПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьКоличествоГостейСреднее);
	
	// СредняяТранзакция
	ОбластьСредняяТранзакция.Параметры.Значение1 = Выборка.СредняяТранзакцияПлан;
	ОбластьСредняяТранзакция.Параметры.Значение2 = Выборка.СредняяТранзакцияПрогноз;
	ОбластьСредняяТранзакция.Параметры.Значение3 = "";
	ОбластьСредняяТранзакция.Параметры.Значение4 = "";
	ТабличныйДокумент.Вывести(ОбластьСредняяТранзакция);
	
	// СебестоимостьПроцент
	ОбластьСебестоимостьПроцент.Параметры.Значение1 = Строка(Формат(Выборка.СебестоимостьПроцентПлан, "ЧЦ=10; ЧДЦ=1")) + "%"; 
	ОбластьСебестоимостьПроцент.Параметры.Значение2 = Строка(Формат(Выборка.СебестоимостьПроцентПрогноз, "ЧЦ=10; ЧДЦ=1")) + "%";
	ОбластьСебестоимостьПроцент.Параметры.Значение3 = Выборка.СебестоимостьПроцентАбсолютноеОтклонение;
	ОбластьСебестоимостьПроцент.Параметры.Значение4 = Выборка.СебестоимостьПроцентПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьСебестоимостьПроцент);
	
	// ВаловыйДоходПроцент
	ОбластьВаловыйДоходПроцент.Параметры.Значение1 = Строка(Формат(Выборка.ВаловыйДоходПроцентПлан, "ЧЦ=10; ЧДЦ=1")) + "%";
	ОбластьВаловыйДоходПроцент.Параметры.Значение2 = Строка(Формат(Выборка.ВаловыйДоходПроцентПрогноз, "ЧЦ=10; ЧДЦ=1")) + "%";
	ОбластьВаловыйДоходПроцент.Параметры.Значение3 = Выборка.ВаловыйДоходПроцентАбсолютноеОтклонение;
	ОбластьВаловыйДоходПроцент.Параметры.Значение4 = Выборка.ВаловыйДоходПроцентПроцентноеОтклонение;
	ТабличныйДокумент.Вывести(ОбластьВаловыйДоходПроцент);
	
	// Данные по группе чай/кофе
	РезультатЗапросаПланФактПоГруппе = СформироватьЗапросПланФактПоГруппе(НачалоПериода, КонецПериода, Ресторан, Оплата);
	
	Если РезультатЗапросаПланФактПоГруппе.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаПоГруппе = РезультатЗапросаПланФактПоГруппе.Выбрать();
	ВыборкаПоГруппе.Следующий();
	
	// ОбластьЧайКофеПроцент
	ОбластьЧайКофеПроцент.Параметры.Значение1 = "";
	ОбластьЧайКофеПроцент.Параметры.Значение2 = Строка(Формат(ВыборкаПоГруппе.КоличествоТранзакцийПроцент, "ЧЦ=10; ЧДЦ=1")) + "%";
	ОбластьЧайКофеПроцент.Параметры.Значение3 = "";
	ОбластьЧайКофеПроцент.Параметры.Значение4 = "";
	ТабличныйДокумент.Вывести(ОбластьЧайКофеПроцент);
	
	Фиксация(ТабличныйДокумент, 14, 5);
	
КонецПроцедуры

Процедура ОбновитьПланФактДиаграмма(НачалоПериода, КонецПериода, Ресторан, Оплата, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, Показатель, Диаграмма);
	
	РезультатЗапроса = СформироватьЗапросПланФактПоГруппам(НачалоПериода, КонецПериода, Ресторан, Оплата, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	// Диаграмма
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы = ТипДиаграммы.ГистограммаОбъемная;
	Диаграмма.ВидПодписей = ВидПодписейКДиаграмме.Значение;
	Диаграмма.АвтоУстановкаТекстаТочек = Ложь;
	Диаграмма.ФорматЗначенийВПодписях = "ЧЦ=10; ЧДЦ=1";
	Диаграмма.БазовоеЗначение = 0;
	Диаграмма.ШрифтПодписей = Новый Шрифт("Verdana", 6);
	
	Если Показатель = "КЦП" Тогда
		ИмяСерии = "КЦП";
	ИначеЕсли Показатель = "Цена" Тогда
		ИмяСерии = "Ср. цена";
	ИначеЕсли Показатель = "СебестоимостьПроцент" Тогда
		ИмяСерии = "FC, %";
	ИначеЕсли Показатель = "ВаловыйДоходПроцент" Тогда
		ИмяСерии = "ВП, %";
	КонецЕсли;
	
	Серия1 = Диаграмма.Серии.Добавить(ИмяСерии + " План");
	Серия1.ПриоритетЦвета = Истина;
	Серия1.Цвет = Новый Цвет(255, 255, 0); 
	
	Серия2 = Диаграмма.Серии.Добавить(ИмяСерии + " Факт");
	Серия2.ПриоритетЦвета = Истина;
	Серия2.Цвет = Новый Цвет(152, 255, 152); 
	
	Пока Выборка.Следующий() Цикл
		
		Точка = Диаграмма.УстановитьТочку(Выборка.ГруппаБлюда);
		
		Диаграмма.УстановитьЗначение(Точка, Серия1, Выборка[Показатель + "План"]);
		Диаграмма.УстановитьЗначение(Точка, Серия2, Выборка[Показатель + "Факт"]);
		
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;

КонецПроцедуры

Процедура ОбновитьСравнениеПериодовПоСотрудникамДиаграмма(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета, Показатель, ДиаграммаСреднийЧек, ДиаграммаПоказатели)
	
	РезультатЗапроса = СформироватьЗапросПериодыСотрудники(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДиаграммуПоСотрудникам(РезультатЗапроса.Выбрать(), ДиаграммаСреднийЧек);
	ОбновитьДиаграммуПоСотрудникам(РезультатЗапроса.Выбрать(), ДиаграммаПоказатели, Показатель);
	
КонецПроцедуры

Процедура ОбновитьДиаграммуПоСотрудникам(Выборка, Диаграмма, Показатель = "СреднийЧек")
	
	// Диаграмма
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ТипДиаграммы = ТипДиаграммы.ГистограммаОбъемная;
	Диаграмма.ВидПодписей = ВидПодписейКДиаграмме.Значение;
	Диаграмма.АвтоУстановкаТекстаТочек = Ложь;
	Диаграмма.ФорматЗначенийВПодписях = "ЧЦ=10; ЧДЦ=1";
	Диаграмма.БазовоеЗначение = 0;
	Диаграмма.ШрифтПодписей = Новый Шрифт("Verdana", 6);
	
	ЦветСерии = Новый Цвет(175, 238, 238);
	
	Если Показатель = "СреднийЧек" Тогда
		ИмяСерии = "Ср. чек";
		ЦветСерии = Новый Цвет(152, 255, 152);
	ИначеЕсли Показатель = "КЦП" Тогда
		ИмяСерии = "КЦП";
	ИначеЕсли Показатель = "Цена" Тогда
		ИмяСерии = "Ср. цена";
	ИначеЕсли Показатель = "СебестоимостьПроцент" Тогда
		ИмяСерии = "FC, %";
	ИначеЕсли Показатель = "ВаловыйДоходПроцент" Тогда
		ИмяСерии = "ВП, %";
	ИначеЕсли Показатель = "СредняяТранзакция" Тогда
		ИмяСерии = "Ср. транз";
		ЦветСерии = Новый Цвет(175, 238, 238);
	ИначеЕсли Показатель = "КЦПТранзакция" Тогда
		ИмяСерии = "КЦП на транз";
	КонецЕсли;
	
	Серия1 = Диаграмма.Серии.Добавить(ИмяСерии + " Пред");
	Серия1.ПриоритетЦвета = Истина;
	Серия1.Цвет = Новый Цвет(255, 255, 0); 
	
	Серия2 = Диаграмма.Серии.Добавить(ИмяСерии + " Тек");
	Серия2.ПриоритетЦвета = Истина;
	Серия2.Цвет = ЦветСерии; 
	
	Пока Выборка.Следующий() Цикл
		
		Точка = Диаграмма.УстановитьТочку(Выборка.Сотрудник);
		
		Диаграмма.УстановитьЗначение(Точка, Серия1, Выборка[Показатель + "1"]);
		Диаграмма.УстановитьЗначение(Точка, Серия2, Выборка[Показатель + "2"]);
		
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;

КонецПроцедуры	

Функция СформироватьЗапросПериоды(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РеализацияТоваровУслуг.Ссылка) КАК КоличествоДокументов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций,
	               |	СУММА(РеализацияТоваровУслуг.КоличествоКлиентов) КАК КоличествоГостей
	               |ПОМЕСТИТЬ ТранзакцииПосещения1
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода1,
	               |			&КонецПериода1,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |			И ПродажиОбороты.Оплата = РеализацияТоваровУслуг.Оплата
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоБлюд,
	               |	СУММА(ВЫБОР
	               |			КОГДА &УчитыватьКоэффициентПересчета
	               |				ТОГДА ПродажиОбороты.КоличествоУточненноеОборот * ПродажиОбороты.Номенклатура.КоэффициентЕдиницыИзмеренияДляОтчетов
	               |			ИНАЧЕ ПродажиОбороты.КоличествоУточненноеОборот
	               |		КОНЕЦ) КАК КоличествоБлюдУточн,
	               |	СУММА(ПродажиОбороты.АкцизныйНалогОборот) КАК АкцизныйНалог,
	               |	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиОбороты.СуммаНаценкиОборот) КАК Наценка,
	               |	СУММА(ПродажиОбороты.СуммаСкидкиОборот) КАК Скидка,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	СУММА(ПродажиОбороты.КоличествоОборот * СебестоимостьНоменклатуры.Себестоимость) КАК Себестоимость
	               |ПОМЕСТИТЬ ПродажиСебестоимость1
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода1,
	               |			&КонецПериода1,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры КАК СебестоимостьНоменклатуры
	               |		ПО ПродажиОбороты.Ресторан = СебестоимостьНоменклатуры.Ресторан
	               |			И ПродажиОбороты.Номенклатура = СебестоимостьНоменклатуры.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(ПродажиОбороты.ПериодМесяц, МЕСЯЦ) = СебестоимостьНоменклатуры.Период)
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТранзакцииПосещения1.КоличествоДокументов КАК КоличествоДокументов,
	               |	ТранзакцииПосещения1.КоличествоТранзакций КАК КоличествоТранзакций,
	               |	ТранзакцииПосещения1.КоличествоГостей КАК КоличествоГостей,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ТранзакцииПосещения1.КоличествоГостей / ТранзакцииПосещения1.КоличествоТранзакций
	               |	КОНЕЦ КАК КоличествоГостейСреднее,
	               |	ПродажиСебестоимость1.КоличествоБлюд КАК КоличествоБлюд,
	               |	ПродажиСебестоимость1.КоличествоБлюдУточн,
	               |	ПродажиСебестоимость1.АкцизныйНалог КАК АкцизныйНалог,
	               |	ПродажиСебестоимость1.СуммаБезСкидок КАК СуммаБезСкидок,
	               |	ПродажиСебестоимость1.Наценка КАК Наценка,
	               |	ПродажиСебестоимость1.Скидка КАК Скидка,
	               |	ПродажиСебестоимость1.Сумма КАК Сумма,
	               |	ПродажиСебестоимость1.Себестоимость КАК Себестоимость,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.КоличествоБлюд / ТранзакцииПосещения1.КоличествоГостей
	               |	КОНЕЦ КАК КЦП,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.КоличествоБлюдУточн / ТранзакцииПосещения1.КоличествоГостей
	               |	КОНЕЦ КАК КЦПУточн,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ПродажиСебестоимость1.КоличествоБлюд
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.КоличествоБлюдУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ПродажиСебестоимость1.КоличествоБлюдУточн
	               |	КОНЕЦ КАК ЦенаУточн,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ТранзакцииПосещения1.КоличествоГостей
	               |	КОНЕЦ КАК СреднийЧек,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ТранзакцииПосещения1.КоличествоТранзакций
	               |	КОНЕЦ КАК СредняяТранзакция,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Скидка / ПродажиСебестоимость1.СуммаБезСкидок * 100
	               |	КОНЕЦ КАК СкидкаПроцент,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Себестоимость / ПродажиСебестоимость1.Сумма * 100
	               |	КОНЕЦ КАК СебестоимостьПроцент,
	               |	ПродажиСебестоимость1.Сумма - ПродажиСебестоимость1.Себестоимость КАК ВаловыйДоход,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (ПродажиСебестоимость1.Сумма - ПродажиСебестоимость1.Себестоимость) / ПродажиСебестоимость1.Сумма * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцент
	               |ПОМЕСТИТЬ Период1
	               |ИЗ
	               |	ПродажиСебестоимость1 КАК ПродажиСебестоимость1,
	               |	ТранзакцииПосещения1 КАК ТранзакцииПосещения1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РеализацияТоваровУслуг.Ссылка) КАК КоличествоДокументов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций,
	               |	СУММА(РеализацияТоваровУслуг.КоличествоКлиентов) КАК КоличествоГостей
	               |ПОМЕСТИТЬ ТранзакцииПосещения2
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода2,
	               |			&КонецПериода2,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |			И ПродажиОбороты.Оплата = РеализацияТоваровУслуг.Оплата
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоБлюд,
	               |	СУММА(ВЫБОР
	               |			КОГДА &УчитыватьКоэффициентПересчета
	               |				ТОГДА ПродажиОбороты.КоличествоУточненноеОборот * ПродажиОбороты.Номенклатура.КоэффициентЕдиницыИзмеренияДляОтчетов
	               |			ИНАЧЕ ПродажиОбороты.КоличествоУточненноеОборот
	               |		КОНЕЦ) КАК КоличествоБлюдУточн,
	               |	СУММА(ПродажиОбороты.АкцизныйНалогОборот) КАК АкцизныйНалог,
	               |	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиОбороты.СуммаНаценкиОборот) КАК Наценка,
	               |	СУММА(ПродажиОбороты.СуммаСкидкиОборот) КАК Скидка,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	СУММА(ПродажиОбороты.КоличествоОборот * СебестоимостьНоменклатуры.Себестоимость) КАК Себестоимость
	               |ПОМЕСТИТЬ ПродажиСебестоимость2
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода2,
	               |			&КонецПериода2,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры КАК СебестоимостьНоменклатуры
	               |		ПО ПродажиОбороты.Ресторан = СебестоимостьНоменклатуры.Ресторан
	               |			И ПродажиОбороты.Номенклатура = СебестоимостьНоменклатуры.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(ПродажиОбороты.ПериодМесяц, МЕСЯЦ) = СебестоимостьНоменклатуры.Период)
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТранзакцииПосещения2.КоличествоДокументов КАК КоличествоДокументов,
	               |	ТранзакцииПосещения2.КоличествоТранзакций КАК КоличествоТранзакций,
	               |	ТранзакцииПосещения2.КоличествоГостей КАК КоличествоГостей,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ТранзакцииПосещения2.КоличествоГостей / ТранзакцииПосещения2.КоличествоТранзакций
	               |	КОНЕЦ КАК КоличествоГостейСреднее,
	               |	ПродажиСебестоимость2.КоличествоБлюд КАК КоличествоБлюд,
	               |	ПродажиСебестоимость2.КоличествоБлюдУточн,
	               |	ПродажиСебестоимость2.АкцизныйНалог КАК АкцизныйНалог,
	               |	ПродажиСебестоимость2.СуммаБезСкидок КАК СуммаБезСкидок,
	               |	ПродажиСебестоимость2.Наценка КАК Наценка,
	               |	ПродажиСебестоимость2.Скидка КАК Скидка,
	               |	ПродажиСебестоимость2.Сумма КАК Сумма,
	               |	ПродажиСебестоимость2.Себестоимость КАК Себестоимость,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.КоличествоБлюд / ТранзакцииПосещения2.КоличествоГостей
	               |	КОНЕЦ КАК КЦП,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.КоличествоБлюдУточн / ТранзакцииПосещения2.КоличествоГостей
	               |	КОНЕЦ КАК КЦПУточн,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ПродажиСебестоимость2.КоличествоБлюд
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.КоличествоБлюдУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ПродажиСебестоимость2.КоличествоБлюдУточн
	               |	КОНЕЦ КАК ЦенаУточн,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ТранзакцииПосещения2.КоличествоГостей
	               |	КОНЕЦ КАК СреднийЧек,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ТранзакцииПосещения2.КоличествоТранзакций
	               |	КОНЕЦ КАК СредняяТранзакция,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Скидка / ПродажиСебестоимость2.СуммаБезСкидок * 100
	               |	КОНЕЦ КАК СкидкаПроцент,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Себестоимость / ПродажиСебестоимость2.Сумма * 100
	               |	КОНЕЦ КАК СебестоимостьПроцент,
	               |	ПродажиСебестоимость2.Сумма - ПродажиСебестоимость2.Себестоимость КАК ВаловыйДоход,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (ПродажиСебестоимость2.Сумма - ПродажиСебестоимость2.Себестоимость) / ПродажиСебестоимость2.Сумма * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцент
	               |ПОМЕСТИТЬ Период2
	               |ИЗ
	               |	ПродажиСебестоимость2 КАК ПродажиСебестоимость2,
	               |	ТранзакцииПосещения2 КАК ТранзакцииПосещения2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Период1.КоличествоДокументов КАК КоличествоДокументов1,
	               |	Период1.КоличествоТранзакций КАК КоличествоТранзакций1,
	               |	Период1.КоличествоГостей КАК КоличествоГостей1,
	               |	Период1.КоличествоГостейСреднее КАК КоличествоГостейСреднее1,
	               |	Период1.КоличествоБлюд КАК КоличествоБлюд1,
	               |	Период1.КоличествоБлюдУточн КАК КоличествоБлюдУточн1,
	               |	Период1.АкцизныйНалог КАК АкцизныйНалог1,
	               |	Период1.СуммаБезСкидок КАК СуммаБезСкидок1,
	               |	Период1.Наценка КАК Наценка1,
	               |	Период1.Скидка КАК Скидка1,
	               |	Период1.Сумма КАК Сумма1,
	               |	Период1.Себестоимость КАК Себестоимость1,
	               |	Период1.КЦП КАК КЦП1,
	               |	Период1.КЦПУточн КАК КЦПУточн1,
	               |	Период1.Цена КАК Цена1,
	               |	Период1.ЦенаУточн КАК ЦенаУточн1,
	               |	Период1.СреднийЧек КАК СреднийЧек1,
	               |	Период1.СредняяТранзакция КАК СредняяТранзакция1,
	               |	Период1.СкидкаПроцент КАК СкидкаПроцент1,
	               |	Период1.СебестоимостьПроцент КАК СебестоимостьПроцент1,
	               |	Период1.ВаловыйДоход КАК ВаловыйДоход1,
	               |	Период1.ВаловыйДоходПроцент КАК ВаловыйДоходПроцент1,
	               |	Период2.КоличествоДокументов КАК КоличествоДокументов2,
	               |	Период2.КоличествоТранзакций КАК КоличествоТранзакций2,
	               |	Период2.КоличествоГостей КАК КоличествоГостей2,
	               |	Период2.КоличествоГостейСреднее КАК КоличествоГостейСреднее2,
	               |	Период2.КоличествоБлюд КАК КоличествоБлюд2,
	               |	Период2.КоличествоБлюдУточн КАК КоличествоБлюдУточн2,
	               |	Период2.АкцизныйНалог КАК АкцизныйНалог2,
	               |	Период2.СуммаБезСкидок КАК СуммаБезСкидок2,
	               |	Период2.Наценка КАК Наценка2,
	               |	Период2.Скидка КАК Скидка2,
	               |	Период2.Сумма КАК Сумма2,
	               |	Период2.Себестоимость КАК Себестоимость2,
	               |	Период2.КЦП КАК КЦП2,
	               |	Период2.КЦПУточн КАК КЦПУточн2,
	               |	Период2.Цена КАК Цена2,
	               |	Период2.ЦенаУточн КАК ЦенаУточн2,
	               |	Период2.СреднийЧек КАК СреднийЧек2,
	               |	Период2.СредняяТранзакция КАК СредняяТранзакция2,
	               |	Период2.СкидкаПроцент КАК СкидкаПроцент2,
	               |	Период2.СебестоимостьПроцент КАК СебестоимостьПроцент2,
	               |	Период2.ВаловыйДоход КАК ВаловыйДоход2,
	               |	Период2.ВаловыйДоходПроцент КАК ВаловыйДоходПроцент2,
	               |	Период2.КоличествоДокументов - Период1.КоличествоДокументов КАК КоличествоДокументовАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоДокументов = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоДокументов / Период1.КоличествоДокументов - 1) * 100
	               |	КОНЕЦ КАК КоличествоДокументовПроцентноеОтклонение,
	               |	Период2.КоличествоТранзакций - Период1.КоличествоТранзакций КАК КоличествоТранзакцийАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоТранзакций / Период1.КоличествоТранзакций - 1) * 100
	               |	КОНЕЦ КАК КоличествоТранзакцийПроцентноеОтклонение,
	               |	Период2.КоличествоГостей - Период1.КоличествоГостей КАК КоличествоГостейАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоГостей / Период1.КоличествоГостей - 1) * 100
	               |	КОНЕЦ КАК КоличествоГостейПроцентноеОтклонение,
	               |	Период2.КоличествоГостейСреднее - Период1.КоличествоГостейСреднее КАК КоличествоГостейСреднееАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоГостейСреднее = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоГостейСреднее / Период1.КоличествоГостейСреднее - 1) * 100
	               |	КОНЕЦ КАК КоличествоГостейСреднееПроцентноеОтклонение,
	               |	Период2.КоличествоБлюд - Период1.КоличествоБлюд КАК КоличествоБлюдАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоБлюд / Период1.КоличествоБлюд - 1) * 100
	               |	КОНЕЦ КАК КоличествоБлюдПроцентноеОтклонение,
	               |	Период2.КоличествоБлюдУточн - Период1.КоличествоБлюдУточн КАК КоличествоБлюдУточнАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоБлюдУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоБлюдУточн / Период1.КоличествоБлюдУточн - 1) * 100
	               |	КОНЕЦ КАК КоличествоБлюдУточнПроцентноеОтклонение,
	               |	Период2.СуммаБезСкидок - Период1.СуммаБезСкидок КАК СуммаБезСкидокАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СуммаБезСкидок / Период1.СуммаБезСкидок - 1) * 100
	               |	КОНЕЦ КАК СуммаБезСкидокПроцентноеОтклонение,
	               |	Период2.Скидка - Период1.Скидка КАК СкидкаАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Скидка = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Скидка / Период1.Скидка - 1) * 100
	               |	КОНЕЦ КАК СкидкаПроцентноеОтклонение,
	               |	Период2.Сумма - Период1.Сумма КАК СуммаАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Сумма / Период1.Сумма - 1) * 100
	               |	КОНЕЦ КАК СуммаПроцентноеОтклонение,
	               |	Период2.Себестоимость - Период1.Себестоимость КАК СебестоимостьАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Себестоимость = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Себестоимость / Период1.Себестоимость - 1) * 100
	               |	КОНЕЦ КАК СебестоимостьПроцентноеОтклонение,
	               |	Период2.КЦП - Период1.КЦП КАК КЦПАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КЦП = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КЦП / Период1.КЦП - 1) * 100
	               |	КОНЕЦ КАК КЦППроцентноеОтклонение,
	               |	Период2.КЦПУточн - Период1.КЦПУточн КАК КЦПУточнАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КЦПУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КЦПУточн / Период1.КЦПУточн - 1) * 100
	               |	КОНЕЦ КАК КЦПУточнПроцентноеОтклонение,
	               |	Период2.Цена - Период1.Цена КАК ЦенаАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Цена = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Цена / Период1.Цена - 1) * 100
	               |	КОНЕЦ КАК ЦенаПроцентноеОтклонение,
	               |	Период2.ЦенаУточн - Период1.ЦенаУточн КАК ЦенаУточнАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.ЦенаУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.ЦенаУточн / Период1.ЦенаУточн - 1) * 100
	               |	КОНЕЦ КАК ЦенаУточнПроцентноеОтклонение,
	               |	Период2.СреднийЧек - Период1.СреднийЧек КАК СреднийЧекАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СреднийЧек = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СреднийЧек / Период1.СреднийЧек - 1) * 100
	               |	КОНЕЦ КАК СреднийЧекПроцентноеОтклонение,
	               |	Период2.СредняяТранзакция - Период1.СредняяТранзакция КАК СредняяТранзакцияАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СредняяТранзакция = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СредняяТранзакция / Период1.СредняяТранзакция - 1) * 100
	               |	КОНЕЦ КАК СредняяТранзакцияПроцентноеОтклонение,
	               |	Период2.СкидкаПроцент - Период1.СкидкаПроцент КАК СкидкаПроцентАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СкидкаПроцент = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СкидкаПроцент / Период1.СкидкаПроцент - 1) * 100
	               |	КОНЕЦ КАК СкидкаПроцентПроцентноеОтклонение,
	               |	Период2.СебестоимостьПроцент - Период1.СебестоимостьПроцент КАК СебестоимостьПроцентАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СебестоимостьПроцент = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СебестоимостьПроцент / Период1.СебестоимостьПроцент - 1) * 100
	               |	КОНЕЦ КАК СебестоимостьПроцентПроцентноеОтклонение,
	               |	Период2.ВаловыйДоход - Период1.ВаловыйДоход КАК ВаловыйДоходАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.ВаловыйДоход = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.ВаловыйДоход / Период1.ВаловыйДоход - 1) * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцентноеОтклонение,
	               |	Период2.ВаловыйДоходПроцент - Период1.ВаловыйДоходПроцент КАК ВаловыйДоходПроцентАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.ВаловыйДоходПроцент = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.ВаловыйДоходПроцент / Период1.ВаловыйДоходПроцент - 1) * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцентПроцентноеОтклонение
	               |ИЗ
	               |	Период1 КАК Период1,
	               |	Период2 КАК Период2";
				   
	Запрос.УстановитьПараметр("НачалоПериода1", НачалоПериода1);
	Запрос.УстановитьПараметр("КонецПериода1", КонецПериода1);
	Запрос.УстановитьПараметр("НачалоПериода2", НачалоПериода2);
	Запрос.УстановитьПараметр("КонецПериода2", КонецПериода2);
	
	Если ЗначениеЗаполнено(Ресторан) Тогда
		Запрос.УстановитьПараметр("Ресторан", Ресторан);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Ресторан В(&Ресторан)", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(Оплата) Тогда
		Запрос.УстановитьПараметр("Оплата", Оплата);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Оплата В(&Оплата)", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура В (&Номенклатура)", "ИСТИНА");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидСравнения", ЦенаВидСравнения);
	Запрос.УстановитьПараметр("ЗначениеСравнения", ЦенаЗначениеСравнения);
	Запрос.УстановитьПараметр("УчитыватьКоэффициентПересчета", УчитыватьКоэффициентПересчета);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция СформироватьЗапросПериодыПоГруппе(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Ссылка.Ресторан,
	               |	РеализацияТоваровУслугТовары.Ссылка КАК Регистратор,
	               |	РеализацияТоваровУслугТовары.НоменклатурнаяГруппа
	               |ПОМЕСТИТЬ ПродажиПоГруппе1
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Продажи.Ресторан КАК Ресторан,
	               |		Продажи.Регистратор КАК Регистратор,
	               |		КОЛИЧЕСТВО(Продажи.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа
	               |	ИЗ
	               |		РегистрНакопления.Продажи КАК Продажи
	               |	ГДЕ
	               |		Продажи.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Модификатор)
	               |		И Продажи.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |		И Продажи.Период МЕЖДУ &НачалоПериода1 И &КонецПериода1
	               |		И Продажи.Ресторан В(&Ресторан)
	               |		И Продажи.Оплата В(&Оплата)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Продажи.Регистратор,
	               |		Продажи.Ресторан) КАК ЗапросТовары1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Продажи.Ресторан КАК Ресторан,
	               |			Продажи.Регистратор КАК Регистратор,
	               |			КОЛИЧЕСТВО(Продажи.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа
	               |		ИЗ
	               |			РегистрНакопления.Продажи КАК Продажи
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ГруппаЧайКофе КАК ГруппаЧайКофе
	               |				ПО Продажи.НоменклатурнаяГруппа = ГруппаЧайКофе.Значение
	               |		ГДЕ
	               |			Продажи.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Модификатор)
	               |			И Продажи.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |			И Продажи.Период МЕЖДУ &НачалоПериода1 И &КонецПериода1
	               |			И Продажи.Ресторан В(&Ресторан)
	               |			И Продажи.Оплата В(&Оплата)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			Продажи.Регистратор,
	               |			Продажи.Ресторан) КАК ЗапросТовары2
	               |		ПО ЗапросТовары1.Регистратор = ЗапросТовары2.Регистратор
	               |			И ЗапросТовары1.Ресторан = ЗапросТовары2.Ресторан
	               |			И ЗапросТовары1.НоменклатурнаяГруппа = ЗапросТовары2.НоменклатурнаяГруппа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ПО ЗапросТовары1.Регистратор = РеализацияТоваровУслугТовары.Ссылка
	               |			И ЗапросТовары1.Ресторан = РеализацияТоваровУслугТовары.Ссылка.Ресторан
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Модификатор)
	               |	И РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |	И РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &НачалоПериода1 И &КонецПериода1
	               |	И РеализацияТоваровУслугТовары.Ссылка.Ресторан В(&Ресторан)
	               |	И РеализацияТоваровУслугТовары.Ссылка.Оплата В(&Оплата)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиОбороты.Ресторан КАК Ресторан,
	               |	ПродажиОбороты.Регистратор,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций
	               |ПОМЕСТИТЬ Транзакции1
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода1,
	               |			&КонецПериода1,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Модификатор)
	               |				И Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |			И ПродажиОбороты.Оплата = РеализацияТоваровУслуг.Оплата
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Ресторан,
	               |	ПродажиОбороты.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(Транзакции1.КоличествоТранзакций) КАК КоличествоТранзакций
	               |ПОМЕСТИТЬ ТранзакцииГруппировка1
	               |ИЗ
	               |	Транзакции1 КАК Транзакции1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Транзакции1.Ресторан,
	               |	Транзакции1.Регистратор,
	               |	Транзакции1.КоличествоТранзакций
	               |ПОМЕСТИТЬ ТранзакцииПоГруппе1
	               |ИЗ
	               |	ПродажиПоГруппе1 КАК ПродажиПоГруппе1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Транзакции1 КАК Транзакции1
	               |		ПО ПродажиПоГруппе1.Ресторан = Транзакции1.Ресторан
	               |			И ПродажиПоГруппе1.Регистратор = Транзакции1.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ТранзакцииПоГруппе1.КоличествоТранзакций) КАК КоличествоТранзакций
	               |ПОМЕСТИТЬ ТранзакцииПоГруппеГруппировка1
	               |ИЗ
	               |	ТранзакцииПоГруппе1 КАК ТранзакцииПоГруппе1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТранзакцииПоГруппеГруппировка1.КоличествоТранзакций КАК КоличествоТранзакцийПоГруппе,
	               |	ТранзакцииГруппировка1.КоличествоТранзакций КАК КоличествоТранзакцийВсего,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииГруппировка1.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ТранзакцииПоГруппеГруппировка1.КоличествоТранзакций / ТранзакцииГруппировка1.КоличествоТранзакций * 100
	               |	КОНЕЦ КАК КоличествоТранзакцийПроцент
	               |ПОМЕСТИТЬ Период1
	               |ИЗ
	               |	ТранзакцииГруппировка1 КАК ТранзакцииГруппировка1,
	               |	ТранзакцииПоГруппеГруппировка1 КАК ТранзакцииПоГруппеГруппировка1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Ссылка.Ресторан,
	               |	РеализацияТоваровУслугТовары.Ссылка КАК Регистратор,
	               |	РеализацияТоваровУслугТовары.НоменклатурнаяГруппа
	               |ПОМЕСТИТЬ ПродажиПоГруппе2
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Продажи.Ресторан КАК Ресторан,
	               |		Продажи.Регистратор КАК Регистратор,
	               |		КОЛИЧЕСТВО(Продажи.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа
	               |	ИЗ
	               |		РегистрНакопления.Продажи КАК Продажи
	               |	ГДЕ
	               |		Продажи.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Модификатор)
	               |		И Продажи.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |		И Продажи.Период МЕЖДУ &НачалоПериода2 И &КонецПериода2
	               |		И Продажи.Ресторан В(&Ресторан)
	               |		И Продажи.Оплата В(&Оплата)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Продажи.Регистратор,
	               |		Продажи.Ресторан) КАК ЗапросТовары1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Продажи.Ресторан КАК Ресторан,
	               |			Продажи.Регистратор КАК Регистратор,
	               |			КОЛИЧЕСТВО(Продажи.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа
	               |		ИЗ
	               |			РегистрНакопления.Продажи КАК Продажи
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ГруппаЧайКофе КАК ГруппаЧайКофе
	               |				ПО Продажи.НоменклатурнаяГруппа = ГруппаЧайКофе.Значение
	               |		ГДЕ
	               |			Продажи.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Модификатор)
	               |			И Продажи.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |			И Продажи.Период МЕЖДУ &НачалоПериода2 И &КонецПериода2
	               |			И Продажи.Ресторан В(&Ресторан)
	               |			И Продажи.Оплата В(&Оплата)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			Продажи.Регистратор,
	               |			Продажи.Ресторан) КАК ЗапросТовары2
	               |		ПО ЗапросТовары1.Регистратор = ЗапросТовары2.Регистратор
	               |			И ЗапросТовары1.Ресторан = ЗапросТовары2.Ресторан
	               |			И ЗапросТовары1.НоменклатурнаяГруппа = ЗапросТовары2.НоменклатурнаяГруппа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ПО ЗапросТовары1.Регистратор = РеализацияТоваровУслугТовары.Ссылка
	               |			И ЗапросТовары1.Ресторан = РеализацияТоваровУслугТовары.Ссылка.Ресторан
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Модификатор)
	               |	И РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |	И РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &НачалоПериода2 И &КонецПериода2
	               |	И РеализацияТоваровУслугТовары.Ссылка.Ресторан В(&Ресторан)
	               |	И РеализацияТоваровУслугТовары.Ссылка.Оплата В(&Оплата)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиОбороты.Ресторан КАК Ресторан,
	               |	ПродажиОбороты.Регистратор,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций
	               |ПОМЕСТИТЬ Транзакции2
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода2,
	               |			&КонецПериода2,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Модификатор)
	               |				И Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |			И ПродажиОбороты.Оплата = РеализацияТоваровУслуг.Оплата
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Ресторан,
	               |	ПродажиОбороты.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(Транзакции2.КоличествоТранзакций) КАК КоличествоТранзакций
	               |ПОМЕСТИТЬ ТранзакцииГруппировка2
	               |ИЗ
	               |	Транзакции2 КАК Транзакции2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Транзакции2.Ресторан,
	               |	Транзакции2.Регистратор,
	               |	Транзакции2.КоличествоТранзакций
	               |ПОМЕСТИТЬ ТранзакцииПоГруппе2
	               |ИЗ
	               |	ПродажиПоГруппе2 КАК ПродажиПоГруппе2
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Транзакции2 КАК Транзакции2
	               |		ПО ПродажиПоГруппе2.Ресторан = Транзакции2.Ресторан
	               |			И ПродажиПоГруппе2.Регистратор = Транзакции2.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ТранзакцииПоГруппе2.КоличествоТранзакций) КАК КоличествоТранзакций
	               |ПОМЕСТИТЬ ТранзакцииПоГруппеГруппировка2
	               |ИЗ
	               |	ТранзакцииПоГруппе2 КАК ТранзакцииПоГруппе2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТранзакцииПоГруппеГруппировка2.КоличествоТранзакций КАК КоличествоТранзакцийПоГруппе,
	               |	ТранзакцииГруппировка2.КоличествоТранзакций КАК КоличествоТранзакцийВсего,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииГруппировка2.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ТранзакцииПоГруппеГруппировка2.КоличествоТранзакций / ТранзакцииГруппировка2.КоличествоТранзакций * 100
	               |	КОНЕЦ КАК КоличествоТранзакцийПроцент
	               |ПОМЕСТИТЬ Период2
	               |ИЗ
	               |	ТранзакцииГруппировка2 КАК ТранзакцииГруппировка2,
	               |	ТранзакцииПоГруппеГруппировка2 КАК ТранзакцииПоГруппеГруппировка2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Период1.КоличествоТранзакцийПоГруппе КАК КоличествоТранзакцийПоГруппе1,
	               |	Период1.КоличествоТранзакцийВсего КАК КоличествоТранзакцийВсего1,
	               |	Период1.КоличествоТранзакцийПроцент КАК КоличествоТранзакцийПроцент1,
	               |	Период2.КоличествоТранзакцийПоГруппе КАК КоличествоТранзакцийПоГруппе2,
	               |	Период2.КоличествоТранзакцийВсего КАК КоличествоТранзакцийВсего2,
	               |	Период2.КоличествоТранзакцийПроцент КАК КоличествоТранзакцийПроцент2,
	               |	Период2.КоличествоТранзакцийПроцент - Период1.КоличествоТранзакцийПроцент КАК КоличествоТранзакцийПроцентАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоТранзакцийПроцент = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоТранзакцийПроцент / Период1.КоличествоТранзакцийПроцент - 1) * 100
	               |	КОНЕЦ КАК КоличествоТранзакцийПроцентПроцентноеОтклонение
	               |ИЗ
	               |	Период1 КАК Период1,
	               |	Период2 КАК Период2";
				   
	Запрос.УстановитьПараметр("НачалоПериода1", НачалоПериода1);
	Запрос.УстановитьПараметр("КонецПериода1", КонецПериода1);
	Запрос.УстановитьПараметр("НачалоПериода2", НачалоПериода2);
	Запрос.УстановитьПараметр("КонецПериода2", КонецПериода2);
	
	Если ЗначениеЗаполнено(Ресторан) Тогда
		Запрос.УстановитьПараметр("Ресторан", Ресторан);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Продажи.Ресторан В(&Ресторан)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Ресторан В(&Ресторан)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслугТовары.Ссылка.Ресторан В(&Ресторан)", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(Оплата) Тогда
		Запрос.УстановитьПараметр("Оплата", Оплата);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Продажи.Оплата В(&Оплата)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Оплата В(&Оплата)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслугТовары.Ссылка.Оплата В(&Оплата)", "ИСТИНА");
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция СформироватьЗапросПериодыПоГруппам(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РеализацияТоваровУслуг.Ссылка) КАК КоличествоДокументов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций,
	               |	СУММА(РеализацияТоваровУслуг.КоличествоКлиентов) КАК КоличествоГостей
	               |ПОМЕСТИТЬ ТранзакцииПосещения1
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода1,
	               |			&КонецПериода1,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |			И ПродажиОбороты.Оплата = РеализацияТоваровУслуг.Оплата
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиОбороты.ГруппаБлюда,
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоБлюд,
	               |	СУММА(ВЫБОР
	               |			КОГДА &УчитыватьКоэффициентПересчета
	               |				ТОГДА ПродажиОбороты.КоличествоУточненноеОборот * ПродажиОбороты.Номенклатура.КоэффициентЕдиницыИзмеренияДляОтчетов
	               |			ИНАЧЕ ПродажиОбороты.КоличествоУточненноеОборот
	               |		КОНЕЦ) КАК КоличествоБлюдУточн,
	               |	СУММА(ПродажиОбороты.АкцизныйНалогОборот) КАК АкцизныйНалог,
	               |	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиОбороты.СуммаНаценкиОборот) КАК Наценка,
	               |	СУММА(ПродажиОбороты.СуммаСкидкиОборот) КАК Скидка,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	СУММА(ПродажиОбороты.КоличествоОборот * СебестоимостьНоменклатуры.Себестоимость) КАК Себестоимость
	               |ПОМЕСТИТЬ ПродажиСебестоимость1
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода1,
	               |			&КонецПериода1,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры КАК СебестоимостьНоменклатуры
	               |		ПО ПродажиОбороты.Ресторан = СебестоимостьНоменклатуры.Ресторан
	               |			И ПродажиОбороты.Номенклатура = СебестоимостьНоменклатуры.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(ПродажиОбороты.ПериодМесяц, МЕСЯЦ) = СебестоимостьНоменклатуры.Период)
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.ГруппаБлюда
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиСебестоимость1.ГруппаБлюда,
	               |	ТранзакцииПосещения1.КоличествоДокументов КАК КоличествоДокументов,
	               |	ТранзакцииПосещения1.КоличествоТранзакций КАК КоличествоТранзакций,
	               |	ТранзакцииПосещения1.КоличествоГостей КАК КоличествоГостей,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ТранзакцииПосещения1.КоличествоГостей / ТранзакцииПосещения1.КоличествоТранзакций
	               |	КОНЕЦ КАК КоличествоГостейСреднее,
	               |	ПродажиСебестоимость1.КоличествоБлюд КАК КоличествоБлюд,
	               |	ПродажиСебестоимость1.КоличествоБлюдУточн,
	               |	ПродажиСебестоимость1.АкцизныйНалог КАК АкцизныйНалог,
	               |	ПродажиСебестоимость1.СуммаБезСкидок КАК СуммаБезСкидок,
	               |	ПродажиСебестоимость1.Наценка КАК Наценка,
	               |	ПродажиСебестоимость1.Скидка КАК Скидка,
	               |	ПродажиСебестоимость1.Сумма КАК Сумма,
	               |	ПродажиСебестоимость1.Себестоимость КАК Себестоимость,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.КоличествоБлюд / ТранзакцииПосещения1.КоличествоГостей
	               |	КОНЕЦ КАК КЦП,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.КоличествоБлюдУточн / ТранзакцииПосещения1.КоличествоГостей
	               |	КОНЕЦ КАК КЦПУточн,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ПродажиСебестоимость1.КоличествоБлюд
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.КоличествоБлюдУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ПродажиСебестоимость1.КоличествоБлюдУточн
	               |	КОНЕЦ КАК ЦенаУточн,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ТранзакцииПосещения1.КоличествоГостей
	               |	КОНЕЦ КАК СреднийЧек,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ТранзакцииПосещения1.КоличествоТранзакций
	               |	КОНЕЦ КАК СредняяТранзакция,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Скидка / ПродажиСебестоимость1.СуммаБезСкидок * 100
	               |	КОНЕЦ КАК СкидкаПроцент,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Себестоимость / ПродажиСебестоимость1.Сумма * 100
	               |	КОНЕЦ КАК СебестоимостьПроцент,
	               |	ПродажиСебестоимость1.Сумма - ПродажиСебестоимость1.Себестоимость КАК ВаловыйДоход,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (ПродажиСебестоимость1.Сумма - ПродажиСебестоимость1.Себестоимость) / ПродажиСебестоимость1.Сумма * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцент
	               |ПОМЕСТИТЬ Период1
	               |ИЗ
	               |	ПродажиСебестоимость1 КАК ПродажиСебестоимость1,
	               |	ТранзакцииПосещения1 КАК ТранзакцииПосещения1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РеализацияТоваровУслуг.Ссылка) КАК КоличествоДокументов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций,
	               |	СУММА(РеализацияТоваровУслуг.КоличествоКлиентов) КАК КоличествоГостей
	               |ПОМЕСТИТЬ ТранзакцииПосещения2
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода2,
	               |			&КонецПериода2,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |			И ПродажиОбороты.Оплата = РеализацияТоваровУслуг.Оплата
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиОбороты.ГруппаБлюда,
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоБлюд,
	               |	СУММА(ВЫБОР
	               |			КОГДА &УчитыватьКоэффициентПересчета
	               |				ТОГДА ПродажиОбороты.КоличествоУточненноеОборот * ПродажиОбороты.Номенклатура.КоэффициентЕдиницыИзмеренияДляОтчетов
	               |			ИНАЧЕ ПродажиОбороты.КоличествоУточненноеОборот
	               |		КОНЕЦ) КАК КоличествоБлюдУточн,
	               |	СУММА(ПродажиОбороты.АкцизныйНалогОборот) КАК АкцизныйНалог,
	               |	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиОбороты.СуммаНаценкиОборот) КАК Наценка,
	               |	СУММА(ПродажиОбороты.СуммаСкидкиОборот) КАК Скидка,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	СУММА(ПродажиОбороты.КоличествоОборот * СебестоимостьНоменклатуры.Себестоимость) КАК Себестоимость
	               |ПОМЕСТИТЬ ПродажиСебестоимость2
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода2,
	               |			&КонецПериода2,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры КАК СебестоимостьНоменклатуры
	               |		ПО ПродажиОбороты.Ресторан = СебестоимостьНоменклатуры.Ресторан
	               |			И ПродажиОбороты.Номенклатура = СебестоимостьНоменклатуры.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(ПродажиОбороты.ПериодМесяц, МЕСЯЦ) = СебестоимостьНоменклатуры.Период)
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.ГруппаБлюда
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиСебестоимость2.ГруппаБлюда,
	               |	ТранзакцииПосещения2.КоличествоДокументов КАК КоличествоДокументов,
	               |	ТранзакцииПосещения2.КоличествоТранзакций КАК КоличествоТранзакций,
	               |	ТранзакцииПосещения2.КоличествоГостей КАК КоличествоГостей,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ТранзакцииПосещения2.КоличествоГостей / ТранзакцииПосещения2.КоличествоТранзакций
	               |	КОНЕЦ КАК КоличествоГостейСреднее,
	               |	ПродажиСебестоимость2.КоличествоБлюд КАК КоличествоБлюд,
	               |	ПродажиСебестоимость2.КоличествоБлюдУточн,
	               |	ПродажиСебестоимость2.АкцизныйНалог КАК АкцизныйНалог,
	               |	ПродажиСебестоимость2.СуммаБезСкидок КАК СуммаБезСкидок,
	               |	ПродажиСебестоимость2.Наценка КАК Наценка,
	               |	ПродажиСебестоимость2.Скидка КАК Скидка,
	               |	ПродажиСебестоимость2.Сумма КАК Сумма,
	               |	ПродажиСебестоимость2.Себестоимость КАК Себестоимость,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.КоличествоБлюд / ТранзакцииПосещения2.КоличествоГостей
	               |	КОНЕЦ КАК КЦП,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.КоличествоБлюдУточн / ТранзакцииПосещения2.КоличествоГостей
	               |	КОНЕЦ КАК КЦПУточн,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ПродажиСебестоимость2.КоличествоБлюд
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.КоличествоБлюдУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ПродажиСебестоимость2.КоличествоБлюдУточн
	               |	КОНЕЦ КАК ЦенаУточн,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ТранзакцииПосещения2.КоличествоГостей
	               |	КОНЕЦ КАК СреднийЧек,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ТранзакцииПосещения2.КоличествоТранзакций
	               |	КОНЕЦ КАК СредняяТранзакция,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Скидка / ПродажиСебестоимость2.СуммаБезСкидок * 100
	               |	КОНЕЦ КАК СкидкаПроцент,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Себестоимость / ПродажиСебестоимость2.Сумма * 100
	               |	КОНЕЦ КАК СебестоимостьПроцент,
	               |	ПродажиСебестоимость2.Сумма - ПродажиСебестоимость2.Себестоимость КАК ВаловыйДоход,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (ПродажиСебестоимость2.Сумма - ПродажиСебестоимость2.Себестоимость) / ПродажиСебестоимость2.Сумма * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцент
	               |ПОМЕСТИТЬ Период2
	               |ИЗ
	               |	ПродажиСебестоимость2 КАК ПродажиСебестоимость2,
	               |	ТранзакцииПосещения2 КАК ТранзакцииПосещения2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(Период1.ГруппаБлюда, Период2.ГруппаБлюда) КАК ГруппаБлюда,
	               |	Период1.КоличествоДокументов КАК КоличествоДокументов1,
	               |	Период1.КоличествоТранзакций КАК КоличествоТранзакций1,
	               |	Период1.КоличествоГостей КАК КоличествоГостей1,
	               |	Период1.КоличествоГостейСреднее КАК КоличествоГостейСреднее1,
	               |	Период1.КоличествоБлюд КАК КоличествоБлюд1,
	               |	Период1.КоличествоБлюдУточн КАК КоличествоБлюдУточн1,
	               |	Период1.АкцизныйНалог КАК АкцизныйНалог1,
	               |	Период1.СуммаБезСкидок КАК СуммаБезСкидок1,
	               |	Период1.Наценка КАК Наценка1,
	               |	Период1.Скидка КАК Скидка1,
	               |	Период1.Сумма КАК Сумма1,
	               |	Период1.Себестоимость КАК Себестоимость1,
	               |	Период1.КЦП КАК КЦП1,
	               |	Период1.КЦПУточн КАК КЦПУточн1,
	               |	Период1.Цена КАК Цена1,
	               |	Период1.ЦенаУточн КАК ЦенаУточн1,
	               |	Период1.СреднийЧек КАК СреднийЧек1,
	               |	Период1.СредняяТранзакция КАК СредняяТранзакция1,
	               |	Период1.СкидкаПроцент КАК СкидкаПроцент1,
	               |	Период1.СебестоимостьПроцент КАК СебестоимостьПроцент1,
	               |	Период1.ВаловыйДоход КАК ВаловыйДоход1,
	               |	Период1.ВаловыйДоходПроцент КАК ВаловыйДоходПроцент1,
	               |	Период2.КоличествоДокументов КАК КоличествоДокументов2,
	               |	Период2.КоличествоТранзакций КАК КоличествоТранзакций2,
	               |	Период2.КоличествоГостей КАК КоличествоГостей2,
	               |	Период2.КоличествоГостейСреднее КАК КоличествоГостейСреднее2,
	               |	Период2.КоличествоБлюд КАК КоличествоБлюд2,
	               |	Период2.КоличествоБлюдУточн КАК КоличествоБлюдУточн2,
	               |	Период2.АкцизныйНалог КАК АкцизныйНалог2,
	               |	Период2.СуммаБезСкидок КАК СуммаБезСкидок2,
	               |	Период2.Наценка КАК Наценка2,
	               |	Период2.Скидка КАК Скидка2,
	               |	Период2.Сумма КАК Сумма2,
	               |	Период2.Себестоимость КАК Себестоимость2,
	               |	Период2.КЦП КАК КЦП2,
	               |	Период2.КЦПУточн КАК КЦПУточн2,
	               |	Период2.Цена КАК Цена2,
	               |	Период2.ЦенаУточн КАК ЦенаУточн2,
	               |	Период2.СреднийЧек КАК СреднийЧек2,
	               |	Период2.СредняяТранзакция КАК СредняяТранзакция2,
	               |	Период2.СкидкаПроцент КАК СкидкаПроцент2,
	               |	Период2.СебестоимостьПроцент КАК СебестоимостьПроцент2,
	               |	Период2.ВаловыйДоход КАК ВаловыйДоход2,
	               |	Период2.ВаловыйДоходПроцент КАК ВаловыйДоходПроцент2,
	               |	Период2.КоличествоДокументов - Период1.КоличествоДокументов КАК КоличествоДокументовАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоДокументов = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоДокументов / Период1.КоличествоДокументов - 1) * 100
	               |	КОНЕЦ КАК КоличествоДокументовПроцентноеОтклонение,
	               |	Период2.КоличествоТранзакций - Период1.КоличествоТранзакций КАК КоличествоТранзакцийАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоТранзакций / Период1.КоличествоТранзакций - 1) * 100
	               |	КОНЕЦ КАК КоличествоТранзакцийПроцентноеОтклонение,
	               |	Период2.КоличествоГостей - Период1.КоличествоГостей КАК КоличествоГостейАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоГостей / Период1.КоличествоГостей - 1) * 100
	               |	КОНЕЦ КАК КоличествоГостейПроцентноеОтклонение,
	               |	Период2.КоличествоГостейСреднее - Период1.КоличествоГостейСреднее КАК КоличествоГостейСреднееАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоГостейСреднее = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоГостейСреднее / Период1.КоличествоГостейСреднее - 1) * 100
	               |	КОНЕЦ КАК КоличествоГостейСреднееПроцентноеОтклонение,
	               |	Период2.КоличествоБлюд - Период1.КоличествоБлюд КАК КоличествоБлюдАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоБлюд / Период1.КоличествоБлюд - 1) * 100
	               |	КОНЕЦ КАК КоличествоБлюдПроцентноеОтклонение,
	               |	Период2.КоличествоБлюдУточн - Период1.КоличествоБлюдУточн КАК КоличествоБлюдУточнАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоБлюдУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоБлюдУточн / Период1.КоличествоБлюдУточн - 1) * 100
	               |	КОНЕЦ КАК КоличествоБлюдУточнПроцентноеОтклонение,
	               |	Период2.СуммаБезСкидок - Период1.СуммаБезСкидок КАК СуммаБезСкидокАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СуммаБезСкидок / Период1.СуммаБезСкидок - 1) * 100
	               |	КОНЕЦ КАК СуммаБезСкидокПроцентноеОтклонение,
	               |	Период2.Скидка - Период1.Скидка КАК СкидкаАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Скидка = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Скидка / Период1.Скидка - 1) * 100
	               |	КОНЕЦ КАК СкидкаПроцентноеОтклонение,
	               |	Период2.Сумма - Период1.Сумма КАК СуммаАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Сумма / Период1.Сумма - 1) * 100
	               |	КОНЕЦ КАК СуммаПроцентноеОтклонение,
	               |	Период2.Себестоимость - Период1.Себестоимость КАК СебестоимостьАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Себестоимость = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Себестоимость / Период1.Себестоимость - 1) * 100
	               |	КОНЕЦ КАК СебестоимостьПроцентноеОтклонение,
	               |	Период2.КЦП - Период1.КЦП КАК КЦПАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КЦП = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КЦП / Период1.КЦП - 1) * 100
	               |	КОНЕЦ КАК КЦППроцентноеОтклонение,
	               |	Период2.КЦПУточн - Период1.КЦПУточн КАК КЦПУточнАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КЦПУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КЦПУточн / Период1.КЦПУточн - 1) * 100
	               |	КОНЕЦ КАК КЦПУточнПроцентноеОтклонение,
	               |	Период2.Цена - Период1.Цена КАК ЦенаАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Цена = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Цена / Период1.Цена - 1) * 100
	               |	КОНЕЦ КАК ЦенаПроцентноеОтклонение,
	               |	Период2.ЦенаУточн - Период1.ЦенаУточн КАК ЦенаУточнАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.ЦенаУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.ЦенаУточн / Период1.ЦенаУточн - 1) * 100
	               |	КОНЕЦ КАК ЦенаУточнПроцентноеОтклонение,
	               |	Период2.СреднийЧек - Период1.СреднийЧек КАК СреднийЧекАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СреднийЧек = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СреднийЧек / Период1.СреднийЧек - 1) * 100
	               |	КОНЕЦ КАК СреднийЧекПроцентноеОтклонение,
	               |	Период2.СредняяТранзакция - Период1.СредняяТранзакция КАК СредняяТранзакцияАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СредняяТранзакция = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СредняяТранзакция / Период1.СредняяТранзакция - 1) * 100
	               |	КОНЕЦ КАК СредняяТранзакцияПроцентноеОтклонение,
	               |	Период2.СкидкаПроцент - Период1.СкидкаПроцент КАК СкидкаПроцентАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СкидкаПроцент = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СкидкаПроцент / Период1.СкидкаПроцент - 1) * 100
	               |	КОНЕЦ КАК СкидкаПроцентПроцентноеОтклонение,
	               |	Период2.СебестоимостьПроцент - Период1.СебестоимостьПроцент КАК СебестоимостьПроцентАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СебестоимостьПроцент = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СебестоимостьПроцент / Период1.СебестоимостьПроцент - 1) * 100
	               |	КОНЕЦ КАК СебестоимостьПроцентПроцентноеОтклонение,
	               |	Период2.ВаловыйДоход - Период1.ВаловыйДоход КАК ВаловыйДоходАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.ВаловыйДоход = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.ВаловыйДоход / Период1.ВаловыйДоход - 1) * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцентноеОтклонение,
	               |	Период2.ВаловыйДоходПроцент - Период1.ВаловыйДоходПроцент КАК ВаловыйДоходПроцентАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.ВаловыйДоходПроцент = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.ВаловыйДоходПроцент / Период1.ВаловыйДоходПроцент - 1) * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцентПроцентноеОтклонение
	               |ИЗ
	               |	Период1 КАК Период1
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Период2 КАК Период2
	               |		ПО Период1.ГруппаБлюда = Период2.ГруппаБлюда";
	
	Запрос.УстановитьПараметр("НачалоПериода1", НачалоПериода1);
	Запрос.УстановитьПараметр("КонецПериода1", КонецПериода1);
	Запрос.УстановитьПараметр("НачалоПериода2", НачалоПериода2);
	Запрос.УстановитьПараметр("КонецПериода2", КонецПериода2);
	
	Если ЗначениеЗаполнено(Ресторан) Тогда
		Запрос.УстановитьПараметр("Ресторан", Ресторан);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Ресторан В(&Ресторан)", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(Оплата) Тогда
		Запрос.УстановитьПараметр("Оплата", Оплата);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Оплата В(&Оплата)", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура В (&Номенклатура)", "ИСТИНА");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидСравнения", ЦенаВидСравнения);
	Запрос.УстановитьПараметр("ЗначениеСравнения", ЦенаЗначениеСравнения);
	Запрос.УстановитьПараметр("УчитыватьКоэффициентПересчета", УчитыватьКоэффициентПересчета);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция СформироватьЗапросТекущаяДата(НачалоПериода, КонецПериода, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РеализацияТоваровУслуг.Ссылка) КАК КоличествоДокументов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций,
	               |	СУММА(РеализацияТоваровУслуг.КоличествоКлиентов) КАК КоличествоГостей
	               |ПОМЕСТИТЬ ТранзакцииПосещения
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |			И ПродажиОбороты.Оплата = РеализацияТоваровУслуг.Оплата
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоБлюд,
	               |	СУММА(ВЫБОР
	               |			КОГДА &УчитыватьКоэффициентПересчета
	               |				ТОГДА ПродажиОбороты.КоличествоУточненноеОборот * ПродажиОбороты.Номенклатура.КоэффициентЕдиницыИзмеренияДляОтчетов
	               |			ИНАЧЕ ПродажиОбороты.КоличествоУточненноеОборот
	               |		КОНЕЦ) КАК КоличествоБлюдУточн,
	               |	СУММА(ПродажиОбороты.АкцизныйНалогОборот) КАК АкцизныйНалог,
	               |	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиОбороты.СуммаНаценкиОборот) КАК Наценка,
	               |	СУММА(ПродажиОбороты.СуммаСкидкиОборот) КАК Скидка,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	СУММА(ПродажиОбороты.КоличествоОборот * СебестоимостьНоменклатуры.Себестоимость) КАК Себестоимость
	               |ПОМЕСТИТЬ ПродажиСебестоимость
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры КАК СебестоимостьНоменклатуры
	               |		ПО ПродажиОбороты.Ресторан = СебестоимостьНоменклатуры.Ресторан
	               |			И ПродажиОбороты.Номенклатура = СебестоимостьНоменклатуры.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(ПродажиОбороты.ПериодМесяц, МЕСЯЦ) = СебестоимостьНоменклатуры.Период)
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТранзакцииПосещения.КоличествоДокументов КАК КоличествоДокументов,
	               |	ТранзакцииПосещения.КоличествоТранзакций КАК КоличествоТранзакций,
	               |	ТранзакцииПосещения.КоличествоГостей КАК КоличествоГостей,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ТранзакцииПосещения.КоличествоГостей / ТранзакцииПосещения.КоличествоТранзакций
	               |	КОНЕЦ КАК КоличествоГостейСреднее,
	               |	ПродажиСебестоимость.КоличествоБлюд КАК КоличествоБлюд,
	               |	ПродажиСебестоимость.КоличествоБлюдУточн КАК КоличествоБлюдУточн,
	               |	ПродажиСебестоимость.АкцизныйНалог КАК АкцизныйНалог,
	               |	ПродажиСебестоимость.СуммаБезСкидок КАК СуммаБезСкидок,
	               |	ПродажиСебестоимость.Наценка КАК Наценка,
	               |	ПродажиСебестоимость.Скидка КАК Скидка,
	               |	ПродажиСебестоимость.Сумма КАК Сумма,
	               |	ПродажиСебестоимость.Себестоимость КАК Себестоимость,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость.КоличествоБлюд / ТранзакцииПосещения.КоличествоГостей
	               |	КОНЕЦ КАК КЦП,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость.КоличествоБлюдУточн / ТранзакцииПосещения.КоличествоГостей
	               |	КОНЕЦ КАК КЦПУточн,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость.Сумма / ПродажиСебестоимость.КоличествоБлюд
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость.КоличествоБлюдУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость.Сумма / ПродажиСебестоимость.КоличествоБлюдУточн
	               |	КОНЕЦ КАК ЦенаУточн,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость.Сумма / ТранзакцииПосещения.КоличествоГостей
	               |	КОНЕЦ КАК СреднийЧек,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость.Сумма / ТранзакцииПосещения.КоличествоТранзакций
	               |	КОНЕЦ КАК СредняяТранзакция,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость.Скидка / ПродажиСебестоимость.СуммаБезСкидок * 100
	               |	КОНЕЦ КАК СкидкаПроцент,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость.Себестоимость / ПродажиСебестоимость.Сумма * 100
	               |	КОНЕЦ КАК СебестоимостьПроцент,
	               |	ПродажиСебестоимость.Сумма - ПродажиСебестоимость.Себестоимость КАК ВаловыйДоход,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (ПродажиСебестоимость.Сумма - ПродажиСебестоимость.Себестоимость) / ПродажиСебестоимость.Сумма * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцент
	               |ИЗ
	               |	ПродажиСебестоимость КАК ПродажиСебестоимость,
	               |	ТранзакцииПосещения КАК ТранзакцииПосещения";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Если ЗначениеЗаполнено(Ресторан) Тогда
		Запрос.УстановитьПараметр("Ресторан", Ресторан);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Ресторан В(&Ресторан)", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(Оплата) Тогда
		Запрос.УстановитьПараметр("Оплата", Оплата);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Оплата В(&Оплата)", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура В (&Номенклатура)", "ИСТИНА");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидСравнения", ЦенаВидСравнения);
	Запрос.УстановитьПараметр("ЗначениеСравнения", ЦенаЗначениеСравнения);
	Запрос.УстановитьПараметр("УчитыватьКоэффициентПересчета", УчитыватьКоэффициентПересчета);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция СформироватьЗапросПланФакт(НачалоПериода, КонецПериода, Ресторан, Оплата, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДЕНЬ(КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)) КАК ПериодТекущийКоличествоДней,
	               |	РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, ДЕНЬ) КАК ПериодОтчетаКоличествоДней
	               |ПОМЕСТИТЬ Периоды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПланыПродаж.Ресторан,
	               |	МАКСИМУМ(ПланыПродаж.КоличествоКлиентов) КАК КоличествоКлиентов,
	               |	МАКСИМУМ(ПланыПродаж.КоличествоКлиентовСреднее) КАК КоличествоКлиентовСреднее
	               |ПОМЕСТИТЬ ПосещенияПланРестораны
	               |ИЗ
	               |	РегистрНакопления.ПланыПродаж КАК ПланыПродаж
	               |ГДЕ
	               |	ПланыПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПланыПродаж.Ресторан В(&Ресторан)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПланыПродаж.Ресторан
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПосещенияПланРестораны.КоличествоКлиентов) КАК КоличествоКлиентов,
	               |	СРЕДНЕЕ(ПосещенияПланРестораны.КоличествоКлиентовСреднее) КАК КоличествоКлиентовСреднее
	               |ПОМЕСТИТЬ ПосещенияПлан
	               |ИЗ
	               |	ПосещенияПланРестораны КАК ПосещенияПланРестораны
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПланыПродаж.Количество) КАК КоличествоБлюд,
	               |	СУММА(ПланыПродаж.СуммаБезСкидок) КАК СуммаБезСкидок,
	               |	СУММА(ПланыПродаж.СуммаСкидки) КАК СуммаСкидки,
	               |	СУММА(ПланыПродаж.Сумма) КАК Сумма,
	               |	СУММА(ПланыПродаж.Себестоимость) КАК Себестоимость,
	               |	СУММА(ПланыПродаж.ВаловыйДоход) КАК ВаловыйДоход
	               |ПОМЕСТИТЬ ПродажиПланОсновное
	               |ИЗ
	               |	РегистрНакопления.ПланыПродаж КАК ПланыПродаж
	               |ГДЕ
	               |	ПланыПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПланыПродаж.Ресторан В(&Ресторан)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПосещенияПлан.КоличествоКлиентов,
	               |	ПосещенияПлан.КоличествоКлиентовСреднее,
	               |	ПродажиПланОсновное.КоличествоБлюд,
	               |	ПродажиПланОсновное.СуммаБезСкидок КАК СуммаБезСкидок,
	               |	ПродажиПланОсновное.СуммаСкидки КАК СуммаСкидки,
	               |	ПродажиПланОсновное.Сумма КАК Сумма,
	               |	ПродажиПланОсновное.Себестоимость КАК Себестоимость,
	               |	ПродажиПланОсновное.ВаловыйДоход КАК ВаловыйДоход,
	               |	ВЫБОР
	               |		КОГДА ПосещенияПлан.КоличествоКлиентов = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиПланОсновное.КоличествоБлюд / ПосещенияПлан.КоличествоКлиентов
	               |	КОНЕЦ КАК КЦП,
	               |	ВЫБОР
	               |		КОГДА ПродажиПланОсновное.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиПланОсновное.Сумма / ПродажиПланОсновное.КоличествоБлюд
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ПосещенияПлан.КоличествоКлиентов = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиПланОсновное.Сумма / ПосещенияПлан.КоличествоКлиентов
	               |	КОНЕЦ КАК СреднийЧек,
	               |	0 КАК СредняяТранзакция,
	               |	ВЫБОР
	               |		КОГДА ПродажиПланОсновное.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиПланОсновное.СуммаСкидки / ПродажиПланОсновное.СуммаБезСкидок * 100
	               |	КОНЕЦ КАК СкидкаПроцент,
	               |	ВЫБОР
	               |		КОГДА ПродажиПланОсновное.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиПланОсновное.Себестоимость / ПродажиПланОсновное.Сумма * 100
	               |	КОНЕЦ КАК СебестоимостьПроцент,
	               |	ВЫБОР
	               |		КОГДА ПродажиПланОсновное.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиПланОсновное.ВаловыйДоход / ПродажиПланОсновное.Сумма * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцент
	               |ПОМЕСТИТЬ ПродажиПлан
	               |ИЗ
	               |	ПродажиПланОсновное КАК ПродажиПланОсновное,
	               |	ПосещенияПлан КАК ПосещенияПлан
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КОЛИЧЕСТВО(РеализацияТоваровУслуг.Ссылка) КАК КоличествоДокументов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций,
	               |	СУММА(РеализацияТоваровУслуг.КоличествоКлиентов) КАК КоличествоКлиентов
	               |ПОМЕСТИТЬ ТранзакцииПосещения
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КОЛИЧЕСТВО(РеализацияТоваровУслуг.Ссылка) КАК КоличествоДокументов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций,
	               |	СУММА(РеализацияТоваровУслуг.КоличествоКлиентов) КАК КоличествоКлиентов
	               |ПОМЕСТИТЬ ТранзакцииПосещенияПрогноз
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(, , Авто, Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |ГДЕ
	               |	ПродажиОбороты.Регистратор.Дата МЕЖДУ &НачалоПериода И ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, -86400)
	               |	И ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоБлюд,
	               |	СУММА(ВЫБОР
	               |			КОГДА &УчитыватьКоэффициентПересчета
	               |				ТОГДА ПродажиОбороты.КоличествоУточненноеОборот * ПродажиОбороты.Номенклатура.КоэффициентЕдиницыИзмеренияДляОтчетов
	               |			ИНАЧЕ ПродажиОбороты.КоличествоУточненноеОборот
	               |		КОНЕЦ) КАК КоличествоБлюдУточн,
	               |	СУММА(ПродажиОбороты.АкцизныйНалогОборот) КАК АкцизныйНалог,
	               |	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиОбороты.СуммаНаценкиОборот) КАК СуммаНаценки,
	               |	СУММА(ПродажиОбороты.СуммаСкидкиОборот) КАК СуммаСкидки,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	СУММА(ПродажиОбороты.КоличествоОборот * СебестоимостьНоменклатуры.Себестоимость) КАК Себестоимость
	               |ПОМЕСТИТЬ ПродажиСебестоимость
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры КАК СебестоимостьНоменклатуры
	               |		ПО ПродажиОбороты.Ресторан = СебестоимостьНоменклатуры.Ресторан
	               |			И ПродажиОбороты.Номенклатура = СебестоимостьНоменклатуры.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(ПродажиОбороты.ПериодМесяц, МЕСЯЦ) = СебестоимостьНоменклатуры.Период)
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоБлюд,
	               |	СУММА(ПродажиОбороты.АкцизныйНалогОборот) КАК АкцизныйНалог,
	               |	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиОбороты.СуммаНаценкиОборот) КАК СуммаНаценки,
	               |	СУММА(ПродажиОбороты.СуммаСкидкиОборот) КАК СуммаСкидки,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	СУММА(ПродажиОбороты.КоличествоОборот * СебестоимостьНоменклатуры.Себестоимость) КАК Себестоимость
	               |ПОМЕСТИТЬ ПродажиСебестоимостьПрогноз
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(, , Авто, Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры КАК СебестоимостьНоменклатуры
	               |		ПО ПродажиОбороты.Ресторан = СебестоимостьНоменклатуры.Ресторан
	               |			И ПродажиОбороты.Номенклатура = СебестоимостьНоменклатуры.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(ПродажиОбороты.ПериодМесяц, МЕСЯЦ) = СебестоимостьНоменклатуры.Период)
	               |ГДЕ
	               |	ПродажиОбороты.Регистратор.Дата МЕЖДУ &НачалоПериода И ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, -86400)
	               |	И ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ТранзакцииПосещения.КоличествоДокументов) КАК КоличествоДокументов,
	               |	СУММА(ТранзакцииПосещения.КоличествоТранзакций) КАК КоличествоТранзакций,
	               |	СУММА(ТранзакцииПосещения.КоличествоКлиентов) КАК КоличествоКлиентов,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТранзакцииПосещения.КоличествоТранзакций = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ТранзакцииПосещения.КоличествоКлиентов / ТранзакцииПосещения.КоличествоТранзакций
	               |		КОНЕЦ) КАК КоличествоКлиентовСреднее,
	               |	СУММА(ПродажиСебестоимость.КоличествоБлюд) КАК КоличествоБлюд,
	               |	СУММА(ПродажиСебестоимость.КоличествоБлюдУточн) КАК КоличествоБлюдУточн,
	               |	СУММА(ПродажиСебестоимость.АкцизныйНалог) КАК АкцизныйНалог,
	               |	СУММА(ПродажиСебестоимость.СуммаБезСкидок) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиСебестоимость.СуммаНаценки) КАК СуммаНаценки,
	               |	СУММА(ПродажиСебестоимость.СуммаСкидки) КАК СуммаСкидки,
	               |	СУММА(ПродажиСебестоимость.Сумма) КАК Сумма,
	               |	СУММА(ПродажиСебестоимость.Себестоимость) КАК Себестоимость,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТранзакцииПосещения.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.КоличествоБлюд / ТранзакцииПосещения.КоличествоКлиентов
	               |		КОНЕЦ) КАК КЦП,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТранзакцииПосещения.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.КоличествоБлюдУточн / ТранзакцииПосещения.КоличествоКлиентов
	               |		КОНЕЦ) КАК КЦПУточн,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиСебестоимость.КоличествоБлюд = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.Сумма / ПродажиСебестоимость.КоличествоБлюд
	               |		КОНЕЦ) КАК Цена,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиСебестоимость.КоличествоБлюдУточн = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.Сумма / ПродажиСебестоимость.КоличествоБлюдУточн
	               |		КОНЕЦ) КАК ЦенаУточн,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТранзакцииПосещения.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.Сумма / ТранзакцииПосещения.КоличествоКлиентов
	               |		КОНЕЦ) КАК СреднийЧек,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТранзакцииПосещения.КоличествоТранзакций = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.Сумма / ТранзакцииПосещения.КоличествоТранзакций
	               |		КОНЕЦ) КАК СредняяТранзакция,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиСебестоимость.СуммаБезСкидок = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.СуммаСкидки / ПродажиСебестоимость.СуммаБезСкидок * 100
	               |		КОНЕЦ) КАК СкидкаПроцент,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиСебестоимость.Сумма = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.Себестоимость / ПродажиСебестоимость.Сумма * 100
	               |		КОНЕЦ) КАК СебестоимостьПроцент,
	               |	СУММА(ПродажиСебестоимость.Сумма - ПродажиСебестоимость.Себестоимость) КАК ВаловыйДоход,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиСебестоимость.Сумма = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиСебестоимость.Сумма - ПродажиСебестоимость.Себестоимость) / ПродажиСебестоимость.Сумма
	               |		КОНЕЦ) КАК ВаловыйДоходПроцент
	               |ПОМЕСТИТЬ ПродажиФакт
	               |ИЗ
	               |	ПродажиСебестоимость КАК ПродажиСебестоимость,
	               |	ТранзакцииПосещения КАК ТранзакцииПосещения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ТранзакцииПосещенияПрогноз.КоличествоДокументов) КАК КоличествоДокументов,
	               |	СУММА(ТранзакцииПосещенияПрогноз.КоличествоТранзакций) КАК КоличествоТранзакций,
	               |	СУММА(ТранзакцииПосещенияПрогноз.КоличествоКлиентов) КАК КоличествоКлиентов,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТранзакцииПосещенияПрогноз.КоличествоТранзакций = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ТранзакцииПосещенияПрогноз.КоличествоКлиентов / ТранзакцииПосещенияПрогноз.КоличествоТранзакций
	               |		КОНЕЦ) КАК КоличествоКлиентовСреднее,
	               |	СУММА(ПродажиСебестоимостьПрогноз.КоличествоБлюд) КАК КоличествоБлюд,
	               |	СУММА(ПродажиСебестоимостьПрогноз.АкцизныйНалог) КАК АкцизныйНалог,
	               |	СУММА(ПродажиСебестоимостьПрогноз.СуммаБезСкидок) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиСебестоимостьПрогноз.СуммаНаценки) КАК СуммаНаценки,
	               |	СУММА(ПродажиСебестоимостьПрогноз.СуммаСкидки) КАК СуммаСкидки,
	               |	СУММА(ПродажиСебестоимостьПрогноз.Сумма) КАК Сумма,
	               |	СУММА(ПродажиСебестоимостьПрогноз.Себестоимость) КАК Себестоимость,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТранзакцииПосещенияПрогноз.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимостьПрогноз.КоличествоБлюд / ТранзакцииПосещенияПрогноз.КоличествоКлиентов
	               |		КОНЕЦ) КАК КЦП,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиСебестоимостьПрогноз.КоличествоБлюд = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимостьПрогноз.Сумма / ПродажиСебестоимостьПрогноз.КоличествоБлюд
	               |		КОНЕЦ) КАК Цена,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТранзакцииПосещенияПрогноз.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимостьПрогноз.Сумма / ТранзакцииПосещенияПрогноз.КоличествоКлиентов
	               |		КОНЕЦ) КАК СреднийЧек,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТранзакцииПосещенияПрогноз.КоличествоТранзакций = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимостьПрогноз.Сумма / ТранзакцииПосещенияПрогноз.КоличествоТранзакций
	               |		КОНЕЦ) КАК СредняяТранзакция,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиСебестоимостьПрогноз.СуммаБезСкидок = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимостьПрогноз.СуммаСкидки / ПродажиСебестоимостьПрогноз.СуммаБезСкидок * 100
	               |		КОНЕЦ) КАК СкидкаПроцент,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиСебестоимостьПрогноз.Сумма = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимостьПрогноз.Себестоимость / ПродажиСебестоимостьПрогноз.Сумма * 100
	               |		КОНЕЦ) КАК СебестоимостьПроцент,
	               |	СУММА(ПродажиСебестоимостьПрогноз.Сумма - ПродажиСебестоимостьПрогноз.Себестоимость) КАК ВаловыйДоход,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиСебестоимостьПрогноз.Сумма = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиСебестоимостьПрогноз.Сумма - ПродажиСебестоимостьПрогноз.Себестоимость) / ПродажиСебестоимостьПрогноз.Сумма * 100
	               |		КОНЕЦ) КАК ВаловыйДоходПроцент
	               |ПОМЕСТИТЬ ПродажиФактПрогноз
	               |ИЗ
	               |	ПродажиСебестоимостьПрогноз КАК ПродажиСебестоимостьПрогноз,
	               |	ТранзакцииПосещенияПрогноз КАК ТранзакцииПосещенияПрогноз
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПродажиФактПрогноз.КоличествоКлиентов / Периоды.ПериодОтчетаКоличествоДней * Периоды.ПериодТекущийКоличествоДней) КАК КоличествоКлиентов,
	               |	СУММА(ПродажиФактПрогноз.КоличествоКлиентовСреднее) КАК КоличествоКлиентовСреднее,
	               |	СУММА(ПродажиФактПрогноз.КоличествоКлиентов / Периоды.ПериодОтчетаКоличествоДней * Периоды.ПериодТекущийКоличествоДней * ПродажиФактПрогноз.КЦП) КАК КоличествоБлюд,
	               |	СУММА(ПродажиФактПрогноз.КЦП) КАК КЦП,
	               |	СУММА(ПродажиФактПрогноз.Цена) КАК Цена,
	               |	СУММА(ПродажиФактПрогноз.КЦП * ПродажиФактПрогноз.Цена) КАК СреднийЧек,
	               |	СУММА(ПродажиФактПрогноз.КоличествоКлиентовСреднее * ПродажиФактПрогноз.КЦП * ПродажиФактПрогноз.Цена) КАК СредняяТранзакция,
	               |	СУММА(ПродажиФактПрогноз.КоличествоКлиентов / Периоды.ПериодОтчетаКоличествоДней * Периоды.ПериодТекущийКоличествоДней * ПродажиФактПрогноз.КЦП * ПродажиФактПрогноз.Цена / ((100 - ПродажиФактПрогноз.СкидкаПроцент) / 100)) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиФактПрогноз.КоличествоКлиентов / Периоды.ПериодОтчетаКоличествоДней * Периоды.ПериодТекущийКоличествоДней * ПродажиФактПрогноз.КЦП * ПродажиФактПрогноз.Цена / ((100 - ПродажиФактПрогноз.СкидкаПроцент) / 100) - ПродажиФактПрогноз.КоличествоКлиентов / Периоды.ПериодОтчетаКоличествоДней * Периоды.ПериодТекущийКоличествоДней * ПродажиФактПрогноз.КЦП * ПродажиФактПрогноз.Цена) КАК СуммаСкидки,
	               |	СУММА(ПродажиФактПрогноз.СкидкаПроцент) КАК СкидкаПроцент,
	               |	СУММА(ПродажиФактПрогноз.КоличествоКлиентов / Периоды.ПериодОтчетаКоличествоДней * Периоды.ПериодТекущийКоличествоДней * ПродажиФактПрогноз.КЦП * ПродажиФактПрогноз.Цена) КАК Сумма,
	               |	СУММА(ПродажиФактПрогноз.КоличествоКлиентов / Периоды.ПериодОтчетаКоличествоДней * Периоды.ПериодТекущийКоличествоДней * ПродажиФактПрогноз.КЦП * ПродажиФактПрогноз.Цена * ПродажиФактПрогноз.СебестоимостьПроцент / 100) КАК Себестоимость,
	               |	СУММА(ПродажиФактПрогноз.СебестоимостьПроцент) КАК СебестоимостьПроцент,
	               |	СУММА(ПродажиФактПрогноз.КоличествоКлиентов / Периоды.ПериодОтчетаКоличествоДней * Периоды.ПериодТекущийКоличествоДней * ПродажиФактПрогноз.КЦП * ПродажиФактПрогноз.Цена - ПродажиФактПрогноз.КоличествоКлиентов / Периоды.ПериодОтчетаКоличествоДней * Периоды.ПериодТекущийКоличествоДней * ПродажиФактПрогноз.КЦП * ПродажиФактПрогноз.Цена * ПродажиФактПрогноз.СебестоимостьПроцент / 100) КАК ВаловыйДоход,
	               |	СУММА(ПродажиФактПрогноз.ВаловыйДоходПроцент) КАК ВаловыйДоходПроцент
	               |ПОМЕСТИТЬ ПродажиПрогноз
	               |ИЗ
	               |	Периоды КАК Периоды,
	               |	ПродажиФактПрогноз КАК ПродажиФактПрогноз
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПродажиПлан.КоличествоКлиентов) КАК КоличествоГостейПлан,
	               |	СУММА(ПродажиПлан.КоличествоКлиентовСреднее) КАК КоличествоГостейСреднееПлан,
	               |	СУММА(ПродажиПлан.КоличествоБлюд) КАК КоличествоБлюдПлан,
	               |	СУММА(ПродажиПлан.КЦП) КАК КЦППлан,
	               |	СУММА(ПродажиПлан.Цена) КАК ЦенаПлан,
	               |	СУММА(ПродажиПлан.СреднийЧек) КАК СреднийЧекПлан,
	               |	СУММА(ПродажиПлан.СредняяТранзакция) КАК СредняяТранзакцияПлан,
	               |	СУММА(ПродажиПлан.СуммаБезСкидок) КАК СуммаБезСкидокПлан,
	               |	СУММА(ПродажиПлан.СуммаСкидки) КАК СуммаСкидкиПлан,
	               |	СУММА(ПродажиПлан.СкидкаПроцент) КАК СкидкаПроцентПлан,
	               |	СУММА(ПродажиПлан.Сумма) КАК СуммаПлан,
	               |	СУММА(ПродажиПлан.Себестоимость) КАК СебестоимостьПлан,
	               |	СУММА(ПродажиПлан.СебестоимостьПроцент) КАК СебестоимостьПроцентПлан,
	               |	СУММА(ПродажиПлан.ВаловыйДоход) КАК ВаловыйДоходПлан,
	               |	СУММА(ПродажиПлан.ВаловыйДоходПроцент) КАК ВаловыйДоходПроцентПлан,
	               |	СУММА(ПродажиФакт.КоличествоДокументов) КАК КоличествоДокументовФакт,
	               |	СУММА(ПродажиФакт.КоличествоТранзакций) КАК КоличествоТранзакцийФакт,
	               |	СУММА(ПродажиФакт.КоличествоКлиентов) КАК КоличествоГостейФакт,
	               |	СУММА(ПродажиФакт.КоличествоБлюд) КАК КоличествоБлюдФакт,
	               |	СУММА(ПродажиФакт.КоличествоБлюдУточн) КАК КоличествоБлюдУточнФакт,
	               |	СУММА(ПродажиФакт.АкцизныйНалог) КАК АкцизныйНалогФакт,
	               |	СУММА(ПродажиФакт.СуммаБезСкидок) КАК СуммаБезСкидокФакт,
	               |	СУММА(ПродажиФакт.СуммаНаценки) КАК СуммаНаценкиФакт,
	               |	СУММА(ПродажиФакт.СуммаСкидки) КАК СуммаСкидкиФакт,
	               |	СУММА(ПродажиФакт.Сумма) КАК СуммаФакт,
	               |	СУММА(ПродажиФакт.Себестоимость) КАК СебестоимостьФакт,
	               |	СУММА(ПродажиФакт.КоличествоКлиентовСреднее) КАК КоличествоГостейСреднееФакт,
	               |	СУММА(ПродажиФакт.КЦП) КАК КЦПФакт,
	               |	СУММА(ПродажиФакт.КЦПУточн) КАК КЦПУточнФакт,
	               |	СУММА(ПродажиФакт.Цена) КАК ЦенаФакт,
	               |	СУММА(ПродажиФакт.ЦенаУточн) КАК ЦенаУточнФакт,
	               |	СУММА(ПродажиФакт.СреднийЧек) КАК СреднийЧекФакт,
	               |	СУММА(ПродажиФакт.СредняяТранзакция) КАК СредняяТранзакцияФакт,
	               |	СУММА(ПродажиФакт.СкидкаПроцент) КАК СкидкаПроцентФакт,
	               |	СУММА(ПродажиФакт.СебестоимостьПроцент) КАК СебестоимостьПроцентФакт,
	               |	СУММА(ПродажиФакт.ВаловыйДоход) КАК ВаловыйДоходФакт,
	               |	СУММА(ПродажиФакт.ВаловыйДоходПроцент) КАК ВаловыйДоходПроцентФакт,
	               |	СУММА(ПродажиПрогноз.КоличествоКлиентов) КАК КоличествоГостейПрогноз,
	               |	СУММА(ПродажиПрогноз.КоличествоКлиентовСреднее) КАК КоличествоГостейСреднееПрогноз,
	               |	СУММА(ПродажиПрогноз.КоличествоБлюд) КАК КоличествоБлюдПрогноз,
	               |	СУММА(ПродажиПрогноз.КЦП) КАК КЦППрогноз,
	               |	СУММА(ПродажиПрогноз.Цена) КАК ЦенаПрогноз,
	               |	СУММА(ПродажиПрогноз.СреднийЧек) КАК СреднийЧекПрогноз,
	               |	СУММА(ПродажиПрогноз.СредняяТранзакция) КАК СредняяТранзакцияПрогноз,
	               |	СУММА(ПродажиПрогноз.СуммаБезСкидок) КАК СуммаБезСкидокПрогноз,
	               |	СУММА(ПродажиПрогноз.СуммаСкидки) КАК СуммаСкидкиПрогноз,
	               |	СУММА(ПродажиПрогноз.СкидкаПроцент) КАК СкидкаПроцентПрогноз,
	               |	СУММА(ПродажиПрогноз.Сумма) КАК СуммаПрогноз,
	               |	СУММА(ПродажиПрогноз.Себестоимость) КАК СебестоимостьПрогноз,
	               |	СУММА(ПродажиПрогноз.СебестоимостьПроцент) КАК СебестоимостьПроцентПрогноз,
	               |	СУММА(ПродажиПрогноз.ВаловыйДоход) КАК ВаловыйДоходПрогноз,
	               |	СУММА(ПродажиПрогноз.ВаловыйДоходПроцент) КАК ВаловыйДоходПроцентПрогноз,
	               |	СУММА(ПродажиПрогноз.КоличествоКлиентов - ПродажиПлан.КоличествоКлиентов) КАК КоличествоГостейАбсолютноеОтклонение,
	               |	СУММА(ПродажиПрогноз.КоличествоКлиентовСреднее - ПродажиПлан.КоличествоКлиентовСреднее) КАК КоличествоГостейСреднееАбсолютноеОтклонение,
	               |	СУММА(ПродажиПрогноз.КоличествоБлюд - ПродажиПлан.КоличествоБлюд) КАК КоличествоБлюдАбсолютноеОтклонение,
	               |	СУММА(ПродажиПрогноз.КЦП - ПродажиПлан.КЦП) КАК КЦПАбсолютноеОтклонение,
	               |	СУММА(ПродажиПрогноз.Цена - ПродажиПлан.Цена) КАК ЦенаАбсолютноеОтклонение,
	               |	СУММА(ПродажиПрогноз.СреднийЧек - ПродажиПлан.СреднийЧек) КАК СреднийЧекАбсолютноеОтклонение,
	               |	СУММА(ПродажиПрогноз.СредняяТранзакция - ПродажиПлан.СредняяТранзакция) КАК СредняяТранзакцияАбсолютноеОтклонение,
	               |	СУММА(ПродажиПрогноз.СуммаБезСкидок - ПродажиПлан.СуммаБезСкидок) КАК СуммаБезСкидокАбсолютноеОтклонение,
	               |	СУММА(ПродажиПрогноз.СуммаСкидки - ПродажиПлан.СуммаСкидки) КАК СуммаСкидкиАбсолютноеОтклонение,
	               |	СУММА(ПродажиПрогноз.СкидкаПроцент - ПродажиПлан.СкидкаПроцент) КАК СкидкаПроцентАбсолютноеОтклонение,
	               |	СУММА(ПродажиПрогноз.Сумма - ПродажиПлан.Сумма) КАК СуммаАбсолютноеОтклонение,
	               |	СУММА(ПродажиПрогноз.Себестоимость - ПродажиПлан.Себестоимость) КАК СебестоимостьАбсолютноеОтклонение,
	               |	СУММА(ПродажиПрогноз.СебестоимостьПроцент - ПродажиПлан.СебестоимостьПроцент) КАК СебестоимостьПроцентАбсолютноеОтклонение,
	               |	СУММА(ПродажиПрогноз.ВаловыйДоход - ПродажиПлан.ВаловыйДоход) КАК ВаловыйДоходАбсолютноеОтклонение,
	               |	СУММА(ПродажиПрогноз.ВаловыйДоходПроцент - ПродажиПлан.ВаловыйДоходПроцент) КАК ВаловыйДоходПроцентАбсолютноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.КоличествоКлиентов / ПродажиПлан.КоличествоКлиентов - 1) * 100
	               |		КОНЕЦ) КАК КоличествоГостейПроцентноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.КоличествоКлиентовСреднее = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.КоличествоКлиентовСреднее / ПродажиПлан.КоличествоКлиентовСреднее - 1) * 100
	               |		КОНЕЦ) КАК КоличествоГостейСреднееПроцентноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.КоличествоБлюд = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.КоличествоБлюд / ПродажиПлан.КоличествоБлюд - 1) * 100
	               |		КОНЕЦ) КАК КоличествоБлюдПроцентноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.КЦП = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.КЦП / ПродажиПлан.КЦП - 1) * 100
	               |		КОНЕЦ) КАК КЦППроцентноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.Цена = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.Цена / ПродажиПлан.Цена - 1) * 100
	               |		КОНЕЦ) КАК ЦенаПроцентноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.СреднийЧек = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.СреднийЧек / ПродажиПлан.СреднийЧек - 1) * 100
	               |		КОНЕЦ) КАК СреднийЧекПроцентноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.СредняяТранзакция = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.СредняяТранзакция / ПродажиПлан.СредняяТранзакция - 1) * 100
	               |		КОНЕЦ) КАК СредняяТранзакцияПроцентноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.СуммаБезСкидок = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.СуммаБезСкидок / ПродажиПлан.СуммаБезСкидок - 1) * 100
	               |		КОНЕЦ) КАК СуммаБезСкидокПроцентноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.СуммаСкидки = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.СуммаСкидки / ПродажиПлан.СуммаСкидки - 1) * 100
	               |		КОНЕЦ) КАК СуммаСкидкиПроцентноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.СкидкаПроцент = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.СкидкаПроцент / ПродажиПлан.СкидкаПроцент - 1) * 100
	               |		КОНЕЦ) КАК СуммаСкидкиПроцентПроцентноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.Сумма = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.Сумма / ПродажиПлан.Сумма - 1) * 100
	               |		КОНЕЦ) КАК СуммаПроцентноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.Себестоимость = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.Себестоимость / ПродажиПлан.Себестоимость - 1) * 100
	               |		КОНЕЦ) КАК СебестоимостьПроцентноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.СебестоимостьПроцент = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.СебестоимостьПроцент / ПродажиПлан.СебестоимостьПроцент - 1) * 100
	               |		КОНЕЦ) КАК СебестоимостьПроцентПроцентноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.ВаловыйДоход = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.ВаловыйДоход / ПродажиПлан.ВаловыйДоход - 1) * 100
	               |		КОНЕЦ) КАК ВаловыйДоходПроцентноеОтклонение,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиПлан.ВаловыйДоходПроцент = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиПрогноз.ВаловыйДоходПроцент / ПродажиПлан.ВаловыйДоходПроцент - 1) * 100
	               |		КОНЕЦ) КАК ВаловыйДоходПроцентПроцентноеОтклонение
	               |ИЗ
	               |	ПродажиПлан КАК ПродажиПлан,
	               |	ПродажиФакт КАК ПродажиФакт,
	               |	ПродажиПрогноз КАК ПродажиПрогноз";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Если ЗначениеЗаполнено(Ресторан) Тогда
		Запрос.УстановитьПараметр("Ресторан", Ресторан);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланыПродаж.Ресторан В(&Ресторан)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Ресторан В(&Ресторан)", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(Оплата) Тогда
		Запрос.УстановитьПараметр("Оплата", Оплата);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Оплата В(&Оплата)", "ИСТИНА");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидСравнения", ЦенаВидСравнения);
	Запрос.УстановитьПараметр("ЗначениеСравнения", ЦенаЗначениеСравнения);
	Запрос.УстановитьПараметр("УчитыватьКоэффициентПересчета", УчитыватьКоэффициентПересчета);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция СформироватьЗапросПланФактПоГруппе(НачалоПериода, КонецПериода, Ресторан, Оплата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДЕНЬ(КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)) КАК ПериодТекущийКоличествоДней,
	               |	РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, ДЕНЬ) КАК ПериодОтчетаКоличествоДней
	               |ПОМЕСТИТЬ Периоды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Ссылка.Ресторан,
	               |	РеализацияТоваровУслугТовары.Ссылка КАК Регистратор,
	               |	РеализацияТоваровУслугТовары.НоменклатурнаяГруппа
	               |ПОМЕСТИТЬ ПродажиПоГруппе
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Продажи.Ресторан КАК Ресторан,
	               |		Продажи.Регистратор КАК Регистратор,
	               |		КОЛИЧЕСТВО(Продажи.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа
	               |	ИЗ
	               |		РегистрНакопления.Продажи КАК Продажи
	               |	ГДЕ
	               |		Продажи.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Модификатор)
	               |		И Продажи.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |		И Продажи.Период МЕЖДУ &НачалоПериода И ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, -86400)
	               |		И Продажи.Ресторан В(&Ресторан)
	               |		И Продажи.Оплата В(&Оплата)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Продажи.Регистратор,
	               |		Продажи.Ресторан) КАК ЗапросТовары1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Продажи.Ресторан КАК Ресторан,
	               |			Продажи.Регистратор КАК Регистратор,
	               |			КОЛИЧЕСТВО(Продажи.НоменклатурнаяГруппа) КАК НоменклатурнаяГруппа
	               |		ИЗ
	               |			РегистрНакопления.Продажи КАК Продажи
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ГруппаЧайКофе КАК ГруппаЧайКофе
	               |				ПО Продажи.НоменклатурнаяГруппа = ГруппаЧайКофе.Значение
	               |		ГДЕ
	               |			Продажи.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Модификатор)
	               |			И Продажи.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |			И Продажи.Период МЕЖДУ &НачалоПериода И ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, -86400)
	               |			И Продажи.Ресторан В(&Ресторан)
	               |			И Продажи.Оплата В(&Оплата)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			Продажи.Регистратор,
	               |			Продажи.Ресторан) КАК ЗапросТовары2
	               |		ПО ЗапросТовары1.Регистратор = ЗапросТовары2.Регистратор
	               |			И ЗапросТовары1.Ресторан = ЗапросТовары2.Ресторан
	               |			И ЗапросТовары1.НоменклатурнаяГруппа = ЗапросТовары2.НоменклатурнаяГруппа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ПО ЗапросТовары1.Регистратор = РеализацияТоваровУслугТовары.Ссылка
	               |			И ЗапросТовары1.Ресторан = РеализацияТоваровУслугТовары.Ссылка.Ресторан
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Модификатор)
	               |	И РеализацияТоваровУслугТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |	И РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &НачалоПериода И ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, -86400)
	               |	И РеализацияТоваровУслугТовары.Ссылка.Ресторан В(&Ресторан)
	               |	И РеализацияТоваровУслугТовары.Ссылка.Оплата В(&Оплата)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиОбороты.Ресторан КАК Ресторан,
	               |	ПродажиОбороты.Регистратор,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций
	               |ПОМЕСТИТЬ Транзакции
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			,
	               |			,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Модификатор)
	               |				И Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |			И ПродажиОбороты.Оплата = РеализацияТоваровУслуг.Оплата
	               |ГДЕ
	               |	ПродажиОбороты.Регистратор.Дата МЕЖДУ &НачалоПериода И ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, -86400)
	               |	И ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Ресторан,
	               |	ПродажиОбороты.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(Транзакции.КоличествоТранзакций) КАК КоличествоТранзакций
	               |ПОМЕСТИТЬ ТранзакцииГруппировка
	               |ИЗ
	               |	Транзакции КАК Транзакции
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Транзакции.Ресторан,
	               |	Транзакции.Регистратор,
	               |	Транзакции.КоличествоТранзакций
	               |ПОМЕСТИТЬ ТранзакцииПоГруппе
	               |ИЗ
	               |	ПродажиПоГруппе КАК ПродажиПоГруппе
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Транзакции КАК Транзакции
	               |		ПО ПродажиПоГруппе.Ресторан = Транзакции.Ресторан
	               |			И ПродажиПоГруппе.Регистратор = Транзакции.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ТранзакцииПоГруппе.КоличествоТранзакций) КАК КоличествоТранзакций
	               |ПОМЕСТИТЬ ТранзакцииПоГруппеГруппировка
	               |ИЗ
	               |	ТранзакцииПоГруппе КАК ТранзакцииПоГруппе
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТранзакцииПоГруппеГруппировка.КоличествоТранзакций КАК КоличествоТранзакцийПоГруппе,
	               |	ТранзакцииГруппировка.КоличествоТранзакций КАК КоличествоТранзакцийВсего,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииГруппировка.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ТранзакцииПоГруппеГруппировка.КоличествоТранзакций / ТранзакцииГруппировка.КоличествоТранзакций * 100
	               |	КОНЕЦ КАК КоличествоТранзакцийПроцент
	               |ПОМЕСТИТЬ ТранзакцииПоГруппеПрогноз
	               |ИЗ
	               |	ТранзакцииГруппировка КАК ТранзакцииГруппировка,
	               |	ТранзакцииПоГруппеГруппировка КАК ТранзакцииПоГруппеГруппировка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ТранзакцииПоГруппеПрогноз.КоличествоТранзакцийПроцент / Периоды.ПериодОтчетаКоличествоДней * Периоды.ПериодТекущийКоличествоДней) КАК КоличествоТранзакцийПроцент
	               |ИЗ
	               |	Периоды КАК Периоды,
	               |	ТранзакцииПоГруппеПрогноз КАК ТранзакцииПоГруппеПрогноз";
				   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Если ЗначениеЗаполнено(Ресторан) Тогда
		Запрос.УстановитьПараметр("Ресторан", Ресторан);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Продажи.Ресторан В(&Ресторан)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Ресторан В(&Ресторан)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслугТовары.Ссылка.Ресторан В(&Ресторан)", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(Оплата) Тогда
		Запрос.УстановитьПараметр("Оплата", Оплата);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Продажи.Оплата В(&Оплата)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Оплата В(&Оплата)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслугТовары.Ссылка.Оплата В(&Оплата)", "ИСТИНА");
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция СформироватьЗапросПланФактПоГруппам(НачалоПериода, КонецПериода, Ресторан, Оплата, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДЕНЬ(КОНЕЦПЕРИОДА(&КонецПериода, МЕСЯЦ)) КАК ПериодТекущийКоличествоДней,
	               |	РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, ДЕНЬ) КАК ПериодОтчетаКоличествоДней
	               |ПОМЕСТИТЬ Периоды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПланыПродаж.Ресторан,
	               |	МАКСИМУМ(ПланыПродаж.КоличествоКлиентов) КАК КоличествоКлиентов,
	               |	МАКСИМУМ(ПланыПродаж.КоличествоКлиентовСреднее) КАК КоличествоКлиентовСреднее
	               |ПОМЕСТИТЬ ПосещенияПланРестораны
	               |ИЗ
	               |	РегистрНакопления.ПланыПродаж КАК ПланыПродаж
	               |ГДЕ
	               |	ПланыПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПланыПродаж.Ресторан В(&Ресторан)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПланыПродаж.Ресторан
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПосещенияПланРестораны.КоличествоКлиентов) КАК КоличествоКлиентов,
	               |	СРЕДНЕЕ(ПосещенияПланРестораны.КоличествоКлиентовСреднее) КАК КоличествоКлиентовСреднее
	               |ПОМЕСТИТЬ ПосещенияПлан
	               |ИЗ
	               |	ПосещенияПланРестораны КАК ПосещенияПланРестораны
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПланыПродаж.ГруппаБлюда,
	               |	СУММА(ПланыПродаж.Количество) КАК КоличествоБлюд,
	               |	СУММА(ПланыПродаж.СуммаБезСкидок) КАК СуммаБезСкидок,
	               |	СУММА(ПланыПродаж.СуммаСкидки) КАК СуммаСкидки,
	               |	СУММА(ПланыПродаж.Сумма) КАК Сумма,
	               |	СУММА(ПланыПродаж.Себестоимость) КАК Себестоимость,
	               |	СУММА(ПланыПродаж.ВаловыйДоход) КАК ВаловыйДоход
	               |ПОМЕСТИТЬ ПродажиПланОсновное
	               |ИЗ
	               |	РегистрНакопления.ПланыПродаж КАК ПланыПродаж
	               |ГДЕ
	               |	ПланыПродаж.Период МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ПланыПродаж.Ресторан В(&Ресторан)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПланыПродаж.ГруппаБлюда
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиПланОсновное.ГруппаБлюда,
	               |	ПосещенияПлан.КоличествоКлиентов,
	               |	ПосещенияПлан.КоличествоКлиентовСреднее,
	               |	ПродажиПланОсновное.КоличествоБлюд,
	               |	ПродажиПланОсновное.СуммаБезСкидок КАК СуммаБезСкидок,
	               |	ПродажиПланОсновное.СуммаСкидки КАК СуммаСкидки,
	               |	ПродажиПланОсновное.Сумма КАК Сумма,
	               |	ПродажиПланОсновное.Себестоимость КАК Себестоимость,
	               |	ПродажиПланОсновное.ВаловыйДоход КАК ВаловыйДоход,
	               |	ВЫБОР
	               |		КОГДА ПосещенияПлан.КоличествоКлиентов = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиПланОсновное.КоличествоБлюд / ПосещенияПлан.КоличествоКлиентов
	               |	КОНЕЦ КАК КЦП,
	               |	ВЫБОР
	               |		КОГДА ПродажиПланОсновное.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиПланОсновное.Сумма / ПродажиПланОсновное.КоличествоБлюд
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ПосещенияПлан.КоличествоКлиентов = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиПланОсновное.Сумма / ПосещенияПлан.КоличествоКлиентов
	               |	КОНЕЦ КАК СреднийЧек,
	               |	0 КАК СредняяТранзакция,
	               |	ВЫБОР
	               |		КОГДА ПродажиПланОсновное.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиПланОсновное.СуммаСкидки / ПродажиПланОсновное.СуммаБезСкидок * 100
	               |	КОНЕЦ КАК СкидкаПроцент,
	               |	ВЫБОР
	               |		КОГДА ПродажиПланОсновное.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиПланОсновное.Себестоимость / ПродажиПланОсновное.Сумма * 100
	               |	КОНЕЦ КАК СебестоимостьПроцент,
	               |	ВЫБОР
	               |		КОГДА ПродажиПланОсновное.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиПланОсновное.ВаловыйДоход / ПродажиПланОсновное.Сумма * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцент
	               |ПОМЕСТИТЬ ПродажиПлан
	               |ИЗ
	               |	ПродажиПланОсновное КАК ПродажиПланОсновное,
	               |	ПосещенияПлан КАК ПосещенияПлан
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	КОЛИЧЕСТВО(РеализацияТоваровУслуг.Ссылка) КАК КоличествоДокументов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций,
	               |	СУММА(РеализацияТоваровУслуг.КоличествоКлиентов) КАК КоличествоКлиентов
	               |ПОМЕСТИТЬ ТранзакцииПосещения
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПродажиОбороты.ГруппаБлюда,
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоБлюд,
	               |	СУММА(ВЫБОР
	               |			КОГДА &УчитыватьКоэффициентПересчета
	               |				ТОГДА ПродажиОбороты.КоличествоУточненноеОборот * ПродажиОбороты.Номенклатура.КоэффициентЕдиницыИзмеренияДляОтчетов
	               |			ИНАЧЕ ПродажиОбороты.КоличествоУточненноеОборот
	               |		КОНЕЦ) КАК КоличествоБлюдУточн,
	               |	СУММА(ПродажиОбороты.АкцизныйНалогОборот) КАК АкцизныйНалог,
	               |	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиОбороты.СуммаНаценкиОборот) КАК СуммаНаценки,
	               |	СУММА(ПродажиОбороты.СуммаСкидкиОборот) КАК СуммаСкидки,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	СУММА(ПродажиОбороты.КоличествоОборот * СебестоимостьНоменклатуры.Себестоимость) КАК Себестоимость
	               |ПОМЕСТИТЬ ПродажиСебестоимость
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Авто, Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры КАК СебестоимостьНоменклатуры
	               |		ПО ПродажиОбороты.Ресторан = СебестоимостьНоменклатуры.Ресторан
	               |			И ПродажиОбороты.Номенклатура = СебестоимостьНоменклатуры.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(ПродажиОбороты.ПериодМесяц, МЕСЯЦ) = СебестоимостьНоменклатуры.Период)
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.ГруппаБлюда
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиСебестоимость.ГруппаБлюда,
	               |	СУММА(ТранзакцииПосещения.КоличествоДокументов) КАК КоличествоДокументов,
	               |	СУММА(ТранзакцииПосещения.КоличествоТранзакций) КАК КоличествоТранзакций,
	               |	СУММА(ТранзакцииПосещения.КоличествоКлиентов) КАК КоличествоКлиентов,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТранзакцииПосещения.КоличествоТранзакций = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ТранзакцииПосещения.КоличествоКлиентов / ТранзакцииПосещения.КоличествоТранзакций
	               |		КОНЕЦ) КАК КоличествоКлиентовСреднее,
	               |	СУММА(ПродажиСебестоимость.КоличествоБлюд) КАК КоличествоБлюд,
	               |	СУММА(ПродажиСебестоимость.КоличествоБлюдУточн) КАК КоличествоБлюдУточн,
	               |	СУММА(ПродажиСебестоимость.АкцизныйНалог) КАК АкцизныйНалог,
	               |	СУММА(ПродажиСебестоимость.СуммаБезСкидок) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиСебестоимость.СуммаНаценки) КАК СуммаНаценки,
	               |	СУММА(ПродажиСебестоимость.СуммаСкидки) КАК СуммаСкидки,
	               |	СУММА(ПродажиСебестоимость.Сумма) КАК Сумма,
	               |	СУММА(ПродажиСебестоимость.Себестоимость) КАК Себестоимость,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТранзакцииПосещения.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.КоличествоБлюд / ТранзакцииПосещения.КоличествоКлиентов
	               |		КОНЕЦ) КАК КЦП,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТранзакцииПосещения.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.КоличествоБлюдУточн / ТранзакцииПосещения.КоличествоКлиентов
	               |		КОНЕЦ) КАК КЦПУточн,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиСебестоимость.КоличествоБлюд = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.Сумма / ПродажиСебестоимость.КоличествоБлюд
	               |		КОНЕЦ) КАК Цена,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиСебестоимость.КоличествоБлюдУточн = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.Сумма / ПродажиСебестоимость.КоличествоБлюдУточн
	               |		КОНЕЦ) КАК ЦенаУточн,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТранзакцииПосещения.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.Сумма / ТранзакцииПосещения.КоличествоКлиентов
	               |		КОНЕЦ) КАК СреднийЧек,
	               |	СУММА(ВЫБОР
	               |			КОГДА ТранзакцииПосещения.КоличествоТранзакций = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.Сумма / ТранзакцииПосещения.КоличествоТранзакций
	               |		КОНЕЦ) КАК СредняяТранзакция,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиСебестоимость.СуммаБезСкидок = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.СуммаСкидки / ПродажиСебестоимость.СуммаБезСкидок * 100
	               |		КОНЕЦ) КАК СкидкаПроцент,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиСебестоимость.Сумма = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ ПродажиСебестоимость.Себестоимость / ПродажиСебестоимость.Сумма * 100
	               |		КОНЕЦ) КАК СебестоимостьПроцент,
	               |	СУММА(ПродажиСебестоимость.Сумма - ПродажиСебестоимость.Себестоимость) КАК ВаловыйДоход,
	               |	СУММА(ВЫБОР
	               |			КОГДА ПродажиСебестоимость.Сумма = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ (ПродажиСебестоимость.Сумма - ПродажиСебестоимость.Себестоимость) / ПродажиСебестоимость.Сумма * 100
	               |		КОНЕЦ) КАК ВаловыйДоходПроцент
	               |ПОМЕСТИТЬ ПродажиФакт
	               |ИЗ
	               |	ПродажиСебестоимость КАК ПродажиСебестоимость,
	               |	ТранзакцииПосещения КАК ТранзакцииПосещения
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиСебестоимость.ГруппаБлюда
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ПродажиФакт.ГруппаБлюда, ПродажиПлан.ГруппаБлюда) КАК ГруппаБлюда,
	               |	СУММА(ПродажиПлан.КоличествоКлиентов) КАК КоличествоГостейПлан,
	               |	СУММА(ПродажиПлан.КоличествоКлиентовСреднее) КАК КоличествоГостейСреднееПлан,
	               |	СУММА(ПродажиПлан.КоличествоБлюд) КАК КоличествоБлюдПлан,
	               |	СУММА(ПродажиПлан.КЦП) КАК КЦППлан,
	               |	СУММА(ПродажиПлан.Цена) КАК ЦенаПлан,
	               |	СУММА(ПродажиПлан.СреднийЧек) КАК СреднийЧекПлан,
	               |	СУММА(ПродажиПлан.СредняяТранзакция) КАК СредняяТранзакцияПлан,
	               |	СУММА(ПродажиПлан.СуммаБезСкидок) КАК СуммаБезСкидокПлан,
	               |	СУММА(ПродажиПлан.СуммаСкидки) КАК СуммаСкидкиПлан,
	               |	СУММА(ПродажиПлан.СкидкаПроцент) КАК СкидкаПроцентПлан,
	               |	СУММА(ПродажиПлан.Сумма) КАК СуммаПлан,
	               |	СУММА(ПродажиПлан.Себестоимость) КАК СебестоимостьПлан,
	               |	СУММА(ПродажиПлан.СебестоимостьПроцент) КАК СебестоимостьПроцентПлан,
	               |	СУММА(ПродажиПлан.ВаловыйДоход) КАК ВаловыйДоходПлан,
	               |	СУММА(ПродажиПлан.ВаловыйДоходПроцент) КАК ВаловыйДоходПроцентПлан,
	               |	СУММА(ПродажиФакт.КоличествоДокументов) КАК КоличествоДокументовФакт,
	               |	СУММА(ПродажиФакт.КоличествоТранзакций) КАК КоличествоТранзакцийФакт,
	               |	СУММА(ПродажиФакт.КоличествоКлиентов) КАК КоличествоГостейФакт,
	               |	СУММА(ПродажиФакт.КоличествоБлюд) КАК КоличествоБлюдФакт,
	               |	СУММА(ПродажиФакт.КоличествоБлюдУточн) КАК КоличествоБлюдУточнФакт,
	               |	СУММА(ПродажиФакт.АкцизныйНалог) КАК АкцизныйНалогФакт,
	               |	СУММА(ПродажиФакт.СуммаБезСкидок) КАК СуммаБезСкидокФакт,
	               |	СУММА(ПродажиФакт.СуммаНаценки) КАК СуммаНаценкиФакт,
	               |	СУММА(ПродажиФакт.СуммаСкидки) КАК СуммаСкидкиФакт,
	               |	СУММА(ПродажиФакт.Сумма) КАК СуммаФакт,
	               |	СУММА(ПродажиФакт.Себестоимость) КАК СебестоимостьФакт,
	               |	СУММА(ПродажиФакт.КоличествоКлиентовСреднее) КАК КоличествоГостейСреднееФакт,
	               |	СУММА(ПродажиФакт.КЦП) КАК КЦПФакт,
	               |	СУММА(ПродажиФакт.КЦПУточн) КАК КЦПУточнФакт,
	               |	СУММА(ПродажиФакт.Цена) КАК ЦенаФакт,
	               |	СУММА(ПродажиФакт.ЦенаУточн) КАК ЦенаУточнФакт,
	               |	СУММА(ПродажиФакт.СреднийЧек) КАК СреднийЧекФакт,
	               |	СУММА(ПродажиФакт.СредняяТранзакция) КАК СредняяТранзакцияФакт,
	               |	СУММА(ПродажиФакт.СкидкаПроцент) КАК СкидкаПроцентФакт,
	               |	СУММА(ПродажиФакт.СебестоимостьПроцент) КАК СебестоимостьПроцентФакт,
	               |	СУММА(ПродажиФакт.ВаловыйДоход) КАК ВаловыйДоходФакт,
	               |	СУММА(ПродажиФакт.ВаловыйДоходПроцент) КАК ВаловыйДоходПроцентФакт
	               |ИЗ
	               |	ПродажиФакт КАК ПродажиФакт
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ПродажиПлан КАК ПродажиПлан
	               |		ПО ПродажиФакт.ГруппаБлюда = ПродажиПлан.ГруппаБлюда
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ПродажиФакт.ГруппаБлюда, ПродажиПлан.ГруппаБлюда)"; 
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	Если ЗначениеЗаполнено(Ресторан) Тогда
		Запрос.УстановитьПараметр("Ресторан", Ресторан);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланыПродаж.Ресторан В(&Ресторан)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Ресторан В(&Ресторан)", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(Оплата) Тогда
		Запрос.УстановитьПараметр("Оплата", Оплата);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Оплата В(&Оплата)", "ИСТИНА");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидСравнения", ЦенаВидСравнения);
	Запрос.УстановитьПараметр("ЗначениеСравнения", ЦенаЗначениеСравнения);
	Запрос.УстановитьПараметр("УчитыватьКоэффициентПересчета", УчитыватьКоэффициентПересчета);
	
	Возврат Запрос.Выполнить();

КонецФункции

Функция СформироватьЗапросИзменениеПоказателей(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РеализацияТоваровУслуг.Ссылка) КАК КоличествоДокументов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций,
	               |	СУММА(РеализацияТоваровУслуг.КоличествоКлиентов) КАК КоличествоГостей
	               |ПОМЕСТИТЬ ТранзакцииПосещения1
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода1,
	               |			&КонецПериода1,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |			И ПродажиОбороты.Оплата = РеализацияТоваровУслуг.Оплата
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоБлюд,
	               |	СУММА(ВЫБОР
	               |			КОГДА &УчитыватьКоэффициентПересчета
	               |				ТОГДА ПродажиОбороты.КоличествоУточненноеОборот * ПродажиОбороты.Номенклатура.КоэффициентЕдиницыИзмеренияДляОтчетов
	               |			ИНАЧЕ ПродажиОбороты.КоличествоУточненноеОборот
	               |		КОНЕЦ) КАК КоличествоБлюдУточн,
	               |	СУММА(ПродажиОбороты.АкцизныйНалогОборот) КАК АкцизныйНалог,
	               |	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиОбороты.СуммаНаценкиОборот) КАК Наценка,
	               |	СУММА(ПродажиОбороты.СуммаСкидкиОборот) КАК Скидка,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	СУММА(ПродажиОбороты.КоличествоОборот * СебестоимостьНоменклатуры.Себестоимость) КАК Себестоимость
	               |ПОМЕСТИТЬ ПродажиСебестоимость1
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода1,
	               |			&КонецПериода1,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры КАК СебестоимостьНоменклатуры
	               |		ПО ПродажиОбороты.Ресторан = СебестоимостьНоменклатуры.Ресторан
	               |			И ПродажиОбороты.Номенклатура = СебестоимостьНоменклатуры.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(ПродажиОбороты.ПериодМесяц, МЕСЯЦ) = СебестоимостьНоменклатуры.Период)
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТранзакцииПосещения1.КоличествоДокументов КАК КоличествоДокументов,
	               |	ТранзакцииПосещения1.КоличествоТранзакций КАК КоличествоТранзакций,
	               |	ТранзакцииПосещения1.КоличествоГостей КАК КоличествоГостей,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ТранзакцииПосещения1.КоличествоГостей / ТранзакцииПосещения1.КоличествоТранзакций
	               |	КОНЕЦ КАК КоличествоГостейСреднее,
	               |	ПродажиСебестоимость1.КоличествоБлюд КАК КоличествоБлюд,
	               |	ПродажиСебестоимость1.КоличествоБлюдУточн,
	               |	ПродажиСебестоимость1.АкцизныйНалог КАК АкцизныйНалог,
	               |	ПродажиСебестоимость1.СуммаБезСкидок КАК СуммаБезСкидок,
	               |	ПродажиСебестоимость1.Наценка КАК Наценка,
	               |	ПродажиСебестоимость1.Скидка КАК Скидка,
	               |	ПродажиСебестоимость1.Сумма КАК Сумма,
	               |	ПродажиСебестоимость1.Себестоимость КАК Себестоимость,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.КоличествоБлюд / ТранзакцииПосещения1.КоличествоГостей
	               |	КОНЕЦ КАК КЦП,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.КоличествоБлюдУточн / ТранзакцииПосещения1.КоличествоГостей
	               |	КОНЕЦ КАК КЦПУточн,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ПродажиСебестоимость1.КоличествоБлюд
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.КоличествоБлюдУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ПродажиСебестоимость1.КоличествоБлюдУточн
	               |	КОНЕЦ КАК ЦенаУточн,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ТранзакцииПосещения1.КоличествоГостей
	               |	КОНЕЦ КАК СреднийЧек,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ТранзакцииПосещения1.КоличествоТранзакций
	               |	КОНЕЦ КАК СредняяТранзакция,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Скидка / ПродажиСебестоимость1.СуммаБезСкидок * 100
	               |	КОНЕЦ КАК СкидкаПроцент,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Себестоимость / ПродажиСебестоимость1.Сумма * 100
	               |	КОНЕЦ КАК СебестоимостьПроцент,
	               |	ПродажиСебестоимость1.Сумма - ПродажиСебестоимость1.Себестоимость КАК ВаловыйДоход,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (ПродажиСебестоимость1.Сумма - ПродажиСебестоимость1.Себестоимость) / ПродажиСебестоимость1.Сумма * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцент
	               |ПОМЕСТИТЬ Период1
	               |ИЗ
	               |	ПродажиСебестоимость1 КАК ПродажиСебестоимость1,
	               |	ТранзакцииПосещения1 КАК ТранзакцииПосещения1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РеализацияТоваровУслуг.Ссылка) КАК КоличествоДокументов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций,
	               |	СУММА(РеализацияТоваровУслуг.КоличествоКлиентов) КАК КоличествоГостей
	               |ПОМЕСТИТЬ ТранзакцииПосещения2
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода2,
	               |			&КонецПериода2,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |			И ПродажиОбороты.Оплата = РеализацияТоваровУслуг.Оплата
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоБлюд,
	               |	СУММА(ВЫБОР
	               |			КОГДА &УчитыватьКоэффициентПересчета
	               |				ТОГДА ПродажиОбороты.КоличествоУточненноеОборот * ПродажиОбороты.Номенклатура.КоэффициентЕдиницыИзмеренияДляОтчетов
	               |			ИНАЧЕ ПродажиОбороты.КоличествоУточненноеОборот
	               |		КОНЕЦ) КАК КоличествоБлюдУточн,
	               |	СУММА(ПродажиОбороты.АкцизныйНалогОборот) КАК АкцизныйНалог,
	               |	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиОбороты.СуммаНаценкиОборот) КАК Наценка,
	               |	СУММА(ПродажиОбороты.СуммаСкидкиОборот) КАК Скидка,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	СУММА(ПродажиОбороты.КоличествоОборот * СебестоимостьНоменклатуры.Себестоимость) КАК Себестоимость
	               |ПОМЕСТИТЬ ПродажиСебестоимость2
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода2,
	               |			&КонецПериода2,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры КАК СебестоимостьНоменклатуры
	               |		ПО ПродажиОбороты.Ресторан = СебестоимостьНоменклатуры.Ресторан
	               |			И ПродажиОбороты.Номенклатура = СебестоимостьНоменклатуры.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(ПродажиОбороты.ПериодМесяц, МЕСЯЦ) = СебестоимостьНоменклатуры.Период)
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТранзакцииПосещения2.КоличествоДокументов КАК КоличествоДокументов,
	               |	ТранзакцииПосещения2.КоличествоТранзакций КАК КоличествоТранзакций,
	               |	ТранзакцииПосещения2.КоличествоГостей КАК КоличествоГостей,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ТранзакцииПосещения2.КоличествоГостей / ТранзакцииПосещения2.КоличествоТранзакций
	               |	КОНЕЦ КАК КоличествоГостейСреднее,
	               |	ПродажиСебестоимость2.КоличествоБлюд КАК КоличествоБлюд,
	               |	ПродажиСебестоимость2.КоличествоБлюдУточн,
	               |	ПродажиСебестоимость2.АкцизныйНалог КАК АкцизныйНалог,
	               |	ПродажиСебестоимость2.СуммаБезСкидок КАК СуммаБезСкидок,
	               |	ПродажиСебестоимость2.Наценка КАК Наценка,
	               |	ПродажиСебестоимость2.Скидка КАК Скидка,
	               |	ПродажиСебестоимость2.Сумма КАК Сумма,
	               |	ПродажиСебестоимость2.Себестоимость КАК Себестоимость,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.КоличествоБлюд / ТранзакцииПосещения2.КоличествоГостей
	               |	КОНЕЦ КАК КЦП,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.КоличествоБлюдУточн / ТранзакцииПосещения2.КоличествоГостей
	               |	КОНЕЦ КАК КЦПУточн,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ПродажиСебестоимость2.КоличествоБлюд
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.КоличествоБлюдУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ПродажиСебестоимость2.КоличествоБлюдУточн
	               |	КОНЕЦ КАК ЦенаУточн,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ТранзакцииПосещения2.КоличествоГостей
	               |	КОНЕЦ КАК СреднийЧек,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ТранзакцииПосещения2.КоличествоТранзакций
	               |	КОНЕЦ КАК СредняяТранзакция,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Скидка / ПродажиСебестоимость2.СуммаБезСкидок * 100
	               |	КОНЕЦ КАК СкидкаПроцент,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Себестоимость / ПродажиСебестоимость2.Сумма * 100
	               |	КОНЕЦ КАК СебестоимостьПроцент,
	               |	ПродажиСебестоимость2.Сумма - ПродажиСебестоимость2.Себестоимость КАК ВаловыйДоход,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (ПродажиСебестоимость2.Сумма - ПродажиСебестоимость2.Себестоимость) / ПродажиСебестоимость2.Сумма * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцент
	               |ПОМЕСТИТЬ Период2
	               |ИЗ
	               |	ПродажиСебестоимость2 КАК ПродажиСебестоимость2,
	               |	ТранзакцииПосещения2 КАК ТранзакцииПосещения2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Период1.КоличествоДокументов КАК КоличествоДокументов1,
	               |	Период1.КоличествоТранзакций КАК КоличествоТранзакций1,
	               |	Период1.КоличествоГостей КАК КоличествоГостей1,
	               |	Период1.КоличествоГостейСреднее КАК КоличествоГостейСреднее1,
	               |	Период1.КоличествоБлюд КАК КоличествоБлюд1,
	               |	Период1.КоличествоБлюдУточн КАК КоличествоБлюдУточн1,
	               |	Период1.АкцизныйНалог КАК АкцизныйНалог1,
	               |	Период1.СуммаБезСкидок КАК СуммаБезСкидок1,
	               |	Период1.Наценка КАК Наценка1,
	               |	Период1.Скидка КАК Скидка1,
	               |	Период1.Сумма КАК Сумма1,
	               |	Период1.Себестоимость КАК Себестоимость1,
	               |	Период1.КЦП КАК КЦП1,
	               |	Период1.КЦПУточн КАК КЦПУточн1,
	               |	Период1.Цена КАК Цена1,
	               |	Период1.ЦенаУточн КАК ЦенаУточн1,
	               |	Период1.СреднийЧек КАК СреднийЧек1,
	               |	Период1.СредняяТранзакция КАК СредняяТранзакция1,
	               |	Период1.СкидкаПроцент КАК СкидкаПроцент1,
	               |	Период1.СебестоимостьПроцент КАК СебестоимостьПроцент1,
	               |	Период1.ВаловыйДоход КАК ВаловыйДоход1,
	               |	Период1.ВаловыйДоходПроцент КАК ВаловыйДоходПроцент1,
	               |	Период2.КоличествоДокументов КАК КоличествоДокументов2,
	               |	Период2.КоличествоТранзакций КАК КоличествоТранзакций2,
	               |	Период2.КоличествоГостей КАК КоличествоГостей2,
	               |	Период2.КоличествоГостейСреднее КАК КоличествоГостейСреднее2,
	               |	Период2.КоличествоБлюд КАК КоличествоБлюд2,
	               |	Период2.КоличествоБлюдУточн КАК КоличествоБлюдУточн2,
	               |	Период2.АкцизныйНалог КАК АкцизныйНалог2,
	               |	Период2.СуммаБезСкидок КАК СуммаБезСкидок2,
	               |	Период2.Наценка КАК Наценка2,
	               |	Период2.Скидка КАК Скидка2,
	               |	Период2.Сумма КАК Сумма2,
	               |	Период2.Себестоимость КАК Себестоимость2,
	               |	Период2.КЦП КАК КЦП2,
	               |	Период2.КЦПУточн КАК КЦПУточн2,
	               |	Период2.Цена КАК Цена2,
	               |	Период2.ЦенаУточн КАК ЦенаУточн2,
	               |	Период2.СреднийЧек КАК СреднийЧек2,
	               |	Период2.СредняяТранзакция КАК СредняяТранзакция2,
	               |	Период2.СкидкаПроцент КАК СкидкаПроцент2,
	               |	Период2.СебестоимостьПроцент КАК СебестоимостьПроцент2,
	               |	Период2.ВаловыйДоход КАК ВаловыйДоход2,
	               |	Период2.ВаловыйДоходПроцент КАК ВаловыйДоходПроцент2,
	               |	Период2.КоличествоДокументов - Период1.КоличествоДокументов КАК КоличествоДокументовАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоДокументов = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоДокументов / Период1.КоличествоДокументов - 1) * 100
	               |	КОНЕЦ КАК КоличествоДокументовПроцентноеОтклонение,
	               |	Период2.КоличествоТранзакций - Период1.КоличествоТранзакций КАК КоличествоТранзакцийАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоТранзакций / Период1.КоличествоТранзакций - 1) * 100
	               |	КОНЕЦ КАК КоличествоТранзакцийПроцентноеОтклонение,
	               |	Период2.КоличествоГостей - Период1.КоличествоГостей КАК КоличествоГостейАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоГостей / Период1.КоличествоГостей - 1) * 100
	               |	КОНЕЦ КАК КоличествоГостейПроцентноеОтклонение,
	               |	Период2.КоличествоГостейСреднее - Период1.КоличествоГостейСреднее КАК КоличествоГостейСреднееАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоГостейСреднее = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоГостейСреднее / Период1.КоличествоГостейСреднее - 1) * 100
	               |	КОНЕЦ КАК КоличествоГостейСреднееПроцентноеОтклонение,
	               |	Период2.КоличествоБлюд - Период1.КоличествоБлюд КАК КоличествоБлюдАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоБлюд / Период1.КоличествоБлюд - 1) * 100
	               |	КОНЕЦ КАК КоличествоБлюдПроцентноеОтклонение,
	               |	Период2.КоличествоБлюдУточн - Период1.КоличествоБлюдУточн КАК КоличествоБлюдУточнАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоБлюдУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоБлюдУточн / Период1.КоличествоБлюдУточн - 1) * 100
	               |	КОНЕЦ КАК КоличествоБлюдУточнПроцентноеОтклонение,
	               |	Период2.СуммаБезСкидок - Период1.СуммаБезСкидок КАК СуммаБезСкидокАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СуммаБезСкидок / Период1.СуммаБезСкидок - 1) * 100
	               |	КОНЕЦ КАК СуммаБезСкидокПроцентноеОтклонение,
	               |	Период2.Скидка - Период1.Скидка КАК СкидкаАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Скидка = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Скидка / Период1.Скидка - 1) * 100
	               |	КОНЕЦ КАК СкидкаПроцентноеОтклонение,
	               |	Период2.Сумма - Период1.Сумма КАК СуммаАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Сумма / Период1.Сумма - 1) * 100
	               |	КОНЕЦ КАК СуммаПроцентноеОтклонение,
	               |	Период2.Себестоимость - Период1.Себестоимость КАК СебестоимостьАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Себестоимость = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Себестоимость / Период1.Себестоимость - 1) * 100
	               |	КОНЕЦ КАК СебестоимостьПроцентноеОтклонение,
	               |	Период2.КЦП - Период1.КЦП КАК КЦПАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КЦП = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КЦП / Период1.КЦП - 1) * 100
	               |	КОНЕЦ КАК КЦППроцентноеОтклонение,
	               |	Период2.КЦПУточн - Период1.КЦПУточн КАК КЦПУточнАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КЦПУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КЦПУточн / Период1.КЦПУточн - 1) * 100
	               |	КОНЕЦ КАК КЦПУточнПроцентноеОтклонение,
	               |	Период2.Цена - Период1.Цена КАК ЦенаАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Цена = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Цена / Период1.Цена - 1) * 100
	               |	КОНЕЦ КАК ЦенаПроцентноеОтклонение,
	               |	Период2.ЦенаУточн - Период1.ЦенаУточн КАК ЦенаУточнАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.ЦенаУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.ЦенаУточн / Период1.ЦенаУточн - 1) * 100
	               |	КОНЕЦ КАК ЦенаУточнПроцентноеОтклонение,
	               |	Период2.СреднийЧек - Период1.СреднийЧек КАК СреднийЧекАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СреднийЧек = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СреднийЧек / Период1.СреднийЧек - 1) * 100
	               |	КОНЕЦ КАК СреднийЧекПроцентноеОтклонение,
	               |	Период2.СредняяТранзакция - Период1.СредняяТранзакция КАК СредняяТранзакцияАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СредняяТранзакция = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СредняяТранзакция / Период1.СредняяТранзакция - 1) * 100
	               |	КОНЕЦ КАК СредняяТранзакцияПроцентноеОтклонение,
	               |	Период2.СкидкаПроцент - Период1.СкидкаПроцент КАК СкидкаПроцентАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СкидкаПроцент = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СкидкаПроцент / Период1.СкидкаПроцент - 1) * 100
	               |	КОНЕЦ КАК СкидкаПроцентПроцентноеОтклонение,
	               |	Период2.СебестоимостьПроцент - Период1.СебестоимостьПроцент КАК СебестоимостьПроцентАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СебестоимостьПроцент = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СебестоимостьПроцент / Период1.СебестоимостьПроцент - 1) * 100
	               |	КОНЕЦ КАК СебестоимостьПроцентПроцентноеОтклонение,
	               |	Период2.ВаловыйДоход - Период1.ВаловыйДоход КАК ВаловыйДоходАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.ВаловыйДоход = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.ВаловыйДоход / Период1.ВаловыйДоход - 1) * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцентноеОтклонение,
	               |	Период2.ВаловыйДоходПроцент - Период1.ВаловыйДоходПроцент КАК ВаловыйДоходПроцентАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.ВаловыйДоходПроцент = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.ВаловыйДоходПроцент / Период1.ВаловыйДоходПроцент - 1) * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцентПроцентноеОтклонение
	               |ИЗ
	               |	Период1 КАК Период1,
	               |	Период2 КАК Период2";
	
	Запрос.УстановитьПараметр("НачалоПериода1", НачалоПериода1);
	Запрос.УстановитьПараметр("КонецПериода1", КонецПериода1);
	Запрос.УстановитьПараметр("НачалоПериода2", НачалоПериода2);
	Запрос.УстановитьПараметр("КонецПериода2", КонецПериода2);
	
	Если ЗначениеЗаполнено(Ресторан) Тогда
		Запрос.УстановитьПараметр("Ресторан", Ресторан);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Ресторан В(&Ресторан)", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(Оплата) Тогда
		Запрос.УстановитьПараметр("Оплата", Оплата);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Оплата В(&Оплата)", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура В (&Номенклатура)", "ИСТИНА");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидСравнения", ЦенаВидСравнения);
	Запрос.УстановитьПараметр("ЗначениеСравнения", ЦенаЗначениеСравнения);
	Запрос.УстановитьПараметр("УчитыватьКоэффициентПересчета", УчитыватьКоэффициентПересчета);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция СформироватьЗапросПериодыСотрудники(НачалоПериода1, КонецПериода1, НачалоПериода2, КонецПериода2, Ресторан, Оплата, Номенклатура, ЦенаВидСравнения, ЦенаЗначениеСравнения, УчитыватьКоэффициентПересчета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажиОбороты.Сотрудник,
	               |	КОЛИЧЕСТВО(РеализацияТоваровУслуг.Ссылка) КАК КоличествоДокументов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций,
	               |	СУММА(РеализацияТоваровУслуг.КоличествоКлиентов) КАК КоличествоГостей
	               |ПОМЕСТИТЬ ТранзакцииПосещения1
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода1,
	               |			&КонецПериода1,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |			И ПродажиОбороты.Оплата = РеализацияТоваровУслуг.Оплата
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиОбороты.Сотрудник,
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоБлюд,
	               |	СУММА(ВЫБОР
	               |			КОГДА &УчитыватьКоэффициентПересчета
	               |				ТОГДА ПродажиОбороты.КоличествоУточненноеОборот * ПродажиОбороты.Номенклатура.КоэффициентЕдиницыИзмеренияДляОтчетов
	               |			ИНАЧЕ ПродажиОбороты.КоличествоУточненноеОборот
	               |		КОНЕЦ) КАК КоличествоБлюдУточн,
	               |	СУММА(ПродажиОбороты.АкцизныйНалогОборот) КАК АкцизныйНалог,
	               |	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиОбороты.СуммаНаценкиОборот) КАК Наценка,
	               |	СУММА(ПродажиОбороты.СуммаСкидкиОборот) КАК Скидка,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	СУММА(ПродажиОбороты.КоличествоОборот * СебестоимостьНоменклатуры.Себестоимость) КАК Себестоимость
	               |ПОМЕСТИТЬ ПродажиСебестоимость1
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода1,
	               |			&КонецПериода1,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры КАК СебестоимостьНоменклатуры
	               |		ПО ПродажиОбороты.Ресторан = СебестоимостьНоменклатуры.Ресторан
	               |			И ПродажиОбороты.Номенклатура = СебестоимостьНоменклатуры.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(ПродажиОбороты.ПериодМесяц, МЕСЯЦ) = СебестоимостьНоменклатуры.Период)
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТранзакцииПосещения1.Сотрудник,
	               |	ТранзакцииПосещения1.КоличествоДокументов КАК КоличествоДокументов,
	               |	ТранзакцииПосещения1.КоличествоТранзакций КАК КоличествоТранзакций,
	               |	ТранзакцииПосещения1.КоличествоГостей КАК КоличествоГостей,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ТранзакцииПосещения1.КоличествоГостей / ТранзакцииПосещения1.КоличествоТранзакций
	               |	КОНЕЦ КАК КоличествоГостейСреднее,
	               |	ПродажиСебестоимость1.КоличествоБлюд КАК КоличествоБлюд,
	               |	ПродажиСебестоимость1.КоличествоБлюдУточн,
	               |	ПродажиСебестоимость1.АкцизныйНалог КАК АкцизныйНалог,
	               |	ПродажиСебестоимость1.СуммаБезСкидок КАК СуммаБезСкидок,
	               |	ПродажиСебестоимость1.Наценка КАК Наценка,
	               |	ПродажиСебестоимость1.Скидка КАК Скидка,
	               |	ПродажиСебестоимость1.Сумма КАК Сумма,
	               |	ПродажиСебестоимость1.Себестоимость КАК Себестоимость,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.КоличествоБлюд / ТранзакцииПосещения1.КоличествоГостей
	               |	КОНЕЦ КАК КЦП,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.КоличествоБлюдУточн / ТранзакцииПосещения1.КоличествоГостей
	               |	КОНЕЦ КАК КЦПУточн,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.КоличествоБлюд / ТранзакцииПосещения1.КоличествоТранзакций
	               |	КОНЕЦ КАК КЦПТранзакция,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ПродажиСебестоимость1.КоличествоБлюд
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.КоличествоБлюдУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ПродажиСебестоимость1.КоличествоБлюдУточн
	               |	КОНЕЦ КАК ЦенаУточн,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ТранзакцииПосещения1.КоличествоГостей
	               |	КОНЕЦ КАК СреднийЧек,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения1.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Сумма / ТранзакцииПосещения1.КоличествоТранзакций
	               |	КОНЕЦ КАК СредняяТранзакция,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Скидка / ПродажиСебестоимость1.СуммаБезСкидок * 100
	               |	КОНЕЦ КАК СкидкаПроцент,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость1.Себестоимость / ПродажиСебестоимость1.Сумма * 100
	               |	КОНЕЦ КАК СебестоимостьПроцент,
	               |	ПродажиСебестоимость1.Сумма - ПродажиСебестоимость1.Себестоимость КАК ВаловыйДоход,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость1.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (ПродажиСебестоимость1.Сумма - ПродажиСебестоимость1.Себестоимость) / ПродажиСебестоимость1.Сумма * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцент
	               |ПОМЕСТИТЬ Период1
	               |ИЗ
	               |	ТранзакцииПосещения1 КАК ТранзакцииПосещения1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПродажиСебестоимость1 КАК ПродажиСебестоимость1
	               |		ПО ТранзакцииПосещения1.Сотрудник = ПродажиСебестоимость1.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиОбороты.Сотрудник,
	               |	КОЛИЧЕСТВО(РеализацияТоваровУслуг.Ссылка) КАК КоличествоДокументов,
	               |	СУММА(ВЫБОР
	               |			КОГДА РеализацияТоваровУслуг.КоличествоКлиентов = 0
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоТранзакций,
	               |	СУММА(РеализацияТоваровУслуг.КоличествоКлиентов) КАК КоличествоГостей
	               |ПОМЕСТИТЬ ТранзакцииПосещения2
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода2,
	               |			&КонецПериода2,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ПродажиОбороты.Ресторан = РеализацияТоваровУслуг.Ресторан
	               |			И ПродажиОбороты.Регистратор = РеализацияТоваровУслуг.Ссылка
	               |			И ПродажиОбороты.Оплата = РеализацияТоваровУслуг.Оплата
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиОбороты.Сотрудник,
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоБлюд,
	               |	СУММА(ВЫБОР
	               |			КОГДА &УчитыватьКоэффициентПересчета
	               |				ТОГДА ПродажиОбороты.КоличествоУточненноеОборот * ПродажиОбороты.Номенклатура.КоэффициентЕдиницыИзмеренияДляОтчетов
	               |			ИНАЧЕ ПродажиОбороты.КоличествоУточненноеОборот
	               |		КОНЕЦ) КАК КоличествоБлюдУточн,
	               |	СУММА(ПродажиОбороты.АкцизныйНалогОборот) КАК АкцизныйНалог,
	               |	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот) КАК СуммаБезСкидок,
	               |	СУММА(ПродажиОбороты.СуммаНаценкиОборот) КАК Наценка,
	               |	СУММА(ПродажиОбороты.СуммаСкидкиОборот) КАК Скидка,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	СУММА(ПродажиОбороты.КоличествоОборот * СебестоимостьНоменклатуры.Себестоимость) КАК Себестоимость
	               |ПОМЕСТИТЬ ПродажиСебестоимость2
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(
	               |			&НачалоПериода2,
	               |			&КонецПериода2,
	               |			Авто,
	               |			Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Условие)
	               |				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СебестоимостьНоменклатуры КАК СебестоимостьНоменклатуры
	               |		ПО ПродажиОбороты.Ресторан = СебестоимостьНоменклатуры.Ресторан
	               |			И ПродажиОбороты.Номенклатура = СебестоимостьНоменклатуры.Номенклатура
	               |			И (НАЧАЛОПЕРИОДА(ПродажиОбороты.ПериодМесяц, МЕСЯЦ) = СебестоимостьНоменклатуры.Период)
	               |ГДЕ
	               |	ПродажиОбороты.Ресторан В(&Ресторан)
	               |	И ПродажиОбороты.Оплата В(&Оплата)
	               |	И ВЫБОР
	               |			КОГДА ПродажиОбороты.КоличествоОборот <> 0
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Равно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот = &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.НеРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <> &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Меньше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот < &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.МеньшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот <= &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.Больше)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот > &ЗначениеСравнения
	               |						КОГДА &ВидСравнения = ЗНАЧЕНИЕ(Перечисление.ВидыСравнения.БольшеИлиРавно)
	               |							ТОГДА ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот >= &ЗначениеСравнения
	               |					КОНЕЦ
	               |		КОНЕЦ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТранзакцииПосещения2.Сотрудник,
	               |	ТранзакцииПосещения2.КоличествоДокументов КАК КоличествоДокументов,
	               |	ТранзакцииПосещения2.КоличествоТранзакций КАК КоличествоТранзакций,
	               |	ТранзакцииПосещения2.КоличествоГостей КАК КоличествоГостей,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ТранзакцииПосещения2.КоличествоГостей / ТранзакцииПосещения2.КоличествоТранзакций
	               |	КОНЕЦ КАК КоличествоГостейСреднее,
	               |	ПродажиСебестоимость2.КоличествоБлюд КАК КоличествоБлюд,
	               |	ПродажиСебестоимость2.КоличествоБлюдУточн,
	               |	ПродажиСебестоимость2.АкцизныйНалог КАК АкцизныйНалог,
	               |	ПродажиСебестоимость2.СуммаБезСкидок КАК СуммаБезСкидок,
	               |	ПродажиСебестоимость2.Наценка КАК Наценка,
	               |	ПродажиСебестоимость2.Скидка КАК Скидка,
	               |	ПродажиСебестоимость2.Сумма КАК Сумма,
	               |	ПродажиСебестоимость2.Себестоимость КАК Себестоимость,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.КоличествоБлюд / ТранзакцииПосещения2.КоличествоГостей
	               |	КОНЕЦ КАК КЦП,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.КоличествоБлюдУточн / ТранзакцииПосещения2.КоличествоГостей
	               |	КОНЕЦ КАК КЦПУточн,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.КоличествоБлюд / ТранзакцииПосещения2.КоличествоТранзакций
	               |	КОНЕЦ КАК КЦПТранзакция,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ПродажиСебестоимость2.КоличествоБлюд
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.КоличествоБлюдУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ПродажиСебестоимость2.КоличествоБлюдУточн
	               |	КОНЕЦ КАК ЦенаУточн,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ТранзакцииПосещения2.КоличествоГостей
	               |	КОНЕЦ КАК СреднийЧек,
	               |	ВЫБОР
	               |		КОГДА ТранзакцииПосещения2.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Сумма / ТранзакцииПосещения2.КоличествоТранзакций
	               |	КОНЕЦ КАК СредняяТранзакция,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Скидка / ПродажиСебестоимость2.СуммаБезСкидок * 100
	               |	КОНЕЦ КАК СкидкаПроцент,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ ПродажиСебестоимость2.Себестоимость / ПродажиСебестоимость2.Сумма * 100
	               |	КОНЕЦ КАК СебестоимостьПроцент,
	               |	ПродажиСебестоимость2.Сумма - ПродажиСебестоимость2.Себестоимость КАК ВаловыйДоход,
	               |	ВЫБОР
	               |		КОГДА ПродажиСебестоимость2.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (ПродажиСебестоимость2.Сумма - ПродажиСебестоимость2.Себестоимость) / ПродажиСебестоимость2.Сумма * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцент
	               |ПОМЕСТИТЬ Период2
	               |ИЗ
	               |	ТранзакцииПосещения2 КАК ТранзакцииПосещения2
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПродажиСебестоимость2 КАК ПродажиСебестоимость2
	               |		ПО ТранзакцииПосещения2.Сотрудник = ПродажиСебестоимость2.Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(Период1.Сотрудник, Период2.Сотрудник) КАК Сотрудник,
	               |	Период1.КоличествоДокументов КАК КоличествоДокументов1,
	               |	Период1.КоличествоТранзакций КАК КоличествоТранзакций1,
	               |	Период1.КоличествоГостей КАК КоличествоГостей1,
	               |	Период1.КоличествоГостейСреднее КАК КоличествоГостейСреднее1,
	               |	Период1.КоличествоБлюд КАК КоличествоБлюд1,
	               |	Период1.КоличествоБлюдУточн КАК КоличествоБлюдУточн1,
	               |	Период1.АкцизныйНалог КАК АкцизныйНалог1,
	               |	Период1.СуммаБезСкидок КАК СуммаБезСкидок1,
	               |	Период1.Наценка КАК Наценка1,
	               |	Период1.Скидка КАК Скидка1,
	               |	Период1.Сумма КАК Сумма1,
	               |	Период1.Себестоимость КАК Себестоимость1,
	               |	Период1.КЦП КАК КЦП1,
	               |	Период1.КЦПУточн КАК КЦПУточн1,
	               |	Период1.КЦПТранзакция КАК КЦПТранзакция1,
	               |	Период1.Цена КАК Цена1,
	               |	Период1.ЦенаУточн КАК ЦенаУточн1,
	               |	Период1.СреднийЧек КАК СреднийЧек1,
	               |	Период1.СредняяТранзакция КАК СредняяТранзакция1,
	               |	Период1.СкидкаПроцент КАК СкидкаПроцент1,
	               |	Период1.СебестоимостьПроцент КАК СебестоимостьПроцент1,
	               |	Период1.ВаловыйДоход КАК ВаловыйДоход1,
	               |	Период1.ВаловыйДоходПроцент КАК ВаловыйДоходПроцент1,
	               |	Период2.КоличествоДокументов КАК КоличествоДокументов2,
	               |	Период2.КоличествоТранзакций КАК КоличествоТранзакций2,
	               |	Период2.КоличествоГостей КАК КоличествоГостей2,
	               |	Период2.КоличествоГостейСреднее КАК КоличествоГостейСреднее2,
	               |	Период2.КоличествоБлюд КАК КоличествоБлюд2,
	               |	Период2.КоличествоБлюдУточн КАК КоличествоБлюдУточн2,
	               |	Период2.АкцизныйНалог КАК АкцизныйНалог2,
	               |	Период2.СуммаБезСкидок КАК СуммаБезСкидок2,
	               |	Период2.Наценка КАК Наценка2,
	               |	Период2.Скидка КАК Скидка2,
	               |	Период2.Сумма КАК Сумма2,
	               |	Период2.Себестоимость КАК Себестоимость2,
	               |	Период2.КЦП КАК КЦП2,
	               |	Период2.КЦПУточн КАК КЦПУточн2,
	               |	Период2.КЦПТранзакция КАК КЦПТранзакция2,
	               |	Период2.Цена КАК Цена2,
	               |	Период2.ЦенаУточн КАК ЦенаУточн2,
	               |	Период2.СреднийЧек КАК СреднийЧек2,
	               |	Период2.СредняяТранзакция КАК СредняяТранзакция2,
	               |	Период2.СкидкаПроцент КАК СкидкаПроцент2,
	               |	Период2.СебестоимостьПроцент КАК СебестоимостьПроцент2,
	               |	Период2.ВаловыйДоход КАК ВаловыйДоход2,
	               |	Период2.ВаловыйДоходПроцент КАК ВаловыйДоходПроцент2,
	               |	Период2.КоличествоДокументов - Период1.КоличествоДокументов КАК КоличествоДокументовАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоДокументов = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоДокументов / Период1.КоличествоДокументов - 1) * 100
	               |	КОНЕЦ КАК КоличествоДокументовПроцентноеОтклонение,
	               |	Период2.КоличествоТранзакций - Период1.КоличествоТранзакций КАК КоличествоТранзакцийАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоТранзакций = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоТранзакций / Период1.КоличествоТранзакций - 1) * 100
	               |	КОНЕЦ КАК КоличествоТранзакцийПроцентноеОтклонение,
	               |	Период2.КоличествоГостей - Период1.КоличествоГостей КАК КоличествоГостейАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоГостей = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоГостей / Период1.КоличествоГостей - 1) * 100
	               |	КОНЕЦ КАК КоличествоГостейПроцентноеОтклонение,
	               |	Период2.КоличествоГостейСреднее - Период1.КоличествоГостейСреднее КАК КоличествоГостейСреднееАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоГостейСреднее = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоГостейСреднее / Период1.КоличествоГостейСреднее - 1) * 100
	               |	КОНЕЦ КАК КоличествоГостейСреднееПроцентноеОтклонение,
	               |	Период2.КоличествоБлюд - Период1.КоличествоБлюд КАК КоличествоБлюдАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоБлюд = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоБлюд / Период1.КоличествоБлюд - 1) * 100
	               |	КОНЕЦ КАК КоличествоБлюдПроцентноеОтклонение,
	               |	Период2.КоличествоБлюдУточн - Период1.КоличествоБлюдУточн КАК КоличествоБлюдУточнАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КоличествоБлюдУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КоличествоБлюдУточн / Период1.КоличествоБлюдУточн - 1) * 100
	               |	КОНЕЦ КАК КоличествоБлюдУточнПроцентноеОтклонение,
	               |	Период2.СуммаБезСкидок - Период1.СуммаБезСкидок КАК СуммаБезСкидокАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СуммаБезСкидок = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СуммаБезСкидок / Период1.СуммаБезСкидок - 1) * 100
	               |	КОНЕЦ КАК СуммаБезСкидокПроцентноеОтклонение,
	               |	Период2.Скидка - Период1.Скидка КАК СкидкаАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Скидка = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Скидка / Период1.Скидка - 1) * 100
	               |	КОНЕЦ КАК СкидкаПроцентноеОтклонение,
	               |	Период2.Сумма - Период1.Сумма КАК СуммаАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Сумма = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Сумма / Период1.Сумма - 1) * 100
	               |	КОНЕЦ КАК СуммаПроцентноеОтклонение,
	               |	Период2.Себестоимость - Период1.Себестоимость КАК СебестоимостьАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Себестоимость = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Себестоимость / Период1.Себестоимость - 1) * 100
	               |	КОНЕЦ КАК СебестоимостьПроцентноеОтклонение,
	               |	Период2.КЦП - Период1.КЦП КАК КЦПАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КЦП = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КЦП / Период1.КЦП - 1) * 100
	               |	КОНЕЦ КАК КЦППроцентноеОтклонение,
	               |	Период2.КЦПУточн - Период1.КЦПУточн КАК КЦПУточнАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.КЦПУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.КЦПУточн / Период1.КЦПУточн - 1) * 100
	               |	КОНЕЦ КАК КЦПУточнПроцентноеОтклонение,
	               |	Период2.Цена - Период1.Цена КАК ЦенаАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.Цена = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.Цена / Период1.Цена - 1) * 100
	               |	КОНЕЦ КАК ЦенаПроцентноеОтклонение,
	               |	Период2.ЦенаУточн - Период1.ЦенаУточн КАК ЦенаУточнАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.ЦенаУточн = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.ЦенаУточн / Период1.ЦенаУточн - 1) * 100
	               |	КОНЕЦ КАК ЦенаУточнПроцентноеОтклонение,
	               |	Период2.СреднийЧек - Период1.СреднийЧек КАК СреднийЧекАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СреднийЧек = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СреднийЧек / Период1.СреднийЧек - 1) * 100
	               |	КОНЕЦ КАК СреднийЧекПроцентноеОтклонение,
	               |	Период2.СредняяТранзакция - Период1.СредняяТранзакция КАК СредняяТранзакцияАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СредняяТранзакция = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СредняяТранзакция / Период1.СредняяТранзакция - 1) * 100
	               |	КОНЕЦ КАК СредняяТранзакцияПроцентноеОтклонение,
	               |	Период2.СкидкаПроцент - Период1.СкидкаПроцент КАК СкидкаПроцентАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СкидкаПроцент = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СкидкаПроцент / Период1.СкидкаПроцент - 1) * 100
	               |	КОНЕЦ КАК СкидкаПроцентПроцентноеОтклонение,
	               |	Период2.СебестоимостьПроцент - Период1.СебестоимостьПроцент КАК СебестоимостьПроцентАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.СебестоимостьПроцент = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.СебестоимостьПроцент / Период1.СебестоимостьПроцент - 1) * 100
	               |	КОНЕЦ КАК СебестоимостьПроцентПроцентноеОтклонение,
	               |	Период2.ВаловыйДоход - Период1.ВаловыйДоход КАК ВаловыйДоходАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.ВаловыйДоход = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.ВаловыйДоход / Период1.ВаловыйДоход - 1) * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцентноеОтклонение,
	               |	Период2.ВаловыйДоходПроцент - Период1.ВаловыйДоходПроцент КАК ВаловыйДоходПроцентАбсолютноеОтклонение,
	               |	ВЫБОР
	               |		КОГДА Период1.ВаловыйДоходПроцент = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ (Период2.ВаловыйДоходПроцент / Период1.ВаловыйДоходПроцент - 1) * 100
	               |	КОНЕЦ КАК ВаловыйДоходПроцентПроцентноеОтклонение
	               |ИЗ
	               |	Период1 КАК Период1
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Период2 КАК Период2
	               |		ПО Период1.Сотрудник = Период2.Сотрудник";
				   
	Запрос.УстановитьПараметр("НачалоПериода1", НачалоПериода1);
	Запрос.УстановитьПараметр("КонецПериода1", КонецПериода1);
	Запрос.УстановитьПараметр("НачалоПериода2", НачалоПериода2);
	Запрос.УстановитьПараметр("КонецПериода2", КонецПериода2);
	
	Если ЗначениеЗаполнено(Ресторан) Тогда
		Запрос.УстановитьПараметр("Ресторан", Ресторан);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Ресторан В(&Ресторан)", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(Оплата) Тогда
		Запрос.УстановитьПараметр("Оплата", Оплата);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиОбороты.Оплата В(&Оплата)", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура В (&Номенклатура)", "ИСТИНА");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидСравнения", ЦенаВидСравнения);
	Запрос.УстановитьПараметр("ЗначениеСравнения", ЦенаЗначениеСравнения);
	Запрос.УстановитьПараметр("УчитыватьКоэффициентПересчета", УчитыватьКоэффициентПересчета);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ФорматированнаяСтрока(Значение1, Значение2)
	Возврат Строка(Формат(Значение1, "ДФ=dd.MM.yyyy")) + Символы.ПС + Строка(Формат(Значение2, "ДФ=dd.MM.yyyy"));
КонецФункции

Процедура Фиксация(ТабличныйДокумент, ФиксацияСверху = 1, ФиксацияСлева = 1)
	ТабличныйДокумент.ФиксацияСверху = ФиксацияСверху;
	ТабличныйДокумент.ФиксацияСлева = ФиксацияСлева;
КонецПроцедуры
