
# Если Клиент Тогда

// Функция выбора даты с помощью календаря.
//
// Параметры:
//	ВыбираемаяДата - Дата. Значения до выбора;
//	Подсказка - Строка. Текст сообщения отображаемого в заголовке окна.
//
// Возвращаемое значение:
//	Булево. Истина - если был осуществлен выбор даты;
//  ВыбираемаяДата - Дата. Выбранная дата.
//
Функция ВыбратьДату(ВыбираемаяДата, Подсказка = "") Экспорт
	
	Дата = ВыбираемаяДата; 
	
	// Открываем форму выбора.
	Форма = ЭтотОбъект.ПолучитьФорму("Форма");
	Если Не ПустаяСтрока(Подсказка) Тогда
		Форма.Заголовок = Подсказка;
	КонецЕсли;
	
	// Выбор значения.
	ПараметрЗакрытия = Форма.ОткрытьМодально();
	Если (ТипЗнч(ПараметрЗакрытия) = Тип("Булево")) Тогда
		ВыбираемаяДата = Дата;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ВыбратьДату()

#КонецЕсли
