
Функция ПолучитьРежимЗаписиДокумента(ДокументОбъект, РежимЗаписи = Неопределено) Экспорт
	
	// Основной реквизит.
	Структура = Новый Структура("Оплачен", Неопределено);
	ЗаполнитьЗначенияСвойств(Структура, ДокументОбъект);
	Если (Структура.Оплачен = Неопределено) Тогда
		Реквизит = "Распечатан";
	Иначе
		Реквизит = "Оплачен";
	КонецЕсли; 
	
	// Режим записи.
	Если ДокументОбъект[Реквизит] Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	Иначе
		Если ДокументОбъект.Проведен Тогда
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
		Иначе
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
	КонецЕсли;

	Возврат РежимЗаписи;
	
КонецФункции // ПолучитьРежимЗаписиДокумента()
