
#Если Клиент Тогда

// Функция установки отметок переданного списка значений.
//
// Параметры:
//	Значение - СписокЗначений. Список значений пометки которого необходимо установить;
//	Подсказка - Строка. Заголовок диалога;
//	ЗапретОтменыОтметкиВсех - Булево. Признак запрета отмены отметки всех элементов списка.
//
// Возвращаемое значение:
//	Булево. Истина, если выбор был осущетсвлен;
//	Значение - СписокЗначений. Копия оригинального списка значений с установленными пометками.
//
Функция ВыбратьОтметкиСписка(Значение, Подсказка = "", ЗапретОтменыОтметкиВсех = Ложь) Экспорт
	
	// Форма выбора.
	Форма = ПолучитьФорму("ВыборОтметокСписка");
	Форма.СписокЗначений = Значение.Скопировать();
	Если Не ПустаяСтрока(Подсказка) Тогда
		Форма.Заголовок = Подсказка;
	КонецЕсли;
	Форма.ЗапретОтменыОтметкиВсех = ЗапретОтменыОтметкиВсех;
	
	// Выбор.
	Результат = Форма.ОткрытьМодально();
	Если (Результат = Истина) Тогда
	    Значение = Форма.СписокЗначений.Скопировать();
		Возврат Истина;
	КонецЕсли; 
	
	// Результат.
	Возврат Ложь;

КонецФункции // ВыбратьОтметкиСписка()

#КонецЕсли
