
&НаКлиенте
Процедура СообщениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	// Перенаправление.
	СообщениеАвтоПодборСервер(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры // СообщениеАвтоПодбор()

&НаСервере
Процедура СообщениеАвтоПодборСервер(Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	// Выборка данных.
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 51
	                      |	__СообщенияПользователей.Сообщение КАК Сообщение
	                      |ИЗ
	                      |	РегистрСведений.__СообщенияПользователей КАК __СообщенияПользователей
	                      |ГДЕ
	                      |	__СообщенияПользователей.Сообщение ПОДОБНО &Сообщение
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Сообщение");
	Запрос.УстановитьПараметр("Сообщение", Текст + "%");
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		СтандартнаяОбработка = Ложь; ДанныеВыбора = Новый СписокЗначений;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Сообщение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // СообщениеАвтоПодборСервер()

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	
	// Перенаправление.
	ДокументПриИзмененииСервер();
	
КонецПроцедуры // ДокументПриИзменении()

&НаСервере
Процедура ДокументПриИзмененииСервер()

	// Получатель.
	Запись.Получатель = Запись.Документ.Сотрудник;
	
КонецПроцедуры // ДокументПриИзмененииСервер()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Настройка формы.
	Элементы.Получено.Видимость = Не Запись.Получено;
	Элементы.Прочитано.Видимость = Запись.Получено;
	
КонецПроцедуры // ПриСозданииНаСервере()
