
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Настройка формы.	
	Если Параметры.Свойство("Отбор") Тогда
		Если (__ПолучитьСвойство(Параметры.Отбор, "ТипКарты") = Перечисления.ТипыИнформационныхКарт.Дисконтная) Тогда
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Дисконтные карты'; uk = 'Дисконтні картки'");
		КонецЕсли; 
		Если (__ПолучитьСвойство(Параметры.Отбор, "ТипКарты") = Перечисления.ТипыИнформационныхКарт.Регистрационная) Тогда
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Регистрационные карты'; uk = 'Реєстраційні картки'");
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()
