
Функция НастройкаИмяПользователя(НРег = Истина) Экспорт
	
	// Имя пользователя сервера печати.
	Если НРег Тогда
		Возврат "server";
	КонецЕсли;
	
	Возврат "Server";

КонецФункции // РежимЗапускаПриложенияСерверПечати()


Функция РежимЗапускаПриложенияСерверПечати() Экспорт
	
	// Проверка.
	Если (НРег(ИмяПользователя()) = НастройкаИмяПользователя()) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции // РежимЗапускаПриложенияСерверПечати()


Процедура ПередНачаломРаботыСистемы(Отказ) Экспорт
	
	// Перед началом работы.
	__СерверПечатиСервер.ПередНачаломРаботыСистемы(Отказ);

КонецПроцедуры // ПередНачаломРаботыСистемы()

Процедура ПриНачалеРаботыСистемы() Экспорт
	
	// Режим запуска.
	АвтоматическийРежим = (НРег(ПараметрЗапуска) = "auto");
	
	// Начало работы.
	__СерверПечатиСервер.ПриНачалеРаботыСистемы(АвтоматическийРежим);
	
	// Заголовок.
	УстановитьЗаголовокПриложения(НСтр("ru = 'Сервер печати'; uk = 'Сервер друку'"));

КонецПроцедуры // ПередНачаломРаботыСистемы()

Процедура ПередЗавершениемРаботыСистемы(Отказ) Экспорт
	
	// Подтверждение.
	Результат = Вопрос(НСтр("ru = 'Завершить работу сервера печати?'; uk = 'Завершити роботу сервера друку?'"), РежимДиалогаВопрос.ДаНет, 15);

	Отказ = (Не Результат = КодВозвратаДиалога.Да);							 
							 
КонецПроцедуры // ПередЗавершениемРаботыСистемы()

Процедура ПриЗавершенииРаботыСистемы() Экспорт
	
	// Завершение работы.
	__СерверПечатиСервер.ПриЗавершенииРаботыСистемы();

КонецПроцедуры // ПриЗавершенииРаботыСистемы()


Процедура Напечатать() Экспорт
	
	// Полчение данных.
	МассивЗаданий = __СерверПечатиСервер.ПолучитьЗадания();

	// Печать.
	Для Каждого Задание Из МассивЗаданий Цикл Задание.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать); КонецЦикла;
	
КонецПроцедуры // ВыполнитьЗадания()

