
// ПРИМЕЧАНИЕ: Реквизит "ПериодДействия" распространяется так же и на группу, хотя не имеет для нее смысла.
//			   Используется для упрощения алгоритма наследования реквизитов.

Функция ОсновнойВидМеню() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                      |	ВидыМеню.Ссылка
	                      |ИЗ
	                      |	(ВЫБРАТЬ ПЕРВЫЕ 1
	                      |		ВидыМеню.Ссылка КАК Ссылка,
	                      |		ВидыМеню.Ранг КАК Ранг
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			Меню.Владелец КАК Ссылка,
	                      |			КОЛИЧЕСТВО(Меню.Ссылка) КАК Ранг
	                      |		ИЗ
	                      |			Справочник.Меню КАК Меню
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			Меню.Владелец) КАК ВидыМеню
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ ПЕРВЫЕ 1
	                      |		ВидыМеню.Ссылка,
	                      |		-1
	                      |	ИЗ
	                      |		Справочник.ВидыМеню КАК ВидыМеню
	                      |	
	                      |	УПОРЯДОЧИТЬ ПО
	                      |		Ранг УБЫВ,
	                      |		Ссылка) КАК ВидыМеню
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВидыМеню.Ранг УБЫВ,
	                      |	ВидыМеню.Ссылка.ПометкаУдаления,
	                      |	ВидыМеню.Ссылка.Наименование");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ВидыМеню.ПустаяСсылка();

КонецФункции // ОсновнаяСтрана()

Функция КоличествоВидовМенюБолееОдного() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВидыМеню.Ссылка) КАК Количество
	                      |ИЗ
	                      |	Справочник.ВидыМеню КАК ВидыМеню");
						  
	Возврат (Запрос.Выполнить().Выгрузить()[0].Количество > 1);

КонецФункции // КоличествоСтранБолееОдной()
