
// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка заполнения реквизитов.
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.Модуль) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРесурсеРегистра(ЭтотОбъект, "Модуль", Отказ);
		КонецЕсли;
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.Ресторан) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРесурсеРегистра(ЭтотОбъект, "Ресторан", Отказ);
		КонецЕсли;
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.Дата) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРеквизитеРегистра(ЭтотОбъект, "Дата", Отказ);
		КонецЕсли;
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.Номер) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРеквизитеРегистра(ЭтотОбъект, "Номер", Отказ);
		КонецЕсли;
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.Состояние) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРеквизитеРегистра(ЭтотОбъект, "Состояние", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
	Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
