
// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка заполнения реквизитов.
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.СортировкаДата) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРеквизитеРегистра(ЭтотОбъект, "СортировкаДата", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
	Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
