
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не ЭтоГруппа Тогда
		
		// ЗначениеУсловия, ЗначениеУсловияДополнительное.
		Если Не Справочники.ТипыСкидокНаценок.ОипсаниеТипаЗначенияУсловия(ЭтотОбъект).Типы().Количество() Тогда
			__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, , "ЗначениеУсловия");
		КонецЕсли; 
		Если Не Справочники.ТипыСкидокНаценок.ОипсаниеТипаЗначенияУсловияДополнительное(ЭтотОбъект).Типы().Количество() Тогда
			__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, , "ЗначениеУсловияДополнительное");
		КонецЕсли; 
	
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Нормализация.
	Если Не ЭтоГруппа Тогда	
		
		Условие = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Условие, ПредопределенноеЗначение("Перечисление.УсловияСкидкиНаценки.РучнаяСкидка"));
		Уточняемая = Уточняемая И Справочники.ТипыСкидокНаценок.ДоступностьУточняемости(ЭтотОбъект);
		ВытесняющаяСкидка = ВытесняющаяСкидка И Справочники.ТипыСкидокНаценок.ДоступностьВытесняющейСкидки(ЭтотОбъект);
	
		ЗначениеУсловия = Справочники.ТипыСкидокНаценок.ОипсаниеТипаЗначенияУсловия(ЭтотОбъект).ПривестиЗначение(ЗначениеУсловия);
		ЗначениеУсловияДополнительное = Справочники.ТипыСкидокНаценок.ОипсаниеТипаЗначенияУсловияДополнительное(ЭтотОбъект).ПривестиЗначение(ЗначениеУсловияДополнительное);
		Если (Условие = Перечисления.УсловияСкидкиНаценки.ПоДнюРождения) Тогда
			ЗначениеУсловия = Макс(ЗначениеУсловия, 1);
			ЗначениеУсловияДополнительное = Макс(ЗначениеУсловияДополнительное, 1);
		КонецЕсли;
		
		//Костенюк Александр-Старт 05.10.2012
		Если (НЕ Условие = Перечисления.УсловияСкидкиНаценки.БезУсловий) И
			(НЕ Условие = Перечисления.УсловияСкидкиНаценки.РучнаяСкидка) Тогда
			НеРаспространяетсяНаДепозитнуюКарту = Ложь;
		КонецЕсли;
		//Костенюк Александр-Финиш 05.10.2012
		
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
