//// ПРЕДОПРЕДЕЛЕННЫЕ ПРОЦЕДУРЫ СОБЫТИЙ

//Стандартные процедуры и функции
//Параметры
//ИнтервалПериод - если истина тогда активна вкладка период
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ИнтервалДатаНачало		= Параметры.ДатаНачала;
	ИнтервалДатаЗавершение	= Параметры.ДатаОкончания;

	ЗаполнитьНачальноеЗначениеПериодов();
	РасположениеПереключателей = ОпределениеПредставлениеПериода(Параметры.ДатаНачала, Параметры.ДатаОкончания);
	
	Если Параметры.ИнтервалПериод тогда
		Элементы.ВыборПериода.ТекущаяСтраница = Элементы.Период;
		НастройкаПериод = РасположениеПереключателей[1];
		ЗаполнениеЭлементовЗначениями();
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры //ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//присвоим первоначальные значения для интервала
	Если Элементы.ВыборПериода.ТекущаяСтраница.Имя="Период" тогда
		ОбновитьДоступностьПереключателей();		
	КонецЕсли;
	
	ОбновлениеВидимости();
КонецПроцедуры //ПриОткрытии()

&НаКлиенте
Процедура ПриЗакрытии()
	ВыбранныеПараметры = Новый Структура;
	ВыбранныеПараметры.Вставить("ДатаНачала", 	 ИнтервалДатаНачало);
	ВыбранныеПараметры.Вставить("ДатаОкончания", ИнтервалДатаЗавершение);
	
	Оповестить("ПериодИзменен", ВыбранныеПараметры, ЭтаФорма);
КонецПроцедуры //ПриЗакрытии()

//// РАБОТА С ФОРМОЙ

&НаКлиенте
Процедура ОбновитьДоступностьПереключателей()	
		
	Элементы.ГодПериод			.Доступность = ?(НастройкаПериод = 0, Не РабочийПериод, Ложь);
	Элементы.КварталПериод		.Доступность = ?(НастройкаПериод = 1, Не РабочийПериод, Ложь);
	Элементы.МесяцПериод		.Доступность = ?(НастройкаПериод = 2, Не РабочийПериод, Ложь);
	Элементы.ДеньПериод			.Доступность = ?(НастройкаПериод = 3, Не РабочийПериод, Ложь);
	
	Элементы.ПериодНачало		.Доступность = ?(НастройкаПериод = 4, Истина, Ложь);
	Элементы.ПериодЗавершение	.Доступность = ?(НастройкаПериод = 4, Истина, Ложь);
	
	Элементы.РабочийПериод		.Доступность = ?(НастройкаПериод = 4, Ложь, Истина);
	Элементы.СНачалаГода		.Доступность = ?(НастройкаПериод = 4, Ложь, Истина);
	Элементы.СНачалаКвартала	.Доступность = ?(НастройкаПериод = 4, Ложь, Истина);
	Элементы.СНачалаМесяца		.Доступность = ?(НастройкаПериод = 4, Ложь, Истина);
		
КонецПроцедуры	

&НаКлиенте
Процедура ОбновлениеВидимости()
	Элементы.ИнтервалДатаНачало.Доступность 	= ИнтервалНачало > 5;
	Элементы.ИнтервалДатаЗавершение.Доступность = ИнтервалЗавершение > 5;
	
	Элементы.ГодПериод		.Доступность	= НЕ РабочийПериод;
	Элементы.КварталПериод	.Доступность	= НЕ РабочийПериод;
	Элементы.МесяцПериод	.Доступность	= НЕ РабочийПериод;
	Элементы.ДеньПериод		.Доступность	= НЕ РабочийПериод;
	
	ОбновитьПредставлениеПериода();
	ОбновитьДоступностьПереключателей();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставлениеПериода()
	ОбновитьЗначениеИнтервала();
	Элементы.НадписьПериод.Заголовок="Установлен период: " + ПериодПрописью(ИнтервалДатаНачало, ИнтервалДатаЗавершение);
КонецПроцедуры

&НаСервере
Функция ПериодПрописью(ДатаНачала, ДатаОкончания)
	Если ДатаНачала > ДатаОкончания Тогда
		Возврат "---";
	КонецЕсли;
	
	Если ДатаОкончания = Дата("00010101") тогда
		Возврат ПредставлениеПериода(НачалоДня(ДатаНачала), ДатаОкончания, "ФП=Истина");
	Иначе
		Возврат ПредставлениеПериода(НачалоДня(ДатаНачала), КонецДня(ДатаОкончания), "ФП=Истина");
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбновитьСодержаниеЭлементов(ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "Интервал" тогда
		ИнтервалНачало		= 6;
		ИнтервалЗавершение	= 6;
		ОбработкаДанныхПереключателяИнтервалЗавершение();
		ОбработкаДанныхПереключателяИнтервалНачало();
	Иначе
		Если ИнтервалНачало=1 и ИнтервалЗавершение=1 тогда
		ИначеЕсли ИнтервалНачало=2 и ИнтервалЗавершение=2 тогда
		ИначеЕсли ИнтервалНачало=3 и ИнтервалЗавершение=3 тогда
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры		

&НаСервере
Функция ОпределениеПредставлениеПериода(ДатаНачала, ДатаОкончания)
	Если ДатаНачала=НачалоГода(ДатаНачала) 
		и ДатаОкончания=КонецГода(ДатаОкончания) тогда
		Массив=Новый Массив;
		Массив.Добавить(1);
		Массив.Добавить(0);
		Возврат Массив;
	ИначеЕсли ДатаНачала=НачалоКвартала(ДатаНачала) 
		и ДатаОкончания=КонецКвартала(ДатаОкончания) тогда
		Массив=Новый Массив;
		Массив.Добавить(2);
		Массив.Добавить(1);
		Возврат Массив;
	ИначеЕсли ДатаНачала=НачалоМесяца(ДатаНачала) 
		и ДатаОкончания=КонецМесяца(ДатаОкончания) тогда
		Массив=Новый Массив;
		Массив.Добавить(3);
		Массив.Добавить(2);
		Возврат Массив;
	ИначеЕсли ДатаНачала=НачалоНедели(ДатаНачала) 
		и ДатаОкончания=КонецНедели(ДатаОкончания) тогда
		Массив=Новый Массив;
		Массив.Добавить(4);
		Массив.Добавить(3);
		Возврат Массив;
	ИначеЕсли ДатаНачала=НачалоДня(ДатаНачала) 
		и ДатаОкончания=КонецДня(ДатаОкончания) тогда
		Массив=Новый Массив;
		Массив.Добавить(5);
		Массив.Добавить(4);
		Возврат Массив;
	Иначе
		Массив=Новый Массив;
		Массив.Добавить(6);
		Массив.Добавить(5);
		Возврат Массив;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции	

&НаСервере
Процедура ЗаполнениеЭлементовЗначениями()
	ГодПериод	  = ПериодПрописью(НачалоГода(ИнтервалДатаЗавершение),	   КонецГода(ИнтервалДатаЗавершение));
	КварталПериод = ПериодПрописью(НачалоКвартала(ИнтервалДатаЗавершение), КонецКвартала(ИнтервалДатаЗавершение));
	МесяцПериод	  = ПериодПрописью(НачалоМесяца(ИнтервалДатаЗавершение),   КонецМесяца(ИнтервалДатаЗавершение));
	ДеньПериод	  = ДеньДатаНачала;
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьЗначениеИнтервала()
	Если НастройкаПериод = 0 Тогда //Год
				
		ИнтервалДатаНачало     = ГодДатаНачала;
		ИнтервалДатаЗавершение = ГодДатаОкончания;		
		ГодПериод = ПериодПрописью(ИнтервалДатаНачало, ИнтервалДатаЗавершение);
		
	ИначеЕсли НастройкаПериод = 1 Тогда //Квартал
		
		ИнтервалДатаНачало	   = КварталДатаНачала;
		ИнтервалДатаЗавершение = КварталДатаОкончания;
		КварталПериод = ПериодПрописью(ИнтервалДатаНачало, ИнтервалДатаЗавершение);
		
	ИначеЕсли НастройкаПериод = 2 Тогда //Месяц
				
		ИнтервалДатаНачало	   = МесяцДатаНачала;
		ИнтервалДатаЗавершение = МесяцДатаОкончания;
		МесяцПериод = ПериодПрописью(ИнтервалДатаНачало, ИнтервалДатаЗавершение);
		
	ИначеЕсли НастройкаПериод = 3 Тогда //День

		ИнтервалДатаНачало	   = ДеньДатаНачала;
		ИнтервалДатаЗавершение = КонецДня(ДеньДатаНачала);
		
	КонецЕсли;
	
	Если НастройкаПериод <> 4 Тогда //все кроме произвольного		
		
		Если СНачалаГода Тогда
			ИнтервалДатаНачало = НачалоГода(ИнтервалДатаНачало);
		ИначеЕсли СНачалаКвартала Тогда
			ИнтервалДатаНачало = НачалоКвартала(ИнтервалДатаНачало);
		ИначеЕсли СНачалаМесяца Тогда
			ИнтервалДатаНачало = НачалоМесяца(ИнтервалДатаНачало);
		КонецЕсли;
		
		ПериодНачало      = ИнтервалДатаНачало;
		ПериодЗавершение  = ИнтервалДатаЗавершение;
	КонецЕсли;			
	
КонецПроцедуры //ОбновитьЗначениеИнтервала()

&НаСервере
Процедура УправлениеЗначениямиПриРегулировании(Направление = Неопределено)
	Если НастройкаПериод = 0 Тогда
		
		ГодДатаНачала	 = НачалоГода(ДобавитьМесяц(ГодДатаНачала,    12*Направление));
		ГодДатаОкончания = КонецГода (ДобавитьМесяц(ГодДатаОкончания, 12*Направление));
		
	ИначеЕсли НастройкаПериод = 1 Тогда
		
		КварталДатаНачала    = НачалоКвартала(ДобавитьМесяц(КварталДатаНачала, 	  3*Направление));
		КварталДатаОкончания = КонецКвартала (ДобавитьМесяц(КварталДатаОкончания, 3*Направление));
		
	ИначеЕсли НастройкаПериод = 2 Тогда
		
		МесяцДатаНачала 	= НачалоМесяца(ДобавитьМесяц(МесяцДатаНачала,	 1*Направление));
		МесяцДатаОкончания  = КонецМесяца( ДобавитьМесяц(МесяцДатаОкончания, 1*Направление));
		
	ИначеЕсли НастройкаПериод = 3 Тогда
		
		ДеньДатаНачала = ДеньПериод;
		
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаДанныхПереключателяИнтервалЗавершение()
	ИнтервалДатаЗавершение = ТекущаяДата();
	
	Если ИнтервалЗавершение = 0 Тогда
		ИнтервалДатаЗавершение = Дата("00010101");
	ИначеЕсли ИнтервалЗавершение = 1 Тогда
		ИнтервалДатаЗавершение = КонецГода(ИнтервалДатаЗавершение);
	ИначеЕсли ИнтервалЗавершение = 2 Тогда
		ИнтервалДатаЗавершение = КонецКвартала(ИнтервалДатаЗавершение);
	ИначеЕсли ИнтервалЗавершение = 3 Тогда
		ИнтервалДатаЗавершение = КонецМесяца(ИнтервалДатаЗавершение);
	ИначеЕсли ИнтервалЗавершение = 4 Тогда
		ИнтервалДатаЗавершение = КонецНедели(ИнтервалДатаЗавершение);
	ИначеЕсли ИнтервалЗавершение = 5 Тогда
		ИнтервалДатаЗавершение = КонецДня(ИнтервалДатаЗавершение);
	КонецЕсли;	
	
	ОбновлениеВидимости();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДанныхПереключателяИнтервалНачало()
	ИнтервалДатаНачало = ТекущаяДата();
	
	Если ИнтервалНачало = 0 Тогда
		ИнтервалДатаНачало = Дата("00010101");
	ИначеЕсли ИнтервалНачало = 1 Тогда
		ИнтервалДатаНачало = НачалоГода(ИнтервалДатаНачало);
	ИначеЕсли ИнтервалНачало = 2 Тогда
		ИнтервалДатаНачало = НачалоКвартала(ИнтервалДатаНачало);
	ИначеЕсли ИнтервалНачало = 3 Тогда
		ИнтервалДатаНачало = НачалоМесяца(ИнтервалДатаНачало);
	ИначеЕсли ИнтервалНачало = 4 Тогда
		ИнтервалДатаНачало = НачалоНедели(ИнтервалДатаНачало);
	ИначеЕсли ИнтервалНачало = 5 Тогда
		ИнтервалДатаНачало = НачалоДня(ИнтервалДатаНачало);
	КонецЕсли;	
	
	ОбновлениеВидимости();
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалНачалоПриИзменении(Элемент)
	ОбработкаДанныхПереключателяИнтервалНачало();
	ОбновитьПредставлениеПериода();
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалЗавершениеПриИзменении(Элемент)
	ОбработкаДанныхПереключателяИнтервалЗавершение();
	ОбновитьПредставлениеПериода();
КонецПроцедуры

&НаКлиенте
Процедура РабочийПериодПриИзменении(Элемент)
	ЗаполнитьНачальноеЗначениеПериодов();
	ЗаполнениеЭлементовЗначениями();
	ОбновитьПредставлениеПериода();
	ОбновлениеВидимости();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодПриИзменении(Элемент)
	ОбновитьДоступностьПереключателей();
	ОбновитьПредставлениеПериода();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОбновитьСодержаниеЭлементов(ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ГодПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	
	НастройкаПериод = 0;
	
	УправлениеЗначениямиПриРегулировании(Направление);
	ОбновитьПредставлениеПериода();	
	
КонецПроцедуры	

&НаКлиенте
Процедура КварталПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	
	НастройкаПериод = 1;
	УправлениеЗначениямиПриРегулировании(Направление);	
	ОбновитьПредставлениеПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	
	НастройкаПериод = 2;
	УправлениеЗначениямиПриРегулировании(Направление);	
	ОбновитьПредставлениеПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеньПериодПриИзменении(Элемент)
	НастройкаПериод = 3;	
	УправлениеЗначениямиПриРегулировании();
	ОбновитьПредставлениеПериода();
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоПриИзменении(Элемент)
	ОбновитьПредставлениеПериода();
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗавершениеПриИзменении(Элемент)
	ОбновитьПредставлениеПериода();
КонецПроцедуры

&НаКлиенте
Процедура СНачалаГодаПриИзменении(Элемент)
	Если СНачалаГода Тогда
		СНачалаКвартала = Ложь;
		СНачалаМесяца   = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СНачалаКварталаПриИзменении(Элемент)
	Если СНачалаКвартала Тогда
		СНачалаГода   = Ложь;
		СНачалаМесяца = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СНачалаМесяцаПриИзменении(Элемент)
	Если СНачалаМесяца Тогда
		СНачалаГода     = Ложь;
		СНачалаКвартала = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачальноеЗначениеПериодов()
	Если РабочийПериод Тогда
		ИнтервалДатаНачало		= ТекущаяДата();
		ИнтервалДатаЗавершение	= ТекущаяДата();
	КонецЕсли;
	
	Если ИнтервалДатаНачало = Дата("00010101") Тогда
		ИнтервалДатаНачало = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	Если ИнтервалДатаЗавершение = Дата("00010101") Тогда
		ИнтервалДатаЗавершение = ТекущаяДата();
	КонецЕсли;
	
	ГодДатаНачала		 = НачалоГода(ИнтервалДатаНачало);
	ГодДатаОкончания 	 = КонецГода(ИнтервалДатаНачало);
	
	КварталДатаНачала    = НачалоКвартала(ИнтервалДатаНачало);
	КварталДатаОкончания = КонецКвартала(ИнтервалДатаНачало);
	
	МесяцДатаНачала		 = НачалоМесяца(ИнтервалДатаНачало);
	МесяцДатаОкончания 	 = КонецМесяца(ИнтервалДатаНачало);
	
	ДеньДатаНачала		 = ИнтервалДатаНачало;

КонецПроцедуры
