
&НаКлиенте
Процедура УстановитьВидимость()
	
	// Элементы.
	Элементы.ГруппаПараметрыНоменклатуры.Видимость = ПараметрыНоменклатуры;
	Если ПараметрыНоменклатуры Тогда
		Элементы.ПараметрыНоменклатуры.Заголовок = НСтр("ru = 'Скрыть параметры товаров'; uk = 'Приховати параметри товарів'");
	Иначе
		Элементы.ПараметрыНоменклатуры.Заголовок = НСтр("ru = 'Показать параметры товаров'; uk = 'Показати параметри товарів'");
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ПараметрыНоменклатуры(Команда)
	
	ПараметрыНоменклатуры = Не ПараметрыНоменклатуры;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПараметрыНоменклатуры()


&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры // ОрганизацияОчистка()

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	
	ТипНоменклатурыПриИзмененииСервер();

КонецПроцедуры  // ТипНоменклатурыПриИзменении()

&НаСервере
Процедура ТипНоменклатурыПриИзмененииСервер()
	
	// Единица измерения по умолчанию.
	Если (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар) Или 
		 (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга) Или
		 (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор) Или
		 (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Комплект) Или
		 (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Депозит) Тогда
		Объект.БазоваяЕдиницаИзмерения = Константы.ЕдиницаИзмеренияШтучк.Получить();
	ИначеЕсли (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Блюдо) Или
		 (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Модификатор) Или
		 (Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Условие) Тогда
		Объект.БазоваяЕдиницаИзмерения = Константы.ЕдиницаИзмеренияПорций.Получить();
	КонецЕсли;
	
КонецПроцедуры  // ТипНоменклатурыПриИзмененииСервер()


&НаКлиенте
Процедура ПравилаПринадлежностиПринадлежностьПриИзменении(Элемент)

	// Принадлежность.
	__РаботаСДаннымиКлиентСервер.ИзменитьПравилаПринадлежностиПодчиненных(Элемент, ПравилаПринадлежности);
	
КонецПроцедуры // ПравилаПринадлежностиПринадлежностьПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Принадлежность.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// Принадлежность.
	__РаботаСДаннымиКлиентСервер.ПолучитьПравилаПринадлежности(ТекущийОбъект, "Номенклатура", "НоменклатурнаяГруппа", ПравилаПринадлежности);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Принадлежность.
	__РаботаСДаннымиКлиентСервер.УстановитьПравилаПринадлежности(ТекущийОбъект, "Номенклатура", "НоменклатурнаяГруппа", ПравилаПринадлежности, Отказ);
	
КонецПроцедуры // ПриЗаписиНаСервере()


