
&НаКлиенте
Процедура ВладелецПриАктивизацииСтроки(Элемент)
	
	__РаботаСДиалогамиКлиентСервер.ВладелецСпискаПриИзменении(Список, Элементы.Владелец);
	
КонецПроцедуры // ВладельцыПриАктивизацииСтроки()

&НаКлиенте
Процедура ВладелецВладелецПриИзменении(Элемент)
	
	__РаботаСДиалогамиКлиентСервер.ВладелецСпискаПриИзменении(Владелец, ВладелецВладелец);
	
КонецПроцедуры // ВладелецВладелецПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Владелец.
	__РаботаСДиалогамиКлиентСервер.ВладелецСпискаПриСоздании(Список, Элементы.Владелец);
	
	// Владелец.Владелец.
	ВладелецВладелец = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(ПолучитьСвойство(Элементы.Владелец.ТекущаяСтрока, "Владелец"), Справочники.КлассификаторСтранМира.ОсновнаяСтрана());
	__РаботаСДиалогамиКлиентСервер.УстановитьВладелецаСписка(Владелец, ВладелецВладелец);
	Элементы.Владелец.ТекущаяСтрока = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Элементы.Владелец.ТекущаяСтрока, Справочники.КлассификаторГородов.ОсновнойГород());
	
	// Режим выбора.
	__РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список);
	
КонецПроцедуры // ПриСозданииНаСервере()
