
&НаСервере
Функция УстановитьВыбор(Тип, Метаданные, Префикс)
	
	Возврат "КОГДА РегистрСведенийНастройкиПравДоступаОтчетов.ОбъектДоступа = """ + Тип + "." + Метаданные.Имя + """ ТОГДА """ +  Префикс + " «" + СтрЗаменить(Метаданные.Синоним, """", """""") + "»""";
	
КонецФункции // УстановитьВыбор()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТестВыбора = "ВЫБОР";
	Для Каждого ЭлементМетаданных Из Метаданные.Отчеты Цикл
		ТестВыбора = ТестВыбора + Символы.ПС + УстановитьВыбор("Отчет", ЭлементМетаданных, НСтр("ru = 'Отчет'; uk = 'Звіт'"));
	КонецЦикла; 
	Для Каждого ЭлементМетаданных Из Метаданные.Обработки Цикл
		ТестВыбора = ТестВыбора + Символы.ПС + УстановитьВыбор("Обработка", ЭлементМетаданных, НСтр("ru = 'Обработка'; uk = 'Обробка'"));
	КонецЦикла; 
	ТестВыбора = ТестВыбора + Символы.ПС + "ИНАЧЕ """ + НСтр("ru = 'Неопределено'; uk = 'Невизначено'") + """ КОНЕЦ";
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "&Объект", ТестВыбора);
	
	Список.Параметры.УстановитьЗначениеПараметра("Пользователи", Метаданные.Справочники.Пользователи.Синоним);
	Список.Параметры.УстановитьЗначениеПараметра("ГруппыПользователей", Метаданные.Справочники.ГруппыПользователей.Синоним);
	Список.Параметры.УстановитьЗначениеПараметра("Неопределено", НСтр("ru = 'Неопределено'; uk = 'Невизначено'"));
	
КонецПроцедуры // ПриСозданииНаСервере()
