
Функция ОсновнаяПричинаОтказа() Экспорт
	
	// СОВМЕСТИОСЬ: Выбирвать из настроек.
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                      |	ПричиныОтказов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ПричиныОтказов КАК ПричиныОтказов
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПричиныОтказов.ПометкаУдаления
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Рестораны.ПустаяСсылка();

КонецФункции // ОсновнаяПричинаОтказа()


Функция ПолучитьПричиныОтказов() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ПричиныОтказов.Ссылка
	                      |ИЗ
	                      |	Справочник.ПричиныОтказов КАК ПричиныОтказов
	                      |ГДЕ
	                      |	НЕ ПричиныОтказов.ПометкаУдаления
	                      |АВТОУПОРЯДОЧИВАНИЕ");
						  
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");						  

КонецФункции // ПолучитьПричиныОтказов()
