
&НаКлиентеНаСервереБезКонтекста
Функция ПривестиНаименованиеСокращенное(Наименование)

	Возврат Лев(Наименование, 15);

КонецФункции // ПривестиНаименованиеСокращенное()


&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеСформировать(ФормироватьСокращенноеНаименованиеАвтоматически, Объект.НаименованиеСокращенное, ПривестиНаименованиеСокращенное(Объект.Наименование), Элементы.НаименованиеСокращенное);
	
КонецПроцедуры // НаименованиеПриИзменении()

&НаКлиенте
Процедура НаименованиеСокращенноеПриИзменении(Элемент)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеУстановитьПризнак(ФормироватьСокращенноеНаименованиеАвтоматически, Объект.НаименованиеСокращенное, ПривестиНаименованиеСокращенное(Объект.Наименование), Элементы.НаименованиеСокращенное);
	
КонецПроцедуры // НаименованиеСокращенноеПриИзменении()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Автоматическое формирование наименования.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеУстановитьПризнак(ФормироватьСокращенноеНаименованиеАвтоматически, Объект.НаименованиеСокращенное, ПривестиНаименованиеСокращенное(Объект.Наименование), Элементы.НаименованиеСокращенное);
	
КонецПроцедуры // ПриЧтенииНаСервере()
