
Функция ПолучитьПредставлние(Идентификатор, Ненайденное = Ложь) Экспорт
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Ненайденное = Ложь; Возврат Строка(Неопределено);
	КонецЕсли; 
	
	Запись = РегистрыСведений.ТорговоеОборудование.Получить(Новый Структура("Идентификатор", Идентификатор));
	
	Если Не ЗначениеЗаполнено(Запись.Компьютер) Тогда
		Ненайденное = Истина; Возврат НСтр("ru = 'Не найден'; uk = 'Не знайдено'");
	КонецЕсли; 
	
	Ненайденное = Ложь; Возврат Строка(Запись.Модель);
	
КонецФункции // ПолучитьПредставлние()