
// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка заполнения реквизитов.
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Не ЗначениеЗаполнено(Запись.Идентификатор) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРесурсеРегистра(ЭтотОбъект, "Идентификатор", Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.Модель) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРесурсеРегистра(ЭтотОбъект, "Модель", Отказ);
		КонецЕсли;
		//Это поле не обязательное
		//Если Не ЗначениеЗаполнено(Запись.Параметры) Тогда
		//	ОбщегоНазначения.СообщитьОбНезаполненомРесурсеРегистра(ЭтотОбъект, "Параметры", Отказ);
		//КонецЕсли;
		Если Не ЗначениеЗаполнено(Запись.Компьютер) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРесурсеРегистра(ЭтотОбъект, "Компьютер", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			 Возврат;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ПередЗаписью()
