
Функция НастройкаИмяПользователя(НРег = Истина) Экспорт
	
	// Имя пользователя сервера печати.
	Если НРег Тогда
		Возврат "server";
	КонецЕсли;
	
	Возврат "Server";

КонецФункции // РежимЗапускаПриложенияСерверПечати()


Функция РежимЗапускаПриложенияСерверПечати() Экспорт
	
	// Проверка.
	Если (НРег(ИмяПользователя()) = НастройкаИмяПользователя()) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции // РежимЗапускаПриложенияСерверПечати()


Процедура ПередНачаломРаботыСистемы(Отказ) Экспорт
	
	// Проврека.
	Отказ = Отказ Или (Не РегистрыСведений.__СостояниеСервераПечати.ПолучитьВозможностьЗапускаСервера());
			
КонецПроцедуры // ПередНачаломРаботыСистемы()

Процедура ПриНачалеРаботыСистемы(АвтоматическийРежим = Неопределено) Экспорт
	
	// Начало работы.
	РегистрыСведений.__СостояниеСервераПечати.УстановитьСостояниеНачалаРаботы(АвтоматическийРежим);

КонецПроцедуры // ПередНачаломРаботыСистемы()

Процедура ПриЗавершенииРаботыСистемы() Экспорт
	
	// Завершение работы.
	РегистрыСведений.__СостояниеСервераПечати.УстановитьСостояниеЗавершенияРаботы();

КонецПроцедуры // ПриЗавершенииРаботыСистемы()


Процедура ЗапускКлиентаСервера() Экспорт
	
	// Запуск сервера печати.
	Если Булево(НайтиФайлы(КаталогПрограммы() + "1cv8c.exe").Количество()) Тогда
		Параметры = "ENTERPRISE /IBConnectionString" + Char(034) + СтрЗаменить(СтрокаСоединенияИнформационнойБазы(), Char(034), Char(034) + Char(034)) + Char(034);
		Параметры = Параметры + Char(032) + "/N" + Char(034) + НастройкаИмяПользователя() + Char(034) + Char(032) + "/P" + Char(034) + РегистрыСведений.__НастройкиВебСервиса.ПолучитьПарольПользователяСервераПечати() + Char(034);
		Параметры = Параметры + " /WA- /AU- /DisableStartupMessages /Cauto";
		ЗапуститьПриложение(КаталогПрограммы() + "1cv8c.exe" + Char(032) + Параметры);
	КонецЕсли;
	
КонецПроцедуры  // ЗапускКлиентаСервера()

Процедура РегламентноеЗаданиеСервер() Экспорт
	
	// Сервер печати.
	Если (Не РегистрыСведений.__СостояниеСервераПечати.ПолучитьАктивностьСервера()) И
		 (Не РегистрыСведений.__СостояниеСервераПечати.ПолучитьПриостановленностьСервера()) Тогда
		ЗапускКлиентаСервера();
	КонецЕсли;

	// Веб-сервис.
	РегистрыСведений.__СостояниеСеансовВебСервиса.ОчиститьСеансы();
	
	// Сервер печати.
	РегистрыСведений.__СостояниеЗаданийСервераПечати.ОчиститьЗадания();
	
КонецПроцедуры  // СерверПечати()


Процедура Напечатать(ТабличныйДокумент, Вид = Неопределено) Экспорт 
	
	// Запись задания.
	РегистрыСведений.__СостояниеЗаданийСервераПечати.Напечатать(ТабличныйДокумент, Вид);
	
КонецПроцедуры // Напечатать()


Функция ПолучитьЗадания() Экспорт 
	
	// Результат.
	Возврат РегистрыСведений.__СостояниеЗаданийСервераПечати.ПолучитьЗадания();
	
КонецФункции // ПолучитьЗадания()


