
// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение автозаполняемых реквизитов.
	МассивКассовыхДат = Новый Массив;
	Для Каждого Запись Из ЭтотОбъект Цикл
		МассивКассовыхДат.Добавить(Запись.КассоваяДата);
	КонецЦикла;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	КассовыеДаты.КассоваяДата,
	                      |	КассовыеДаты.Дата
	                      |ИЗ
	                      |	РегистрСведений.КассовыеДаты КАК КассовыеДаты
	                      |ГДЕ
	                      |	КассовыеДаты.КассоваяДата В(&КассовыеДаты)");
	Запрос.УстановитьПараметр("КассовыеДаты", МассивКассовыхДат);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Выборка.НайтиСледующий(Запись.КассоваяДата, "КассоваяДата") Тогда
			Запись.ГраницаЗапретаИзменений = Выборка.Дата;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.ГраницаЗапретаИзменений) Тогда
			Запись.ГраницаЗапретаИзменений = ТекущаяДата();
		КонецЕсли;
		
		Если Отказ Тогда
			 Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
