
&НаСервере
Функция ПолучитьЦветНаСервере(Цвет)
	
	Возврат ЦветаСтиля[Цвет];
	
КонецФункции // ПолучитьЦветНаСервере()


&НаКлиенте
Процедура СхемаЦветТекстаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СхемаЦветТекста = ПолучитьЦветНаСервере("ЦветТекстаПоля");
	
	ПриИзменении(Неопределено);
	
КонецПроцедуры // СхемаЦветТекстаОчистка()

&НаКлиенте
Процедура СхемаЦветФонаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СхемаЦветФона = ПолучитьЦветНаСервере("ЦветФонаПоля");
	
	ПриИзменении(Неопределено);
	
КонецПроцедуры // СхемаЦветФонаОчистка()

&НаКлиенте
Процедура СхемаЦветРамкиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СхемаЦветРамки = ПолучитьЦветНаСервере("ЦветРамки");
	
	ПриИзменении(Неопределено);
	
КонецПроцедуры // СхемаЦветРамкиОчистка()

&НаКлиенте
Процедура СписокЦветТекстаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокЦветТекста = ПолучитьЦветНаСервере("ЦветТекстаПоля");
	
	ПриИзменении(Неопределено);
	
КонецПроцедуры // СписокЦветТекстаОчистка()

&НаКлиенте
Процедура СписокЦветФонаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокЦветФона = ПолучитьЦветНаСервере("ЦветФонаПоля");
	
	ПриИзменении(Неопределено);
	
КонецПроцедуры // СписокЦветФонаОчистка()

&НаКлиенте
Процедура ПримерПриИзменении(Элемент)
	
	Пример = НСтр("ru = 'Пример'; uk = 'Приклад'");
	
КонецПроцедуры // ПримерПриИзменении()

&НаКлиенте
Процедура ПриИзменении(Элемент)
	
	// Настройка формы.
	Элементы.СхемаПример.ЦветТекста = СхемаЦветТекста;
	Элементы.СхемаПример.ЦветРамки = СхемаЦветРамки;
	Элементы.СхемаПример.ЦветФона = СхемаЦветФона;
	
	Элементы.СписокПример.ЦветТекста = СписокЦветТекста;
	Элементы.СписокПример.ЦветФона = СписокЦветФона;
	
КонецПроцедуры // ПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пример = НСтр("ru = 'Пример'; uk = 'Приклад'");
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Не ЗначениеЗаполнено(Запись.Состояние);
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СостояниеЗаказовПокупателей = (ТипЗнч(ТекущийОбъект.Состояние) = Тип("ПеречислениеСсылка.СостояниеЗаказовПокупателей"));	
	СостояниеСтолов = (ТипЗнч(ТекущийОбъект.Состояние) = Тип("ПеречислениеСсылка.СостояниеСтолов"));	
	
	СхемаЦветТекста = ПолучитьЦветНаСервере("ЦветТекстаПоля");
	СхемаЦветФона = ПолучитьЦветНаСервере("ЦветФонаПоля");
	СхемаЦветРамки = ПолучитьЦветНаСервере("ЦветРамки");
	
	СписокЦветТекста = ПолучитьЦветНаСервере("ЦветТекстаПоля");
	СписокЦветФона = ПолучитьЦветНаСервере("ЦветФонаПоля");
	
	
	Структура = ТекущийОбъект.Стиль.Получить();
	Если (Структура = Неопределено) Тогда
		Структура = Новый Структура;
	КонецЕсли;
	
	Если Структура.Свойство("СхемаЦветТекста") Тогда СхемаЦветТекста = Структура.СхемаЦветТекста; КонецЕсли;
	Если Структура.Свойство("СхемаЦветФона") Тогда СхемаЦветФона = Структура.СхемаЦветФона; КонецЕсли;
	Если Структура.Свойство("СхемаЦветРамки") Тогда СхемаЦветРамки = Структура.СхемаЦветРамки; КонецЕсли;
		
	Если Структура.Свойство("СписокЦветТекста") Тогда СписокЦветТекста = Структура.СписокЦветТекста; КонецЕсли;
	Если Структура.Свойство("СписокЦветФона") Тогда СписокЦветФона = Структура.СписокЦветФона; КонецЕсли;
	

	// Настройка формы.
	Элементы.СхемаПример.ЦветТекста = СхемаЦветТекста;
	Элементы.СхемаПример.ЦветРамки = СхемаЦветРамки;
	Элементы.СхемаПример.ЦветФона = СхемаЦветФона;
	
	Элементы.СписокПример.ЦветТекста = СписокЦветТекста;
	Элементы.СписокПример.ЦветФона = СписокЦветФона;
	
	Элементы.СхемаЦветТекста.Доступность = СостояниеЗаказовПокупателей;
	Элементы.СхемаЦветФона.Доступность = СостояниеСтолов;
	Элементы.СхемаЦветРамки.Доступность = СостояниеСтолов;
	Элементы.ГруппаСписок.Доступность = СостояниеЗаказовПокупателей;
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Структура = Новый Структура;
	
	Структура.Вставить("СхемаЦветТекста", СхемаЦветТекста);
	Структура.Вставить("СхемаЦветФона", СхемаЦветФона);
	Структура.Вставить("СхемаЦветРамки", СхемаЦветРамки);
	
	Структура.Вставить("СписокЦветТекста", СписокЦветТекста);
	Структура.Вставить("СписокЦветФона", СписокЦветФона);
	
	ТекущийОбъект.Стиль = Новый ХранилищеЗначения(Структура);

КонецПроцедуры // ПередЗаписьюНаСервере()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	__УправлениеДаннымиКлиент.ОповеститьИзменениеСтиля();

КонецПроцедуры // ПослеЗаписи()
