
Функция ПолучитьМаксимальноеКоличествоЭлементов() Экспорт

	Возврат Цел(Метаданные.Справочники.КомбинацииАналитическихГрупп.Реквизиты.Поиск.Тип.КвалификаторыСтроки.Длина / 2); 
	
КонецФункции // ПолучитьМаксимальноеКоличествоЭлементов()

Функция ПроверитьМаксимальноеКоличествоЭлементов() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	МаксимальноеКоличество = ПолучитьМаксимальноеКоличествоЭлементов();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АналитическиеГруппы.Ссылка) КАК Количество
	                      |ИЗ
	                      |	Справочник.АналитическиеГруппы КАК АналитическиеГруппы");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = (Выборка.Количество < МаксимальноеКоличество);
	Иначе
		Результат = Истина;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Результат;
	
КонецФункции // ПроверитьМаксимальноеКоличествоЭлементов()
