

&НаКлиенте
Процедура ЮрЛицоПриИзменении(Элемент)
	
	// Юр. лицо.
	Если ЮрЛицо Тогда
		Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо");
	Иначе
		Объект.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо");
	КонецЕсли; 
	
КонецПроцедуры // ЮрЛицоПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Данные.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли; 
	
	ОбработкаОповещенияСервер();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Юр. лицо.
	ЮрЛицо = (ТекущийОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если __УправлениеДаннымиКлиентСервер.ОповещениеИзмененияЧерногоБелогоСписка(ИмяСобытия) Тогда
		ОбработкаОповещенияСервер();
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаОповещения()

&НаСервере
Процедура ОбработкаОповещенияСервер()

	ЧерныйСписок = РегистрыСведений.ЧерныйСписокКонтрагентов.ПолучитьОписаниеВхожденияКонтрагента(Объект.Ссылка);
	
	ЧерныйСписокПериод = ЧерныйСписок.Период;
	ЧерныйСписокКомментарий = ЧерныйСписок.Комментарий;
	
	Элементы.ГруппаЧерныйСписок.Видимость = ЧерныйСписок.Актуальность;
	Элементы.Разделитель.Видимость = Не ЧерныйСписок.Актуальность;
	
КонецПроцедуры // ОбработкаОповещенияСервер()

// TODO: 
//	1. Контактная информация;
//	3. Нименования.