
&НаКлиенте
Процедура УстановитьДоступность()
	
	// Элементы.
	Элементы.МаксимальноеКоличествоКлиентов.Доступность = Объект.КоличествоКлиентов;
	
КонецПроцедуры // УстановитьДоступность()


&НаКлиенте
Процедура КоличествоКлиентовПриИзменении(Элемент)
	
	// Натройка формы.
	УстановитьДоступность();

КонецПроцедуры // КоличествоКлиентовПриИзменении()


&НаКлиенте
Процедура ПравилаПринадлежностиПринадлежностьПриИзменении(Элемент)

	// Принадлежность.
	__РаботаСДаннымиКлиентСервер.ИзменитьПравилаПринадлежностиПодчиненных(Элемент, ПравилаПринадлежности);
	
КонецПроцедуры // ПравилаПринадлежностиПринадлежностьПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Принадлежность.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Натройка формы.
	УстановитьДоступность();

КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// Принадлежность.
	__РаботаСДаннымиКлиентСервер.ПолучитьПравилаПринадлежности(ТекущийОбъект, "Столы", "ТипСтола", ПравилаПринадлежности);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Принадлежность.
	__РаботаСДаннымиКлиентСервер.УстановитьПравилаПринадлежности(ТекущийОбъект, "Столы", "ТипСтола", ПравилаПринадлежности, Отказ);
	
КонецПроцедуры // ПриЗаписиНаСервере()
