
&НаКлиенте
Процедура УстановитьВидимость()
	
	// Командная панель.
	Элементы.ПодробныйРежим.Пометка = ПодробныйРежим;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ПодробныйРежим(Команда)
	
	ПодробныйРежим = Не ПодробныйРежим;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПодробныйРежим()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Параметры.
	РежимЧерногоСписка = Параметры.РежимЧерногоСписка;
	
	// Параметры.
	Список.Параметры.УстановитьЗначениеПараметра("РежимЧерногоСписка", РежимЧерногоСписка);
	
	// Режим выбора.
	__РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список,
		"ПодробныйРежим, НаименованиеПолное,КатегорияКонтрагента,Комментарий");
		
	// Настройка формы.
	Если РежимЧерногоСписка Тогда
		Элементы.ЧерныйСписокКонтрагентов.Видимость = Ложь;
		
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		Элементы.ЧерныйСписокИндекс.Видимость = Ложь;
		Элементы.Комментарий.Видимость = Ложь;
	Иначе
		Элементы.ЧерныйСписокПериод.Видимость = Ложь;
		Элементы.ЧерныйСписокКомментарий.Видимость = Ложь;
	КонецЕсли; 
		
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если __УправлениеДаннымиКлиентСервер.ОповещениеИзмененияЧерногоСпискаКонтрагентов(ИмяСобытия) Тогда
		Элементы.Список.Обновить();
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаОповещения()
