
Функция ПолучитьСписокНоменклатуры(Модификатор = Неопределено) Экспорт
	
	Возврат РегистрыСведений.МодификаторыНоменклатуры.ПолучитьСписокНоменклатуры(Модификатор, "УсловияНоменклатуры");	
	
КонецФункции // ПолучитьСписокНоменклатуры()


Процедура ПолучитьПравилаУсловий(Ссылка, Родитель, Объект) Экспорт

	РегистрыСведений.МодификаторыНоменклатуры.ПолучитьПравилаМодификаторов(Ссылка, Родитель, Объект, "УсловияНоменклатуры");
	
КонецПроцедуры // ПолучитьПравилаУсловий()

Процедура УстановитьПравилаУсловий(Ссылка, Родитель, Объект, Отказ) Экспорт

	РегистрыСведений.МодификаторыНоменклатуры.УстановитьПравилаМодификаторов(Ссылка, Родитель, Объект, Отказ, "УсловияНоменклатуры");
	
КонецПроцедуры // УстановитьПравилаУсловий()
