
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Настройка формы.
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура УстановитьВидимостьНаСервере()
	
	Если (Объект.Условие = Перечисления.УсловияПодписей.КоличествоГостей) ИЛИ
		(Объект.Условие = Перечисления.УсловияПодписей.Сумма) Тогда
		Элементы.ЗначениеУсловия.Заголовок = "От";
		Элементы.ЗначениеУсловияДоп.Заголовок = "До";
		Элементы.ЗначениеУсловия.РастягиватьПоГоризонтали = Ложь;
		Элементы.ЗначениеУсловияДоп.РастягиватьПоГоризонтали = Ложь;
		Элементы.ЗначениеУсловия.Видимость = Истина;
		Элементы.ЗначениеУсловияДоп.Видимость = Истина;
		Элементы.Приоритет.Видимость = Истина;
	ИначеЕсли (Объект.Условие = Перечисления.УсловияПодписей.БезУсловий) Тогда
		Элементы.ЗначениеУсловия.Видимость = Ложь;
		Элементы.ЗначениеУсловияДоп.Видимость = Ложь;
		Элементы.Приоритет.Видимость = Истина;
	ИначеЕсли (Объект.Условие = Перечисления.УсловияПодписей.ДисконтнаяКарта) Тогда
		Элементы.ЗначениеУсловия.Видимость = Истина;
		Элементы.ЗначениеУсловияДоп.Видимость = Ложь;
		Элементы.Приоритет.Видимость = Ложь;
	Иначе
		Элементы.ЗначениеУсловия.Заголовок = "Значение";
		Элементы.ЗначениеУсловия.РастягиватьПоГоризонтали = Истина;
		Элементы.ЗначениеУсловия.Видимость = Истина;
		Элементы.ЗначениеУсловияДоп.Видимость = Ложь;
		Элементы.Приоритет.Видимость = Истина;
	КонецЕсли;
	
	Элементы.ЗначениеУсловия.ОграничениеТипа = Справочники.ТипыПодписей.ОписаниеТипаЗначенияУсловия(Объект);
	
КонецПроцедуры // УстановитьВидимостьНаСервере()

&НаКлиенте
Процедура УсловиеПриИзменении(Элемент)
	
	УсловиеПриИзмененииНаСервере();
	
КонецПроцедуры // // УсловиеПриИзменении()

&НаСервере
Процедура УсловиеПриИзмененииНаСервере()
	
	// Условие.
	Объект.Условие = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Объект.Условие, ПредопределенноеЗначение("Перечисление.УсловияПодписей.БезУсловий"));
	
	// ЗначениеУсловия
	Объект.ЗначениеУсловия = Справочники.ТипыПодписей.ОписаниеТипаЗначенияУсловия(Объект).ПривестиЗначение(Объект.ЗначениеУсловия);
	
	// Настройка формы.
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры // УсловиеПриИзмененииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка формы.
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры
