
&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	ПараметрыПериода = Новый Структура;
	ПараметрыПериода.Вставить("ДатаНачала", Объект.ДатаНач);
	ПараметрыПериода.Вставить("ДатаОкончания", Объект.ДатаКон);
	ПараметрыПериода.Вставить("ИнтервалПериод", Истина);	
	РедактированиеПериода = ПолучитьФорму("ОбщаяФорма.РедактированиеПериода", ПараметрыПериода, ЭтаФорма);
	Если РедактированиеПериода.Открыта() Тогда
		РедактированиеПериода.Активизировать();
	Иначе
		РедактированиеПериода.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПериодИзменен" Тогда
		Объект.ДатаНач = Параметр.ДатаНачала;
		Объект.ДатаКон = КонецДня(Параметр.ДатаОкончания);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ДатаНач = НачалоГода(ТекущаяДата());
	Объект.ДатаКон = КонецМесяца(ДобавитьМесяц(НачалоДня(ТекущаяДата()), -1));
	//Объект.ДатаНач = НачалоМесяца(Дата('20130701'));
	//Объект.ДатаКон = КонецМесяца(Дата('20130701'));
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ВыполнитьОбработкуНаСервере();
	ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
КонецПроцедуры

Процедура ВыполнитьОбработкуНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыполнитьОбработку();
КонецПроцедуры


