
&НаКлиенте
Процедура ДокументНажатие(Элемент, СтандартнаяОбработка)
	
	Если Не Запись.Документ.Пустая() Тогда
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Запись.Документ));  //ОткрытьЗначение();
	КонецЕсли;

КонецПроцедуры // ДокументНажатие()

&НаКлиенте
Процедура НадписьПросмотретьНажатие(Элемент)

КонецПроцедуры // НадписьПросмотретьНажатие()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заглушка.
	Отказ = Не ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Идентификатор);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка форма.
	Если Не МодальныйРежим Тогда
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()
