
&НаКлиенте
Процедура УстановитьВидимость()

	// Видимость.
	УстановитьВидимостьСервер();
	ОбновитьОтображениеДанных();
КонецПроцедуры // УстановитьВидимость()

&НаСервере
Процедура УстановитьВидимостьСервер()
	
	// Командная панель.
	Элементы.ПодробныйРежим.Пометка = ПодробныйРежим;
	
	// Список.
	Элементы.ИндексОпубликованности.Видимость = ПолучитьФункциональнуюОпциюФормы("ИспользоватьВебСервис");
	
	// Картинка.
	МассивРеквизитов = Новый Массив;
	Если ПодробныйРежим Тогда
		ИзменитьРеквизиты(МассивРеквизитов, );
		Элемент = Элементы.Добавить("Картинка", Тип("ПолеФормы"));
		Элемент.Вид = ВидПоляФормы.ПолеКартинки;
		Элемент.РазмерКартинки = РазмерКартинки.АвтоРазмер;
		Элемент.ПутьКДанным = "Картинка";
		Элемент.Заголовок = НСтр("ru = 'Изображение'; uk = 'Зображення'");
		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.Ширина = 48;
		Элементы.Список.РастягиватьПоГоризонтали = Ложь;
	Иначе
		Элемент = Элементы.Найти("Картинка");
		Если (Не Элемент = Неопределено) Тогда
			Элементы.Удалить(Элементы["Картинка"]);
		КонецЕсли;
		Элементы.Список.РастягиватьПоГоризонтали = Истина;
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьСервер()

&НаСервере
Процедура УстановитьОбновлениеСервер()
	
	// Параметры.
	Список.Параметры.УстановитьЗначениеПараметра("ОпубликованныеРесурсы", РегистрыСведений.__НастройкиВебСервиса.РесурсыПублицкацииИзображенийПолучить());
	
КонецПроцедуры // УстановитьОбновлениеСервер()


&НаКлиенте
Процедура ОбработчикОжиданияОбновления()
	
	// Обновление.
	УстановитьОбновлениеСервер();
	
КонецПроцедуры // ОбработчикОжиданияОбновления()


&НаКлиенте
Процедура ПодробныйРежим(Команда)
	
	ПодробныйРежим = Не ПодробныйРежим;
	Если ПодробныйРежим Тогда
		СписокПриАктивизацииСтроки(Элементы.Список);
	КонецЕсли; 
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПодробныйРежим()

&НаКлиенте
Процедура Опубликовать(Команда)
	
	// Публикация.
	ОпубликоватьСервер();
	
КонецПроцедуры // Опубликовать()

&НаСервере
Процедура ОпубликоватьСервер()
	
	// Публикация.
	РегистрыСведений.__НастройкиВебСервиса.РесурсПублицкацииИзображениеРазместить();
	
КонецПроцедуры // ОпубликоватьСервер()


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	Если ПодробныйРежим Тогда
		Если (Элемент.ТекущаяСтрока = Неопределено) Или __РаботаСДиалогамиКлиентСервер.СтрокаГруппировкиДинамическогоСписка(Элемент.ТекущаяСтрока) Тогда
			Картинка = Неопределено;
		Иначе
			Картинка = ПолучитьНавигационнуюСсылку(Элемент.ТекущаяСтрока, "Изображение");
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры // СписокПриАктивизацииСтроки()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Режим выбора.
	__РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список);
	
	// Обновление.
	УстановитьОбновлениеСервер();
	
	// Настойка формы.
	РежимВыбора = Элементы.Список.РежимВыбора;
	Элементы.Опубликовать.Видимость = Не РежимВыбора;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Авто-обновление.
	ПодключитьОбработчикОжидания("ОбработчикОжиданияОбновления", 60);
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Настройка формы.
	УстановитьВидимостьСервер();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()