
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Создание.
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = НЕ ПроверитьЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.СоставПлана.Количество() > 0 Тогда
		Ответ = Вопрос("Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСоставПлана();
	ЗаполнитьКолонкиТабличнойЧасти();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСоставПлана()
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьСоставПлана();
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьКолонкиТабличнойЧасти(Колонка = "")
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаполнитьКолонкиТабличнойЧасти(Колонка);
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура КоличествоКлиентовПриИзменении(Элемент)
	ЗаполнитьКолонкиТабличнойЧасти(Элемент.Имя);
	РассчитатьПоказателиТабличнойЧасти();
	ОбновитьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоКлиентовСреднееПриИзменении(Элемент)
	ЗаполнитьКолонкиТабличнойЧасти(Элемент.Имя);
	РассчитатьПоказателиТабличнойЧасти();
	ОбновитьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура СкидкаПроцентПриИзменении(Элемент)
	ЗаполнитьКолонкиТабличнойЧасти(Элемент.Имя);
	РассчитатьПоказателиТабличнойЧасти();
	ОбновитьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура СебестоимостьПроцентПриИзменении(Элемент)
	ЗаполнитьКолонкиТабличнойЧасти(Элемент.Имя);
	РассчитатьПоказателиТабличнойЧасти();
	ОбновитьПодвал();
КонецПроцедуры
 
&НаКлиенте
Процедура СоставПланаКЦППриИзменении(Элемент)
	РассчитатьПоказателиТабличнойЧасти(Элементы.СоставПлана.ТекущиеДанные.НомерСтроки);
	ОбновитьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаЦенаПриИзменении(Элемент)
	РассчитатьПоказателиТабличнойЧасти(Элементы.СоставПлана.ТекущиеДанные.НомерСтроки);
	ОбновитьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаСкидкаПроцентПриИзменении(Элемент)
	РассчитатьПоказателиТабличнойЧасти(Элементы.СоставПлана.ТекущиеДанные.НомерСтроки);
	ОбновитьПодвал();
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаСебестоимостьПроцентПриИзменении(Элемент)
	РассчитатьПоказателиТабличнойЧасти(Элементы.СоставПлана.ТекущиеДанные.НомерСтроки);
	ОбновитьПодвал();
КонецПроцедуры

&НаСервере
Процедура РассчитатьПоказателиТабличнойЧасти(НомерСтроки = "")
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.РассчитатьПоказателиТабличнойЧасти(НомерСтроки);
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвал()
	
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаКоличество.ТекстПодвала 			= Окр(Объект.СоставПлана.Итог("Количество"), 2);
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаКЦП.ТекстПодвала 					= ?(Объект.КоличествоКлиентов = 0, "", Окр(Объект.СоставПлана.Итог("Количество")/Объект.КоличествоКлиентов, 2));
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаЦена.ТекстПодвала 					= ?(Объект.СоставПлана.Итог("Количество") = 0, "", Окр(Объект.СоставПлана.Итог("Сумма")/Объект.СоставПлана.Итог("Количество"), 2));
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСреднийЧек.ТекстПодвала 			= ?(Объект.КоличествоКлиентов = 0, "", Окр(Объект.СоставПлана.Итог("Сумма")/Объект.КоличествоКлиентов, 2));
	//Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСредняяТранзакция.ТекстПодвала 	= "";
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСуммаБезСкидок.ТекстПодвала 		= Окр(Объект.СоставПлана.Итог("СуммаБезСкидок"), 2);
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСуммаСкидки.ТекстПодвала 			= Окр(Объект.СоставПлана.Итог("СуммаСкидки"), 2);
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСкидкаПроцент.ТекстПодвала 			= ?(Объект.СоставПлана.Итог("СуммаБезСкидок") = 0, "", Окр(Объект.СоставПлана.Итог("СуммаСкидки")/Объект.СоставПлана.Итог("СуммаБезСкидок")*100, 2));
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСумма.ТекстПодвала 					= Окр(Объект.СоставПлана.Итог("Сумма"), 2);
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСебестоимость.ТекстПодвала 			= Окр(Объект.СоставПлана.Итог("Себестоимость"), 2);
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаСебестоимостьПроцент.ТекстПодвала 	= ?(Объект.СоставПлана.Итог("Сумма") = 0, "", Окр(Объект.СоставПлана.Итог("Себестоимость")/Объект.СоставПлана.Итог("Сумма")*100, 2));
	Элементы.СоставПлана.ПодчиненныеЭлементы.СоставПланаВаловыйДоход.ТекстПодвала 			= Окр(Объект.СоставПлана.Итог("ВаловыйДоход"), 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаПланирования <> НачалоМесяца(Объект.ДатаПланирования) Тогда
		Объект.ДатаПланирования = НачалоМесяца(Объект.ДатаПланирования);
	КонецЕсли;
	
	Если (НЕ ЗначениеЗаполнено(Объект.Ссылка.ДатаПланирования)) Тогда
		ЗаполнитьСоставПлана();
		ЗаполнитьКолонкиТабличнойЧасти();
	ИначеЕсли ((Объект.ДатаПланирования <> Объект.Ссылка.ДатаПланирования) И Объект.СоставПлана.Количество()) Тогда
		Ответ = Вопрос("Табличная часть будет перезаполнена. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Объект.ДатаПланирования = Объект.Ссылка.ДатаПланирования; 
			Возврат;
		КонецЕсли;
		ЗаполнитьСоставПлана();
		ЗаполнитьКолонкиТабличнойЧасти();
	КонецЕсли;
	
КонецПроцедуры
