// Игорь 22.09.2011 16:35:00
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТабличныеЧастиНаСервере();
КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьТабличныеЧастиНаСервере()
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ОчисткиРегистраСписокФайловПриОбмене();
	ЭтотОбъект.ЗаполнитьТабличныеЧасти();
	ЗначениеВРеквизитФормы(ЭтотОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) Экспорт	
	ЗаполнениеПриОткрытии();	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеПриОткрытии() 
	Если не ПустаяСтрока(КаталогДляОбмнена) и Объект.КаталогДляОбмненаДисконтнымиКартамиHTTP <> КаталогДляОбмнена Тогда
		Объект.КаталогДляОбмненаДисконтнымиКартамиHTTP = КаталогДляОбмнена;
	КонецЕсли;
	Элементы.КаталогДляОбмненаДисконтнымиКартамиHTTP.Доступность = ПустаяСтрока(КаталогДляОбмнена);	
КонецПроцедуры

&НаКлиенте
Процедура КаталогДляОбмненаДисконтнымиКартамиHTTPНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)		
	СтандартнаяОбработка = Ложь;			
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогОткрытияФайла.Заголовок = "Выберите каталог";
	ДиалогОткрытияФайла.Каталог = "";
	ДиалогОткрытияФайла.ПредварительныйПросмотр = Истина;                          	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Если Прав(ДиалогОткрытияФайла.Каталог,1) <> "\" Тогда
			Объект.КаталогДляОбмена = ДиалогОткрытияФайла.Каталог+"\";		
		Иначе 
			Объект.КаталогДляОбмена = ДиалогОткрытияФайла.Каталог;
		КонецЕсли;		 
		ЗаполнитьТабличныеЧастиНаСервере();		
	Иначе
		Возврат;
	КонецЕсли;
	ЗаписатьКонстантуНаСервере();
КонецПроцедуры

&НаСервере
Функция  ПроверкаЗаполненияКонстантыНаСервере() 
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ЭтотОбъект.ПроверкаЗаполненияКонстанты();	
КонецФункции

&НаСервере
Процедура ЗаполнитьТабличныеЧастиСервере() 
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	Если ЭтотОбъект.ПроверкаЗаполненияКонстанты() Тогда
		ЭтотОбъект.ЗаписатьКонстанту(Объект.КаталогДляОбмненаДисконтнымиКартамиHTTP);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)	
	//ЗаписатьКонстантуНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКонстантуНаСервере() 
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗаписатьКонстанту(Объект.КаталогДляОбмена);	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНасервере();	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНасервере() 
	
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ВыполнитьОбработку();
	Элементы.СписокВидыСертификатов.Обновить();
	Элементы.СписокДисконтныеКарты.Обновить();
	Элементы.СписокСертификаты.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицы(Команда)
	ЗаполнитьТабличныеЧастиНаСервере();
КонецПроцедуры


