
Функция ОсновнаяВалюта() Экспорт
	
	Результат = Константы.ВалютаРегламентированногоУчета.Получить();
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Валюты.Ссылка
	                      |ИЗ
	                      |	Справочник.Валюты КАК Валюты
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Валюты.ПометкаУдаления,
	                      |	Валюты.Наименование");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Валюты.ПустаяСсылка();

КонецФункции // ОсновнаяВалюта()
