Функция ВернутьМодельОборудованияПоИдентификатору(Идентификатор=Неопределено) Экспорт
	
	Модель = Неопределено;
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегТО.Модель КАК Модель
	|ИЗ
	|	РегистрСведений.ТорговоеОборудование КАК РегТО
	|ГДЕ
	|	РегТО.Идентификатор = &Идентификатор
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Модель = Выборка.Модель;
	КонецЕсли;
	
	Возврат Модель;
	
КонецФункции	                   

Процедура ПечатьВстречки(Идентификатор, ТабличныйДокумент) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТорговоеОборудование.Параметры
	                      |ИЗ
	                      |	РегистрСведений.ТорговоеОборудование КАК ТорговоеОборудование
	                      |ГДЕ
	                      |	ТорговоеОборудование.Идентификатор = &Идентификатор");
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Параметры = ЗначениеИзСтрокиВнутр(Выборка.Параметры);
		
		Параметры.Свойство("НазваниеПринтера", ТабличныйДокумент.ИмяПринтера);
		
		Параметры.Свойство("ПолеСверху", ТабличныйДокумент.ПолеСверху);
		Параметры.Свойство("ПолеСнизу", ТабличныйДокумент.ПолеСнизу);
		Параметры.Свойство("ПолеСлева", ТабличныйДокумент.ПолеСлева);
		Параметры.Свойство("ПолеСправа", ТабличныйДокумент.ПолеСправа);
		
		Параметры.Свойство("КоличествоКопий", ТабличныйДокумент.КоличествоЭкземпляров);
			
		ТабличныйДокумент.АвтоМасштаб = Ложь;
	    ТабличныйДокумент.МасштабПечати = 100;
		
		ТабличныйДокумент.Вывод = ИспользованиеВывода.Разрешить;
		
		__СерверПечатиСервер.Напечатать(ТабличныйДокумент, Перечисления.__ВидыЗаданийСервераПечати.Встречка);
	КонецЕсли;
	
	ТабличныйДокумент = Неопределено;
	
КонецПроцедуры // ПечатьВстречки()

  