
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Создание.
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = НЕ ПроверитьЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	СтандартнаяОбработка = Ложь;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок	= "Выберите файл Excel";
	ДиалогВыбораФайла.Фильтр = "Документ Excel(*.xls)|*.xls|Документ Excel 2007(*.xlsx)|*.xlsx";
	Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ЗагрузитьИзФайлаНаСервере(ДиалогВыбораФайла.ПолноеИмяФайла);
	ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(ПолноеИмяФайла)
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ЗагрузитьИзФайла(Объект, ПолноеИмяФайла);
КонецПроцедуры

