
&НаСервере
Процедура ПрочитатьПараметрыПрописи()
	
	// Русскмй.
	СтрокаПараметров = СтрЗаменить(Объект.ПараметрыПрописиНаРусском, ",", Символы.ПС);
	
	ПолеПрописи1наРусском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 1));
	ПолеПрописи2наРусском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 2));
	ПолеПрописи3наРусском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 3));
	
	Род = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 4));
	
	Если	  НРег(Род) = "м" Тогда
		ПолеПрописи4наРусском = "Мужской";
	ИначеЕсли НРег(Род) = "ж" Тогда
		ПолеПрописи4наРусском = "Женский";
	ИначеЕсли НРег(Род) = "с" Тогда
		ПолеПрописи4наРусском = "Средний";
	Иначе
		ПолеПрописи4наРусском = "Мужской";
	КонецЕсли;
	
	ПолеПрописи5наРусском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 5));
	ПолеПрописи6наРусском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 6));
	ПолеПрописи7наРусском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 7));
	
	Род = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 8));
	
	Если	  НРег(Род = "м") Тогда
		ПолеПрописи8наРусском = "Мужской";
	ИначеЕсли НРег(Род = "ж") Тогда
		ПолеПрописи8наРусском = "Женский";
	ИначеЕсли НРег(Род = "с") Тогда
		ПолеПрописи8наРусском = "Средний";
	Иначе
		ПолеПрописи8наРусском = "Мужской";
	КонецЕсли;
	
	ДлинаДробнойЧасти     = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 9));
	
	
	// Русскмй.
	СтрокаПараметров = СтрЗаменить(Объект.ПараметрыПрописиНаУкраинском, ",", Символы.ПС);
	
	ПолеПрописи1наУкраинском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 1));
	ПолеПрописи2наУкраинском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 2));
	ПолеПрописи3наУкраинском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 3));
	
	Род = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 4));
	
	Если	  НРег(Род) = "м" Тогда
		ПолеПрописи4наУкраинском = "Мужской";
	ИначеЕсли НРег(Род) = "ж" Тогда
		ПолеПрописи4наУкраинском = "Женский";
	ИначеЕсли НРег(Род) = "с" Тогда
		ПолеПрописи4наУкраинском = "Средний";
	Иначе
		ПолеПрописи4наУкраинском = "Мужской";
	КонецЕсли;
	
	ПолеПрописи5наУкраинском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 5));
	ПолеПрописи6наУкраинском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 6));
	ПолеПрописи7наУкраинском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 7));
	
	Род = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 8));
	
	Если	  НРег(Род = "м") Тогда
		ПолеПрописи8наУкраинском = "Мужской";
	ИначеЕсли НРег(Род = "ж") Тогда
		ПолеПрописи8наУкраинском = "Женский";
	ИначеЕсли НРег(Род = "с") Тогда
		ПолеПрописи8наУкраинском = "Средний";
	Иначе
		ПолеПрописи8наУкраинском = "Мужской";
	КонецЕсли;
	
	ДлинаДробнойЧасти     = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 9));
	
	Если ПустаяСтрока(ДлинаДробнойЧасти) Тогда
		ДлинаДробнойЧасти = "2";
	КонецЕсли; 
	
КонецПроцедуры // ПрочитатьПараметрыПрописи()


&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыПрописиНаРусском(Форма)
	
	Возврат Форма.ПолеПрописи1наРусском + ", "
			+ Форма.ПолеПрописи2наРусском + ", "
			+ Форма.ПолеПрописи3наРусском + ", "
			+ НРег(Лев(Форма.ПолеПрописи4наРусском, 1)) + ", "
			+ Форма.ПолеПрописи5наРусском + ", "
			+ Форма.ПолеПрописи6наРусском + ", "
			+ Форма.ПолеПрописи7наРусском + ", "
			+ НРег(Лев(Форма.ПолеПрописи8наРусском, 1)) + ", "
			+ Форма.ДлинаДробнойЧасти;
	
КонецФункции // ПараметрыПрописиНаРусском()

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыПрописиНаУкраинском(Форма)
	
	Возврат Форма.ПолеПрописи1наУкраинском + ", "
			+ Форма.ПолеПрописи2наУкраинском + ", "
			+ Форма.ПолеПрописи3наУкраинском + ", "
			+ НРег(Лев(Форма.ПолеПрописи4наУкраинском, 1)) + ", "
			+ Форма.ПолеПрописи5наУкраинском + ", "
			+ Форма.ПолеПрописи6наУкраинском + ", "
			+ Форма.ПолеПрописи7наУкраинском + ", "
			+ НРег(Лев(Форма.ПолеПрописи8наУкраинском, 1)) + ", "
			+ Форма.ДлинаДробнойЧасти;
	
КонецФункции // ПараметрыПрописиНаУкраинском()


&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСклоненияПараметровПрописи(Форма)
	
	// Склонение заголовков параметров прописи.
	Элементы = Форма.Элементы;
	
	Если Форма.ПолеПрописи4наРусском = "Женский" Тогда
		Элементы.ПолеПрописи1наРусском.Заголовок = НСтр("ru = 'одна'; uk = 'одна'");
		Элементы.ПолеПрописи2наРусском.Заголовок = НСтр("ru = 'две'; uk = 'дві'");
	ИначеЕсли Форма.ПолеПрописи4наРусском = "Мужской" Тогда
		Элементы.ПолеПрописи1наРусском.Заголовок = НСтр("ru = 'один'; uk = 'один'");
		Элементы.ПолеПрописи2наРусском.Заголовок = НСтр("ru = 'два'; uk = 'два'");
	Иначе
		Элементы.ПолеПрописи1наРусском.Заголовок = НСтр("ru = 'одно'; uk = 'одне'");
		Элементы.ПолеПрописи2наРусском.Заголовок = НСтр("ru = 'два'; uk = 'два'");
	КонецЕсли;
	
	Если Форма.ПолеПрописи8наРусском = "Женский" Тогда
		Элементы.ПолеПрописи5наРусском.Заголовок = НСтр("ru = 'одна'; uk = 'одна'");
		Элементы.ПолеПрописи6наРусском.Заголовок = НСтр("ru = 'две'; uk = 'дві'");
	ИначеЕсли Форма.ПолеПрописи8наРусском = "Мужской" Тогда
		Элементы.ПолеПрописи5наРусском.Заголовок = НСтр("ru = 'один'; uk = 'один'");
		Элементы.ПолеПрописи6наРусском.Заголовок = НСтр("ru = 'два'; uk = 'два'");
	Иначе
		Элементы.ПолеПрописи5наРусском.Заголовок = НСтр("ru = 'одно'; uk = 'одне'");
		Элементы.ПолеПрописи6наРусском.Заголовок = НСтр("ru = 'два'; uk = 'два'");
	КонецЕсли;
	
	
	Если Форма.ПолеПрописи4наУкраинском = "Женский" Тогда
		Элементы.ПолеПрописи1наУкраинском.Заголовок = НСтр("ru = 'одна'; uk = 'одна'");
		Элементы.ПолеПрописи2наУкраинском.Заголовок = НСтр("ru = 'две'; uk = 'дві'");
	ИначеЕсли Форма.ПолеПрописи4наУкраинском = "Мужской" Тогда
		Элементы.ПолеПрописи1наУкраинском.Заголовок = НСтр("ru = 'один'; uk = 'один'");
		Элементы.ПолеПрописи2наУкраинском.Заголовок = НСтр("ru = 'два'; uk = 'два'");
	Иначе
		Элементы.ПолеПрописи1наУкраинском.Заголовок = НСтр("ru = 'одно'; uk = 'одне'");
		Элементы.ПолеПрописи2наУкраинском.Заголовок = НСтр("ru = 'два'; uk = 'два'");
	КонецЕсли;
	
	Если Форма.ПолеПрописи8наУкраинском = "Женский" Тогда
		Элементы.ПолеПрописи5наУкраинском.Заголовок = НСтр("ru = 'одна'; uk = 'одна'");
		Элементы.ПолеПрописи6наУкраинском.Заголовок = НСтр("ru = 'две'; uk = 'дві'");
	ИначеЕсли Форма.ПолеПрописи8наУкраинском = "Мужской" Тогда
		Элементы.ПолеПрописи5наУкраинском.Заголовок = НСтр("ru = 'один'; uk = 'один'");
		Элементы.ПолеПрописи6наУкраинском.Заголовок = НСтр("ru = 'два'; uk = 'два'");
	Иначе
		Элементы.ПолеПрописи5наУкраинском.Заголовок = НСтр("ru = 'одно'; uk = 'одне'");
		Элементы.ПолеПрописи6наУкраинском.Заголовок = НСтр("ru = 'два'; uk = 'два'");
	КонецЕсли;
	
КонецПроцедуры // УстановитьСклоненияПараметровПрописи()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСуммуПрописью(Форма)
	
	Форма.СуммаПрописьюНаРусском = ЧислоПрописью(Форма.СуммаЧисло, , ПараметрыПрописиНаРусском(Форма));
	Форма.СуммаПрописьюНаУкраинском = ЧислоПрописью(Форма.СуммаЧисло, , ПараметрыПрописиНаУкраинском(Форма));
	
КонецПроцедуры // УстановитьСуммуПрописью()


&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеСформировать(ФормироватьПолноеНаименованиеАвтоматически, Объект.НаименованиеПолное, Объект.Наименование, Элементы.НаименованиеПолное);
	
КонецПроцедуры // НаименованиеПриИзменении()

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеУстановитьПризнак(ФормироватьПолноеНаименованиеАвтоматически, Объект.НаименованиеПолное, Объект.Наименование, Элементы.НаименованиеПолное);
	
КонецПроцедуры // НаименованиеПолноеПриИзменении()


&НаКлиенте
Процедура СуммаЧислоПриИзменении(Элемент)
	
	УстановитьСуммуПрописью(ЭтаФорма);
	
КонецПроцедуры // СуммаЧислоПриИзменении()

&НаКлиенте
Процедура ПолеПрописи4наРусскомПриИзменении(Элемент)
	
	УстановитьСклоненияПараметровПрописи(ЭтаФорма);
	УстановитьСуммуПрописью(ЭтаФорма);
	
КонецПроцедуры // ПолеПрописи4наРусскомПриИзменении()

&НаКлиенте
Процедура ПолеПрописи4наРусскомАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = АвтоПодборПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка);
	
КонецПроцедуры // ПолеПрописи4наРусскомАвтоПодбор()

&НаКлиенте
Процедура ПолеПрописи4наРусскомОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ДанныеВыбора = ОкончаниеВводаТекстаПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка);
	
КонецПроцедуры // ПолеПрописи4наРусскомОкончаниеВводаТекста()

&НаКлиенте
Процедура ПолеПрописи8наРусскомПриИзменении(Элемент)
	
	УстановитьСклоненияПараметровПрописи(ЭтаФорма);
	УстановитьСуммуПрописью(ЭтаФорма);
	
КонецПроцедуры // ПолеПрописи8наРусскомПриИзменении()

&НаКлиенте
Процедура ПолеПрописи8наРусскомАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = АвтоПодборПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка);
	
КонецПроцедуры // ПолеПрописи8наРусскомАвтоПодбор()

&НаКлиенте
Процедура ПолеПрописи8наРусскомОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ДанныеВыбора = ОкончаниеВводаТекстаПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка);
	
КонецПроцедуры // ПолеПрописи8наРусскомОкончаниеВводаТекста()

&НаКлиенте
Процедура ПолеПрописи1наРусскомПриИзменении(Элемент)
	
	УстановитьСуммуПрописью(ЭтаФорма);
	
КонецПроцедуры // ПолеПрописи1наРусскомПриИзменении()

&НаКлиенте
Процедура ПолеПрописи2наРусскомПриИзменении(Элемент)
	
	УстановитьСуммуПрописью(ЭтаФорма);
	
КонецПроцедуры // ПолеПрописи2наРусскомПриИзменении()

&НаКлиенте
Процедура ПолеПрописи3наРусскомПриИзменении(Элемент)
	
	УстановитьСуммуПрописью(ЭтаФорма);
	
КонецПроцедуры // ПолеПрописи3наРусскомПриИзменении()

&НаКлиенте
Процедура ПолеПрописи5наРусскомПриИзменении(Элемент)
	
	УстановитьСуммуПрописью(ЭтаФорма);
	
КонецПроцедуры // ПолеПрописи5наРусскомПриИзменении()

&НаКлиенте
Процедура ПолеПрописи6наРусскомПриИзменении(Элемент)
	
	УстановитьСуммуПрописью(ЭтаФорма);
	
КонецПроцедуры // ПолеПрописи6наРусскомПриИзменении()

&НаКлиенте
Процедура ПолеПрописи7наРусскомПриИзменении(Элемент)
	
	УстановитьСуммуПрописью(ЭтаФорма);
	
КонецПроцедуры // ПолеПрописи7наРусскомПриИзменении()

&НаКлиенте
Процедура ДлинаДробнойЧастиПриИзменении(Элемент)
	
	УстановитьСуммуПрописью(ЭтаФорма);
	
КонецПроцедуры // ДлинаДробнойЧастиПриИзменении()

&НаКлиенте
Процедура ДлинаДробнойЧастиАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = АвтоПодборПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка);
	
КонецПроцедуры // ДлинаДробнойЧастиАвтоПодбор()

&НаКлиенте
Процедура ДлинаДробнойЧастиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ДанныеВыбора = ОкончаниеВводаТекстаПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка);
	
КонецПроцедуры // ДлинаДробнойЧастиОкончаниеВводаТекста()


&НаКлиенте
Процедура ПолеПрописиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры // ПолеПрописиОчистка()

&НаКлиенте
Функция АвтоПодборПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка)
	
	Для Каждого ЭлементВыбора Из Элемент.СписокВыбора Цикл
		Если ВРег(Текст) = ВРег(Лев(ЭлементВыбора.Представление, СтрДлина(Текст))) Тогда
			Результат = Новый СписокЗначений;
			Результат.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
			СтандартнаяОбработка = Ложь;
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // АвтоПодборПоСпискуВыбора()

&НаКлиенте
Функция ОкончаниеВводаТекстаПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого ЭлементВыбора Из Элемент.СписокВыбора Цикл
		Если ВРег(Текст) = ВРег(ЭлементВыбора.Представление) Тогда
			СтандартнаяОбработка = Истина;
		ИначеЕсли ВРег(Текст) = ВРег(Лев(ЭлементВыбора.Представление, СтрДлина(Текст))) Тогда
			СтандартнаяОбработка = Ложь;
			Результат = Новый СписокЗначений;
			Результат.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // ОкончаниеВводаТекстаПоСпискуВыбора()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Код = __ОбщегоНазначенияКлиентСервер.ПолучитьПараметрЗаполнения(Параметры, "КодВалюты");
		Объект.Наименование = __ОбщегоНазначенияКлиентСервер.ПолучитьПараметрЗаполнения(Параметры, "НаименованиеКраткое");
		Объект.НаименованиеПолное = __ОбщегоНазначенияКлиентСервер.ПолучитьПараметрЗаполнения(Параметры, "НаименованиеПолное");
		Объект.ПараметрыПрописиНаРусском = __ОбщегоНазначенияКлиентСервер.ПолучитьПараметрЗаполнения(Параметры, "ПараметрыПрописиНаРусском");
		Объект.ПараметрыПрописиНаУкраинском = __ОбщегоНазначенияКлиентСервер.ПолучитьПараметрЗаполнения(Параметры, "ПараметрыПрописиНаУкраинском");
		
		ПриЧтенииНаСервере(Объект);
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Автоматическое формирование наименования.
	__РаботаСДиалогамиКлиентСервер.ФормаНаименованиеАвтоматическоеФормированиеУстановитьПризнак(ФормироватьПолноеНаименованиеАвтоматически, Объект.НаименованиеПолное, Объект.Наименование, Элементы.НаименованиеПолное);
	
	// Пример.
	СуммаЧисло = 125.25;
	
	ПрочитатьПараметрыПрописи();
	
	УстановитьСклоненияПараметровПрописи(ЭтаФорма);
	УстановитьСуммуПрописью(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ПараметрыПрописиНаРусском = ПараметрыПрописиНаРусском(ЭтаФорма);
	ТекущийОбъект.ПараметрыПрописиНаУкраинском = ПараметрыПрописиНаУкраинском(ЭтаФорма);
	
КонецПроцедуры // ПередЗаписьюНаСервере()
