
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Период.Дата) Тогда
		Период.Дата = НачалоДня(ТекущаяДата());
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура OK(Команда)

	Значение.Дата = Период.Дата;
	Значение.Вариант = Период.Вариант;
	Закрыть(КодВозвратаДиалога.ОК);
	
КонецПроцедуры // OK()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПустаяСтрока(Параметры.Подсказка) Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = Параметры.Подсказка;
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Период.Дата = Значение.Дата;
	Период.Вариант = Значение.Вариант;
	
КонецПроцедуры // ПриОткрытии()
