
&НаКлиенте
Процедура УстановитьВидимость()
	
	// Командная панель.
	Элементы.ПодробныйРежим.Пометка = ПодробныйРежим;
	
	// Элементы.
	Элементы.Перенос.Видимость = Элементы.ПереносНоменклатуры.Пометка;
	
КонецПроцедуры // УстановитьВидимость()

&НаСервере
//Костенюк Александр-Старт 25.03.2014
Процедура УстановитьДоступностьНаСервере()
	
	//ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ПереносНоменклатуры.Доступность = (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Управляющий"));
	
КонецПроцедуры
//Костенюк Александр-Финиш 25.03.2014

&НаКлиенте
Процедура ПодробныйРежим(Команда)
	
	ПодробныйРежим = Не ПодробныйРежим;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПодробныйРежим()

&НаКлиенте
Процедура ПереносНоменклатуры(Команда)
	
	// Настройка формы.
	Элементы.ПереносНоменклатуры.Пометка = Не Элементы.ПереносНоменклатуры.Пометка;
	ПредотвратитьУстановкуАктуальности = Истина;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПереносНоменклатуры()


&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)

	//__ИнтерактивноеУправлениеДаннымиКлиент.АктуальностьСправочникаПриАктивизацииЯчейки(Элемент); //Костенюк Александр-Закомментировано 31.03.2014
	
КонецПроцедуры	// СписокПриАктивизацииЯчейки()

&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	__ИнтерактивноеУправлениеДаннымиКлиент.ПереносМенюПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле, "МодификаторыНоменклатуры");

КонецПроцедуры // СписокПроверкаПеретаскивания()

&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	__ИнтерактивноеУправлениеДаннымиКлиент.ПереносМенюПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле, "МодификаторыНоменклатуры");

КонецПроцедуры // СписокПеретаскивание()


&НаКлиенте
Процедура ПереносВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	__ИнтерактивноеУправлениеДаннымиКлиент.ПереносМенюВыборЗначения(Элементы.Список, Значение, СтандартнаяОбработка, "МодификаторыНоменклатуры");

КонецПроцедуры // ПереносВыборЗначения()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Параметры.
	Если Параметры.Свойство("ТекущаяСтрока") Тогда
		Параметры.ТекущаяСтрока = Справочники.МодификаторыНоменклатуры.НайтиПоНоменклатуре(Параметры.ТекущаяСтрока);
	КонецЕсли; 
	Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", ПолучитьСвойство(Параметры, "Номенклатура"));
	ОбработкаОповещенияСервер(Неопределено);
	
	// Режим выбора.
	__РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список);
	
	// Настойка формы.
	__РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список, 
		"БелыйСписокНоменклатуры,ЧерныйСписокНоменклатуры, ПодробныйРежим, ПереносНоменклатуры, АктуальзироватьНоменклатуруМеню, ИндексАктуальности,ИндексЧерногоБелогоСписка,ПериодДействия,НоменклатурнаяГруппа,Комментарий");
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка формы.
	УстановитьВидимость();
	УстановитьДоступностьНаСервере(); //Костенюк Александр 25.03.2014
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	ОбработкаОповещенияСервер(ИмяСобытия);
	
КонецПроцедуры // ОбработкаОповещения()

&НаСервере
Процедура ОбработкаОповещенияСервер(ИмяСобытия)
	
	Если (ИмяСобытия = Неопределено) Или __УправлениеДаннымиКлиентСервер.ОповещениеИзмененияЧерногоБелогоСписка(ИмяСобытия) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("БелыйСписок", РегистрыСведений.БелыйСписокНоменклатуры.ПолучитьСписокНоменклатуры());
		Список.Параметры.УстановитьЗначениеПараметра("ЧерныйСписок", РегистрыСведений.ЧерныйСписокНоменклатуры.ПолучитьСписокНоменклатуры());
	КонецЕсли; 
	
	Если (ИмяСобытия = Неопределено) Или __УправлениеДаннымиКлиентСервер.ОповещениеИзмененияАктуализацияМеню(ИмяСобытия) Тогда
		Элементы.АктуальзироватьНоменклатуруМеню.Заголовок = РегистрыСведений.НоменклатураМеню.ПолучитьЗаголовокКоманды();
		Список.Параметры.УстановитьЗначениеПараметра("НеактуализированныйСписок", РегистрыСведений.НоменклатураМеню.ПолучитьСписокНеактуализированнойНоменклатуры());
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаОповещенияСервер()
