
&НаКлиенте
Процедура УсловиеПриИзменении(Элемент)
	
	Объект.Условие = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Объект.Условие, ПредопределенноеЗначение("Перечисление.УсловияАкции.ПоВидуСертификата"));
	
	Если (Объект.Условие = ПредопределенноеЗначение("Перечисление.УсловияАкции.ПоВидуСертификата")) Тогда
		Элементы.ЗначениеУсловия.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыСертификатов");
		Элементы.ЗначениеУсловия.Заголовок = НСтр("ru = 'Вид сертификата'; uk = 'Вид сертифіката'");
	Иначе
		КвалификаторыЧисла = Новый КвалификаторыЧисла(4, 0, ДопустимыйЗнак.Неотрицательный);
		Элементы.ЗначениеУсловия.ОграничениеТипа = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
		Элементы.ЗначениеУсловия.Заголовок = НСтр("ru = 'Количество гостей'; uk = 'Кількість гостей'");
	КонецЕсли;
	
	Объект.ЗначениеУсловия = Элементы.ЗначениеУсловия.ОграничениеТипа.ПривестиЗначение(Объект.ЗначениеУсловия);
	
	ЗначениеУсловияПриИзменении(Неопределено);
	
КонецПроцедуры // УсловиеПриИзменении()

&НаКлиенте
Процедура ЗначениеУсловияПриИзменении(Элемент)
	
	Если (Объект.Условие = ПредопределенноеЗначение("Перечисление.УсловияАкции.ПоВидуСертификата")) Тогда
	Иначе
		Объект.ЗначениеУсловия = Макс(Объект.ЗначениеУсловия, 1);
	КонецЕсли;
	
КонецПроцедуры // ЗначениеУсловияПриИзменении()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УсловиеПриИзменении(Неопределено);
	
КонецПроцедуры // ПриОткрытии()
