
Функция ОповещениеИзмененияАктуализацияМеню(ИмяСобытия) Экспорт
	
	Возврат (ИмяСобытия = "АктуализацияМеню");
	
КонецФункции // ОповещениеИзмененияАктуализацияМеню()

Функция ОповещениеИзмененияМодификаторовУсловий(ИмяСобытия) Экспорт
	
	Возврат (ИмяСобытия = "МодификаторыУсловия");
	
КонецФункции // ОповещениеИзмененияМодификаторовУсловий()

Функция ОповещениеИзмененияРаспределениеНоменклатуры(ИмяСобытия) Экспорт
	
	Возврат (ИмяСобытия = "РаспределениеНоменклатуры");
	
КонецФункции // ОповещениеИзмененияРаспределениеНоменклатуры()

Функция ОповещениеИзмененияНастроекРабочихЦентров(ИмяСобытия) Экспорт
	
	Возврат (ИмяСобытия = "НастройкаРабочихЦентров");
	
КонецФункции // ОповещениеИзмененияНастроекРабочихЦентров()

Функция ОповещениеИзмененияЧерногоБелогоСписка(ИмяСобытия) Экспорт
	
	Возврат (ИмяСобытия = "ЧерныйБелыйСписко");
	
КонецФункции // ОповещениеИзмененияЧерногоБелогоСписка()

Функция ОповещениеИзмененияЧерногоСпискаКонтрагентов(ИмяСобытия) Экспорт
	
	Возврат (ИмяСобытия = "ЧерныйСпискоКонтрагентов");
	
КонецФункции // ОповещениеИзмененияЧерногоСпискаКонтрагентов()

Функция ОповещениеИзмененияЗаказаПокупателя(ИмяСобытия) Экспорт
	
	Возврат (ИмяСобытия = "ЗаказПокупателя");
	
КонецФункции // ОповещениеИзмененияЗаказаПокупателя()

Функция ОповещениеИзмененияСтиля(ИмяСобытия) Экспорт
	
	Возврат (ИмяСобытия = "Стиль");
	
КонецФункции // ОповещениеИзмененияСтиля()
