
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Родитель.
	Родитель = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(
					Родитель,
					ПолучитьСвойство(ДанныеЗаполнения, "Родитель"));
	
	// ТипСтола.
	ТипСтола = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(
					ТипСтола,
					ПолучитьСвойство(ДанныеЗаполнения, "ТипСтола", Родитель.ТипСтола));
	ТипСтола = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(
					ТипСтола,
					Справочники.ТипыСтолов.ОсновнойТипСтола());
				
	// Номер и Наименование.
	Если Не ЭтоГруппа Тогда
	
		Код = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(
					Код,
					ПолучитьСвойство(ДанныеЗаполнения, "Код", Справочники.Столы.ПолучитьОчереднойКод(ЭтотОбъект)));
		Наименование = Справочники.Столы.ПолучитьНаименование(ЭтотОбъект);
		
	КонецЕсли; 					
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// ТипСтола.
	Если ЭтоГруппа Тогда
		__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, , "ТипСтола");
	Иначе
		
		Если ДополнительныеСвойства.Свойство("ПредотвратитьПроверкуУникальности") Тогда
			ДополнительныеСвойства.Удалить("ПредотвратитьПроверкуУникальности")
		Иначе
				
			//Если Не __УправлениеДаннымиСервер.ПроверитьУникальностьРеквизитаСправочника(ЭтотОбъект, "Номер") Тогда
			//	__ОбщегоНазначенияСервер.СообщитьОбНеуникальностиРеквизитаСправочника(ЭтотОбъект, "Номер", , Отказ);
			//КонецЕсли; 
				
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	Актуальность = Истина;
	Код = Справочники.Столы.ПолучитьОчереднойКод(ЭтотОбъект);
	Если Не ЭтоГруппа Тогда
		
		Номер = Справочники.Столы.ПолучитьОчереднойКод(ЭтотОбъект);
		Наименование = Справочники.Столы.ПолучитьНаименование(ЭтотОбъект);
		
	КонецЕсли; 					
	
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ)
	
	// Совместиомсть.
	Если Не ЭтоГруппа Тогда
		Номер = Код;
	КонецЕсли; 
	
	// Нормализация.
	Если Не ЭтоГруппа Тогда
		
		Если ПустаяСтрока(Наименование) Тогда
			Наименование = Справочники.Комнаты.ПолучитьНаименование(ЭтотОбъект);
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
