
&НаКлиенте
Процедура УстановитьВидимость()
	
	// Командная панель.
	Элементы.ПодробныйРежим.Пометка = ПодробныйРежим;
	Элементы.Компьютер.Видимость = ПодробныйРежим;
	Элементы.ГруппаПользователей.Видимость = ПодробныйРежим;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ПодробныйРежим(Команда)
	
	ПодробныйРежим = Не ПодробныйРежим;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПодробныйРежим()

&НаКлиенте
Процедура ОчиститьИсторию(Команда)
	
	Текст = НСтр("ru = 'Вся история использования устройств будет удалена.
                  |
                  |Операция является необратимой, продолжить?'; uk = 'Вся історія використання пристроїв буде вилучена.
                  |
                  |Операція є незворотною, продовжити?'"); 
	
	Если (Вопрос(Текст, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да) Тогда
		ОчиститьИсториюСервер();
	КонецЕсли;
	
КонецПроцедуры // ОчиститьИсторию()

&НаСервере
Процедура ОчиститьИсториюСервер()
	
	РегистрыСведений.ИсторияИспользованияКомпьютеров.ОчиститьИсторию();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры // ОчиститьИсториюСервер()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Настройка формы.
	Элементы.ОчиститьИсторию.Доступность = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ИсторияИзменений);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПриОткрытии()
