
&НаКлиенте
Процедура ТипШтрихкодаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Штрихкод.ТипШтрихкода) Тогда
		Штрихкод.ТипШтрихкода = ПредопределенноеЗначение("ПланВидовХарактеристик.ТипыШтрихкодов.EAN13");
	КонецЕсли; 
	
КонецПроцедуры // ТипШтрихкодаПриИзменении()

&НаКлиенте
Процедура ШтрихкодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	ШтрихкодНачалоВыбораСервер();
	
КонецПроцедуры // ШтрихкодНачалоВыбора()

&НаСервере
Процедура ШтрихкодНачалоВыбораСервер()
	
	Штрихкод.Штрихкод = РегистрыСведений.Штрихкоды.СформироватьШтрихКод(Неопределено, Штрихкод.ТипШтрихкода);
	
КонецПроцедуры // ШтрихкодНачалоВыбораСервер()
