
//Костенюк Александр-Старт 17.07.2012
// 
// Функция получает остаток по депозитной дисконтной карте
// 
// Параметры:
// Карта - Тип: СправочникСсылка.ИнформационныеКарты. Карта, по которой нужно получить остаток
// 
// Возвращаемое значение:
// СуммаОстаток - Тип: Число, Строка. Остаток по карте
Функция ПолучитьОстатокДепозитаПоДисконтнойКарте(Карта) Экспорт
	
	Если Карта.ВидДисконтнойКарты.ТипМонетарности = Перечисления.ТипыМонетарности.ДепозитнаяДисконтнаяКарта Тогда
		ПризнакДисконта = Карта;
	ИначеЕсли Карта.ВидДисконтнойКарты.ТипМонетарности = Перечисления.ТипыМонетарности.ДепозитнаяКонтрагент Тогда
		ПризнакДисконта = Карта.ВладелецКарты;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДенежныеСредстваДисконтныхКартОстатки.СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ДенежныеСредстваДисконтныхКарт.Остатки(, ПризнакДисконта = &ПризнакДисконта) КАК ДенежныеСредстваДисконтныхКартОстатки";
	Запрос.УстановитьПараметр("ПризнакДисконта", ПризнакДисконта);
	
	Резултат 	= Запрос.Выполнить();
	Выборка 	= Резултат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СуммаОстаток = Выборка.СуммаОстаток;
	Иначе
		СуммаОстаток = "";
	КонецЕсли;
	
	Возврат СуммаОстаток;
	
КонецФункции
//Костенюк Александр-Финиш 17.07.2012