
Перем мПериод          Экспорт; // Период движений.
Перем мТаблицаДвижений Экспорт; // Таблица движений.

// Выполняет движения по регистру.
//
Процедура ВыполнитьДвижения() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект);

КонецПроцедуры // ВыполнитьДвижения()


// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка заполнения реквизитов.
	Для Каждого Запись Из ЭтотОбъект Цикл
		////Костенюк Александр-Закомментировано 19.12.2014
		//// Нет необходиомсти производить проверку заполнения ресурса "Сумма"
		//// т.к. при полном погашении суммы счета сертификатом сумма к оплате будет равной "0"
		//Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.Сумма) Тогда
		//	ОбщегоНазначения.СообщитьОбНезаполненомРесурсеРегистра(ЭтотОбъект, "Сумма", Отказ);
		//КонецЕсли;
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.СуммаБезСкидок) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРесурсеРегистра(ЭтотОбъект, "СуммаБезСкидок", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			 Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
