
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// АстрономическаяДата.
	ТекущаяДата = ТекущаяДата();
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.АстрономическаяДата = ТекущаяДата;
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ, Замещение)

	Если Не Отказ Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		// Границы запрета изменения данных.
		НаборЗаписей = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		
		Попытка
			Если НаборЗаписей.Количество() Тогда
				НаборЗаписей.Записать();
			КонецЕсли;
		Исключение
			Отказ = Истина; // ERR
			//ОбщегоНазначения.СообщитьОбОшибкеЗапеисиРегистра(ОписаниеОшибки(), Отказ, ,, НаборЗаписей);
		КонецПопытки;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
		 
КонецПроцедуры // ПриЗаписи()
