
&НаКлиенте
Процедура ПравилаИспользованияСписокНомеровДомовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Результат = ОткрытьФормуМодально("Справочник.МаршрутыДоставки.Форма.ФормаНастройкиСпискаНомеровДомов", Новый Структура("СписокНомеровДомов", Элементы.ПравилаИспользования.ТекущиеДанные.СписокНомеровДомов), Элемент);
	Если (ТипЗнч(Результат) = Тип("СписокЗначений")) Тогда
		Элементы.ПравилаИспользования.ТекущиеДанные.СписокНомеровДомов = Результат;
		Элементы.ПравилаИспользования.ТекущиеДанные.Актуальность = Элементы.ПравилаИспользования.ТекущиеДанные.Актуальность Или Элементы.ПравилаИспользования.ТекущиеДанные.СписокНомеровДомов.Количество();
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры // ПравилаИспользованияСписокНомеровДомовНачалоВыбора()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Принадлежность.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// Настройки маршрута доставки.
	РегистрыСведений.АдресаМаршрутовДоставки.ПолучитьНастройкиМаршрутаДоставки(ТекущийОбъект, ПравилаИспользования);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Настройки маршрута доставки.
	РегистрыСведений.АдресаМаршрутовДоставки.УстановитьНастройкиМаршрутаДоставки(ТекущийОбъект, ПравилаИспользования, Отказ);
	
КонецПроцедуры // ПриЗаписиНаСервере()
