
&НаКлиенте
Процедура СчитываемаяДорожкаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.СчитываемаяДорожка = 2;

КонецПроцедуры // СчитываемаяДорожкаОчистка()


&НаКлиенте
Процедура ОграниченияЗначениеЛевоПриИзменении(Элемент)
	
	Элементы.Ограничения.ТекущиеДанные.ЗначениеЛево = СокрЛ(Элементы.Ограничения.ТекущиеДанные.ЗначениеЛево);
	Если Не ПустаяСтрока(Элементы.Ограничения.ТекущиеДанные.ЗначениеПраво) Тогда
		Элементы.Ограничения.ТекущиеДанные.ЗначениеПраво = Макс(Элементы.Ограничения.ТекущиеДанные.ЗначениеЛево, Элементы.Ограничения.ТекущиеДанные.ЗначениеПраво);
	КонецЕсли;
	
КонецПроцедуры // ОграниченияЗначениеЛевоПриИзменении()

&НаКлиенте
Процедура ОграниченияЗначениеПравоПриИзменении(Элемент)
	
	Элементы.Ограничения.ТекущиеДанные.ЗначениеПраво = СокрЛ(Элементы.Ограничения.ТекущиеДанные.ЗначениеПраво);
	Если Не ПустаяСтрока(Элементы.Ограничения.ТекущиеДанные.ЗначениеЛево) Тогда
		Элементы.Ограничения.ТекущиеДанные.ЗначениеЛево = Мин(Элементы.Ограничения.ТекущиеДанные.ЗначениеЛево, Элементы.Ограничения.ТекущиеДанные.ЗначениеПраво);
	КонецЕсли;
	
КонецПроцедуры // ОграниченияЗначениеПравоПриИзменении()

&НаКлиенте
Процедура ОграниченияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования Тогда
		
		Если ПустаяСтрока(Элементы.Ограничения.ТекущиеДанные.ЗначениеЛево) И ПустаяСтрока(Элементы.Ограничения.ТекущиеДанные.ЗначениеПраво) Тогда
			Объект.Ограничения.Удалить(Элементы.Ограничения.ТекущиеДанные);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОграниченияПриОкончанииРедактирования()
