	 
Функция ОписаниеТипаЗначенияУсловия(Объект) Экспорт
	
	Условие = Объект.Условие;	
	
	Если (Условие = Перечисления.УсловияПодписей.Активность) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.Активности");
	ИначеЕсли (Условие = Перечисления.УсловияПодписей.ДисконтнаяКарта) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ИнформационныеКарты");
	ИначеЕсли (Условие = Перечисления.УсловияПодписей.ТипСкидкиНаценки) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ТипыСкидокНаценок");
	ИначеЕсли (Условие = Перечисления.УсловияПодписей.КоличествоГостей) 
		ИЛИ (Условие = Перечисления.УсловияПодписей.Сумма) Тогда
		Возврат Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Неотрицательный));
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов("Неопределено");
	
КонецФункции // ОипсаниеТипаЗначенияУсловия()

Функция ПроверкаУникальностиПриоритета(Приоритет, Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипыПодписей.Ссылка
	               |ИЗ
	               |	Справочник.ТипыПодписей КАК ТипыПодписей
	               |ГДЕ
	               |	ТипыПодписей.Актуальность
	               |	И ТипыПодписей.Приоритет = &Приоритет
	               |	И ТипыПодписей.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Приоритет", Приоритет);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции
