
 Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	 
	 Если НЕ ЭтоГруппа Тогда
		 Если Актуальность И (НЕ Условие = Перечисления.УсловияПодписей.ДисконтнаяКарта) Тогда
			 __ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, "Приоритет");
		 КонецЕсли;
	 КонецЕсли;
	 
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		
		Если (НЕ Актуальность) ИЛИ (Условие = Перечисления.УсловияПодписей.ДисконтнаяКарта) Тогда
			Приоритет = Неопределено;
			Возврат;
		КонецЕсли;
		
		Если Справочники.ТипыПодписей.ПроверкаУникальностиПриоритета(Приоритет, Ссылка) Тогда
			Сообщить("Значение поля " +""""+ Метаданные.Справочники.ТипыПодписей.Реквизиты.Приоритет.Синоним +""""+ " не уникально", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Условие = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Условие, ПредопределенноеЗначение("Перечисление.УсловияПодписей.БезУсловий"));
		ЗначениеУсловия = Справочники.ТипыПодписей.ОписаниеТипаЗначенияУсловия(ЭтотОбъект).ПривестиЗначение(ЗначениеУсловия);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ЭтоГруппа Тогда
		Приоритет = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
