
&НаКлиенте
Процедура Выбрать()
	
	СписокВалютВыбор(Элементы.СписокВалют, Неопределено, Неопределено, Истина);
	
КонецПроцедуры // Выбрать()

&НаКлиенте
Процедура СписокВалютВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если (ТекущиеДанные = Неопределено) Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыВыбор = Новый Структура("КодВалюты, НаименованиеКраткое, НаименованиеПолное, Загружается, ПараметрыПрописиНаРусском");
	ПараметрыВыбор.КодВалюты                 = ТекущиеДанные.КодВалютыЦифровой;
	ПараметрыВыбор.НаименованиеКраткое       = ТекущиеДанные.КодВалютыБуквенный;
	ПараметрыВыбор.НаименованиеПолное        = ТекущиеДанные.Наименование;
	ПараметрыВыбор.Загружается               = ТекущиеДанные.Загружается;
	ПараметрыВыбор.ПараметрыПрописиНаРусском = ТекущиеДанные.ПараметрыПрописиНаРусском;
	
	ОткрытьФорму("Справочник.Валюты.ФормаОбъекта", ПараметрыВыбор, ВладелецФормы);
	
	Закрыть();
	
КонецПроцедуры // СписокВалютВыбор()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КлассификаторXML = Справочники.Валюты.ПолучитьМакет("КлассификаторВалют").ПолучитьТекст();
	КлассификаторТаблица = __ОбщегоНазначенияСервер.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	Для Каждого СтрокаТаблицы Из КлассификаторТаблица Цикл
		НоваяСтрока = Валюты.Добавить();
		НоваяСтрока.КодВалютыЦифровой         = СтрокаТаблицы.Code;
		НоваяСтрока.КодВалютыБуквенный        = СтрокаТаблицы.CodeSymbol;
		НоваяСтрока.Наименование              = СтрокаТаблицы.Name;
		НоваяСтрока.СтраныИТерритории         = СтрокаТаблицы.Description;
		НоваяСтрока.Загружается               = СтрокаТаблицы.RBCLoading;
		НоваяСтрока.ПараметрыПрописиНаРусском = СтрокаТаблицы.NumerationItemOptions;
	КонецЦикла;
	
КонецПроцедуры // ПриСозданииНаСервере()
