&НаСервере
Процедура ПрочитатьТаблицу()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СомнительныеСитуации.Дата КАК Дата,
	|	СомнительныеСитуации.СомнительнаяСитуация,
	|	СомнительныеСитуации.Пользователь,
	|	СомнительныеСитуации.Компьютер,
	|	СомнительныеСитуации.Заказ,
	|	СомнительныеСитуации.Значение,
	|	СомнительныеСитуации.Подтвержена,
	|	СомнительныеСитуации.Идентификатор
	|ИЗ
	|	РегистрСведений.СомнительныеСитуации КАК СомнительныеСитуации
	|ГДЕ
	|	СомнительныеСитуации.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ((&ПоказыватьПодтвержденные И СомнительныеСитуации.Подтвержена) ИЛИ (&ПоказыватьНЕПодтвержденные И НЕ СомнительныеСитуации.Подтвержена))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата"
	);
	Запрос.УстановитьПараметр("ДатаНач",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ПоказыватьПодтвержденные",ПоказыватьПодтвержденные);
	Запрос.УстановитьПараметр("ПоказыватьНеПодтвержденные",ПоказыватьНеПодтвержденные);
	Список.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьТаблицу()

	Для каждого Строка Из Список Цикл
		
		НоваяЗапись = РегистрыСведений.СомнительныеСитуации.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Строка);
		ОбменДанными.ПередатьСомнительнуюСитуацию(НоваяЗапись);
		НоваяЗапись.Записать();
		
	КонецЦикла;
	
	ПрочитатьТаблицу();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для каждого Строка Из Список Цикл
		Строка.Подтвержена = Истина;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьВсе(Команда)
	
	Для каждого Строка Из Список Цикл
		Строка.Подтвержена = Ложь;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	ЗаписатьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПрочитатьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ПоказыватьНеподтвержденные И НЕ ПоказыватьПодтвержденные Тогда
		ПоказыватьНеподтвержденные = Истина;
		Элементы.ФормаПоказыватьНеподтвержденные.Пометка = ПоказыватьНеподтвержденные;
	КонецЕсли;
	Элементы.ФормаПоказыватьПодтвержденные.Пометка		= ПоказыватьПодтвержденные;
	Элементы.ФормаПоказыватьНеподтвержденные.Пометка	= ПоказыватьНеподтвержденные;
	ПрочитатьТаблицу();
	//Костенюк Александр-Старт 01.02.2013
	ЗапретитьПодтверждениеСомнительныхСитуаций = УправлениеПользователями.ПолучитьЗначениеПрава(ПредопределенноеЗначение("ПланВидовХарактеристик.ПраваПользователей.ЗапретитьПодтверждениеСомнительныхСитуаций"));
	Если ЗапретитьПодтверждениеСомнительныхСитуаций Тогда
		Элементы.СписокСохранить.Доступность = Ложь;
	КонецЕсли;
	//Костенюк Александр-Финиш 01.02.2013
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНеподтвержденные(Команда)
	ПоказыватьНеподтвержденные = НЕ ПоказыватьНеподтвержденные;
	//Костенюк Александр-Старт 25.07.2012
	ПоказыватьПодтвержденные = НЕ ПоказыватьНеподтвержденные;
	//Костенюк Александр-Финиш 25.07.2012
	Если НЕ ПоказыватьНеподтвержденные И НЕ ПоказыватьПодтвержденные Тогда
		ПоказыватьПодтвержденные = Истина;
		Элементы.ФормаПоказыватьПодтвержденные.Пометка = ПоказыватьПодтвержденные;
	КонецЕсли; 
	Элементы.ФормаПоказыватьНеподтвержденные.Пометка = ПоказыватьНеподтвержденные;
	//Костенюк Александр-Старт 25.07.2012
	Элементы.ФормаПоказыватьПодтвержденные.Пометка = ПоказыватьПодтвержденные;
	//Костенюк Александр-Финиш 25.07.2012
	ПрочитатьТаблицу();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПодтвержденные(Команда)
	ПоказыватьПодтвержденные = НЕ ПоказыватьПодтвержденные;
	//Костенюк Александр-Старт 25.07.2012
	ПоказыватьНеподтвержденные = НЕ ПоказыватьПодтвержденные;
	//Костенюк Александр-Финиш 25.07.2012
	Если НЕ ПоказыватьНеподтвержденные И НЕ ПоказыватьПодтвержденные Тогда
		ПоказыватьНеподтвержденные = Истина;
		Элементы.ФормаПоказыватьНеподтвержденные.Пометка = ПоказыватьНеподтвержденные;
	КонецЕсли; 
	Элементы.ФормаПоказыватьПодтвержденные.Пометка = ПоказыватьПодтвержденные;
	//Костенюк Александр-Старт 25.07.2012
	Элементы.ФормаПоказыватьНеподтвержденные.Пометка = ПоказыватьНеподтвержденные;
	//Костенюк Александр-Финиш 25.07.2012
	ПрочитатьТаблицу();
КонецПроцедуры

&НаКлиенте
//Костенюк Александр-Старт 11.04.2012
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СписокЗаказ"Тогда
		Если Элемент.ТекущиеДанные.Заказ <> Неопределено Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.Заказ);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
//Костенюк Александр-Финиш 11.04.2012

&НаСервере
//Костенюк Александр-Старт 01.02.2013
//
// Функция формирует табличный документ
// 
// Параметры:
// РежимПечати - Тип: Текст. Режим печати документа.
// 
// ВозвращаемоеЗначение:
// ТабДокумент - Тип: ТабличныйДокумент. Сформированный табличный документ.
//
Функция СформироватьТабличныйДокументНаСервере(РежимПечати = "Все")
	
	ТабДокумент = РегистрыСведений.СомнительныеСитуации.Печать(НачалоДня(Период.ДатаНачала), КонецДня(Период.ДатаОкончания), РежимПечати);
	
	Возврат ТабДокумент;
	
КонецФункции
 //Костенюк Александр-Финиш 01.02.2013

&НаКлиенте
//Костенюк Александр-Старт 12.11.2012
// 
// Процедура печати сомнительных ситуаций
//
Процедура Печать(Команда)
	
	ТабДокумент = СформироватьТабличныйДокументНаСервере();
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, , , НСтр("ru='Сомнительные ситуации';uk='Сумнівні ситуації'"));
	
КонецПроцедуры
//Костенюк Александр-Финиш 12.11.2012

&НаКлиенте
//Костенюк Александр-Старт 29.03.2013
// 
// Процедура печати неподтвержденных сомнительных ситуаций
//
Процедура ПечатьНеподтвержденные(Команда)
	
	ТабДокумент = СформироватьТабличныйДокументНаСервере("Неподтвержденные");
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, , , НСтр("ru='Неподтвержденные сомнительные ситуации';uk='Непідтверджені сумнівні ситуації'"));
	
КонецПроцедуры
//Костенюк Александр-Финиш 29.03.2013

&НаКлиенте
//Костенюк Александр-Старт 29.03.2013
// 
// Процедура печати подтвержденных сомнительных ситуаций
//
Процедура ПечатьПодтвержденные(Команда)
	
	ТабДокумент = СформироватьТабличныйДокументНаСервере("Подтвержденные");
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, , , НСтр("ru='Подтвержденные сомнительные ситуации';uk='Підтверджені сумнівні ситуації'"));
	
КонецПроцедуры
//Костенюк Александр-Финиш 29.03.2013

