
&НаКлиенте
Процедура ПриИзмененииАктуальностиПраваДоступаОбъектов(Элемент, ПраваДоступаОбъектов) Экспорт

	Реквизит = Сред(Элемент.Имя, 21); ТекущиеДанные = __РаботаСДиалогамиКлиентСервер.ПолучитьРодителя(Элемент, "ТаблицаФормы").ТекущиеДанные;
	
	// Актуальность.
	__РаботаСДаннымиКлиентСервер.ИзменитьПравилаАктуальностиПодчиненных(Элемент, ПраваДоступаОбъектов, Реквизит, Ложь);
	
	// Родитель.
	РодительДанные = ТекущиеДанные.ПолучитьРодителя();
	Если (Не РодительДанные = Неопределено) Тогда
		ПодчиненныеЭлементыРодителя = РодительДанные.ПолучитьЭлементы(); 
		
		Итог = 0; Для Каждого ПодчиненныеДанные Из ПодчиненныеЭлементыРодителя Цикл Итог = Итог + ПодчиненныеДанные[Реквизит]; КонецЦикла; 
		РодительДанные[Реквизит] = (ПодчиненныеЭлементыРодителя.Количество() = Итог);
		
	КонецЕсли; 

КонецПроцедуры // ПриИзмененииАктуальностиПраваДоступаОбъектов()

&НаКлиенте
Процедура ПриИзмененииРазделенияПраваДоступаОбъектов(Элемент, ПраваДоступаОбъектов) Экспорт

	Реквизит = Сред(Элемент.Имя, 21); ТекущиеДанные = __РаботаСДиалогамиКлиентСервер.ПолучитьРодителя(Элемент, "ТаблицаФормы").ТекущиеДанные;
	
	// Разделение.
	Если Не ЗначениеЗаполнено(ТекущиеДанные[Реквизит]) Тогда
		ТекущиеДанные[Реквизит] = ПредопределенноеЗначение("Перечисление.ПраваДоступаПользователей.Запретить");
	КонецЕсли; 
	
	РодительДанные =ТекущиеДанные.ПолучитьРодителя();
	Если (Не РодительДанные = Неопределено) Тогда
		ПодчиненныеЭлементыРодителя = РодительДанные.ПолучитьЭлементы(); 
		
		СоответсвиеРазделение = Новый Соответствие;
		Для Каждого ПодчиненныеДанные Из ПодчиненныеЭлементыРодителя Цикл СоответсвиеРазделение.Вставить(ПодчиненныеДанные[Реквизит]); КонецЦикла;
		Если (СоответсвиеРазделение.Количество() - 1) Тогда
			РодительДанные[Реквизит] = Неопределено;
		Иначе
			Для Каждого ЭлементСоответсвия Из СоответсвиеРазделение Цикл РодительДанные[Реквизит] = ЭлементСоответсвия.Ключ КонецЦикла;
		КонецЕсли; 
		
		
	Иначе
		РодительДанные = ТекущиеДанные;
		
		// Родитель.
		ПодчиненныеЭлементыРодителя = РодительДанные.ПолучитьЭлементы(); 
		Для Каждого ПодчиненныеДанные Из ПодчиненныеЭлементыРодителя Цикл ПодчиненныеДанные[Реквизит] = РодительДанные[Реквизит]; КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры // ПриИзмененииРазделенияПраваДоступаОбъектов()
