
//	1С:Touch. Touch-ориентированные элементы управления и диалоговые формы, 
//	построенные с использованием только стандартных элементов управления платформы.
//	Copyright (C) 2008-2010 Переверзев Александр Владимирович.
//
//	Это программа является свободным программным обеспечением. Вы можете 
//	распространять и/или модифицировать её согласно условиям Стандартной 
//	Общественной Лицензии GNU, опубликованной Фондом Свободного Программного 
//	Обеспечения, версии 3 или, по Вашему желанию, любой более поздней версии. 
//
//	Эта программа распространяется в надежде, что она будет полезной, но БЕЗ 
//	ВСЯКИХ ГАРАНТИЙ, в том числе подразумеваемых гарантий ТОВАРНОГО СОСТОЯНИЯ ПРИ 
//	ПРОДАЖЕ и ГОДНОСТИ ДЛЯ ОПРЕДЕЛЁННОГО ПРИМЕНЕНИЯ. Смотрите Стандартную 
//	Общественную Лицензию GNU для получения дополнительной информации. 
//
//	Вы должны были получить копию Стандартной Общественной Лицензии GNU вместе 
//	с программой. В случае её отсутствия, посмотрите <http://www.gnu.org/licenses/>.


// Зависимости:
//	Обработки.TouchПредупреждение,
//	Обработки.TouchТабличноеПоле.

#Если Клиент Тогда

// Функция выбора значений из переданного набора значений.
//
// Параметры:
//	Заголовок - Строка. Заголовок диалога выбора строки;
//	НачальноеЗначение - ЭлементСпискаЗначений, СтрокаТаблицыЗначений, СтрокаДереваЗначений. Начальная значение (будет выделенно при открытии диалога);
//	Данные - СписокЗначений, ТаблицаЗначений, ДеревоЗначений. Набор значений из которой осуществляется выбор искомого значения;
//	Колонки - Строка. Перечень отображаемых колонок данных;
//	CallBackФорма - Форма. Форма содержащая callback-процедуры вызов которых будет осуществляется данной обработкой;
//	CallBackПрефикс - Строка. Стандартный префикс содержащийся в именах callback-процедур формы вызов которых будет осуществляется данной обработкой.
//
// Возвращаемое значение:
//	Неопределено, ЭлементСпискаЗначений, СтрокаТаблицыЗначений, СтрокаДереваЗначений. Выбранный элемент из переданного набора данных. Если выбор не осуществлен, возвращает Неопределено.
//
// События:
//	ПриИзмененииДанных() - возникает после связывания табличного поля с переданым набором значений и созданием требумых колонок до размещения элемента на форме.
//		В теле процедуры-обработчика допускается любая перенастройка элемента вплоть до связвания с иным набором значений и созданием другой коллекции колонок.
//		После выхода из процедуры-обработчика настройки выравнивания и обработчиков-событий табличного поля будут принудительно приведены в соответсвие с настройками для корректного функционирования формы;
//	Выбор(ВыбраннаяСтрока, Колонка, СтандартнаяОбработка) - возникает при выборе строки табличного поля пользователем:
//		- ВыбраннаяСтрока - ЭлементСпискаЗначений, СтрокаТаблицыЗначений, СтрокаДереваЗначений. Выбранная строка табличного поля;
//		- Колонка - ОбработкаОбъект.TouchКолонкаТабличногоПоля. Выбранная колонка табличного поля;
//		- СтандартнаяОбработка - Булево. В данный параметр передается признак выполнения стандартной обработки события.
//				Если в теле процедуры-обработчика установить данному параметру значение Ложь, стандартная обработка события производиться не будет;
//	ПриВыводеСтроки(ОформлениеСтроки, ДанныеСтроки) - возникает при выводе строки в табличном поле. В процедуре-обработчике события допускается изменение оформления как строки в целом, так и каждой ячейке в отдельности:
//		- Оформление строки - ОбработкаОбъект.TouchОформлениеСтроки. Содержит оформление строки и коллекцию оформлений ячеек;
//		- ДанныеСтроки - ЭлементСпискаЗначений, СтрокаТаблицыЗначений, СтрокаДереваЗначений. Данные выводимой строки. Параметр соответствует свойству ТекущиеДанные для выводимой строки. 
//
// Описание:
//	В случае если функции передается не пустой параметр CallBackФорма, то по мере работы с формой вызываются callback-процедуры соответсвующих событий.
//	Предпологается, что все callback-процедуры-обработчики описаны согласно следующему правилу:
//		<CallBackПрефикс><Событие>(Элемент[, Праметры]) Экспорт
//	И соответвенно могут быть вызваны записью вида:
//		<CallBackФорма>.<CallBackПрефикс><Событие>(Элемент[, Праметры]);
//	При этом в первый параметр всегда передается элемент формы обработки, типа ОбработкаОбъект.TouchТабличноеПоле, используемый для работы с переданным набором значений.
//	В процедуре-обработчике события допускаеются любые разумные манипуляции с переданым элементом формы обработки и его данными.
//
Функция ВыборЗначения(Заголовок = "", НачальноеЗначение = Неопределено,
				      Данные, Колонки = "", ТолькоВыбор = Истина, CallBackФорма = Неопределено, CallBackПрефикс = "Поиск") Экспорт
	
	// Проверка входных параметров.
	
	// TODO: Проверка входных параметров.
	
	// Открываем форму ввода.
	Форма = ЭтотОбъект.ПолучитьФорму("Форма");
	Форма.Значение = НачальноеЗначение;
	Если Не ПустаяСтрока(Заголовок) Тогда
		Форма.Заголовок = Заголовок;
	КонецЕсли;
	Форма.Данные = Данные;
	Форма.Колонки = Колонки;
	Форма.CallBackФорма = CallBackФорма;
	Форма.CallBackПрефикс = CallBackПрефикс;
	
	// Ввод значения.
	ПараметрЗакрытия = Форма.ОткрытьМодально();
	Если (ТипЗнч(ПараметрЗакрытия) = Тип("Булево")) Тогда
		Возврат Форма.Результат;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ВыборЗначения()

#КонецЕсли

#Если Клиент Тогда

// Функция выбора значений из переданного набора значений.
//
// Параметры:
//	Заголовок - Строка. Заголовок диалога выбора строки;
//	НачальноеЗначение - ЭлементСпискаЗначений, СтрокаТаблицыЗначений, СтрокаДереваЗначений. Начальная значение (будет выделенно при открытии диалога);
//	Данные - СписокЗначений, ТаблицаЗначений, ДеревоЗначений. Набор значений из которой осуществляется выбор искомого значения;
//	Колонки - Строка. Перечень отображаемых колонок данных;
//	CallBackФорма - Форма. Форма содержащая callback-процедуры вызов которых будет осуществляется данной обработкой;
//	CallBackПрефикс - Строка. Стандартный префикс содержащийся в именах callback-процедур формы вызов которых будет осуществляется данной обработкой.
//
// Возвращаемое значение:
//	Неопределено, ЭлементСпискаЗначений, СтрокаТаблицыЗначений, СтрокаДереваЗначений. Выбранный элемент из переданного набора данных. Если выбор не осуществлен, возвращает Неопределено.
//
// События:
//	ПриИзмененииДанных() - возникает после связывания табличного поля с переданым набором значений и созданием требумых колонок до размещения элемента на форме.
//		В теле процедуры-обработчика допускается любая перенастройка элемента вплоть до связвания с иным набором значений и созданием другой коллекции колонок.
//		После выхода из процедуры-обработчика настройки выравнивания и обработчиков-событий табличного поля будут принудительно приведены в соответсвие с настройками для корректного функционирования формы;
//	Выбор(ВыбраннаяСтрока, Колонка, СтандартнаяОбработка) - возникает при выборе строки табличного поля пользователем:
//		- ВыбраннаяСтрока - ЭлементСпискаЗначений, СтрокаТаблицыЗначений, СтрокаДереваЗначений. Выбранная строка табличного поля;
//		- Колонка - ОбработкаОбъект.TouchКолонкаТабличногоПоля. Выбранная колонка табличного поля;
//		- СтандартнаяОбработка - Булево. В данный параметр передается признак выполнения стандартной обработки события.
//				Если в теле процедуры-обработчика установить данному параметру значение Ложь, стандартная обработка события производиться не будет;
//	ПриВыводеСтроки(ОформлениеСтроки, ДанныеСтроки) - возникает при выводе строки в табличном поле. В процедуре-обработчике события допускается изменение оформления как строки в целом, так и каждой ячейке в отдельности:
//		- Оформление строки - ОбработкаОбъект.TouchОформлениеСтроки. Содержит оформление строки и коллекцию оформлений ячеек;
//		- ДанныеСтроки - ЭлементСпискаЗначений, СтрокаТаблицыЗначений, СтрокаДереваЗначений. Данные выводимой строки. Параметр соответствует свойству ТекущиеДанные для выводимой строки. 
//
// Описание:
//	В случае если функции передается не пустой параметр CallBackФорма, то по мере работы с формой вызываются callback-процедуры соответсвующих событий.
//	Предпологается, что все callback-процедуры-обработчики описаны согласно следующему правилу:
//		<CallBackПрефикс><Событие>(Элемент[, Праметры]) Экспорт
//	И соответвенно могут быть вызваны записью вида:
//		<CallBackФорма>.<CallBackПрефикс><Событие>(Элемент[, Праметры]);
//	При этом в первый параметр всегда передается элемент формы обработки, типа ОбработкаОбъект.TouchТабличноеПоле, используемый для работы с переданным набором значений.
//	В процедуре-обработчике события допускаеются любые разумные манипуляции с переданым элементом формы обработки и его данными.
//
Функция ВыборЗначений(Заголовок = "", НачальноеЗначение = Неопределено,
				      Данные, Колонки = "", ТолькоВыбор = Истина, CallBackФорма = Неопределено, CallBackПрефикс = "Поиск") Экспорт
	
	// Проверка входных параметров.
	
	// TODO: Проверка входных параметров.
	
	// Открываем форму ввода.
	Форма = ЭтотОбъект.ПолучитьФорму("Форма");
	Форма.Значение = НачальноеЗначение;
	Если Не ПустаяСтрока(Заголовок) Тогда
		Форма.Заголовок = Заголовок;
	КонецЕсли;
	Форма.Данные = Данные;
	Форма.Колонки = Колонки;
	Форма.CallBackФорма = CallBackФорма;
	Форма.CallBackПрефикс = CallBackПрефикс;
	
	// Ввод значения.
	ПараметрЗакрытия = Форма.ОткрытьМодально();
	Если (ТипЗнч(ПараметрЗакрытия) = Тип("Булево")) Тогда
		Возврат Форма.Результат;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ВыборЗначения()

#КонецЕсли
