   
   // Записывает версию объекта в регистр сведений
   // Параметры
   // Ссылка        - СправочникСсылка / ДокументСсылка - ссылка на объект ИБ
   // ЧислоВерсийОбъекта - Число - число версий объекта
   // ХранилищеДанных - ХранилищеЗначения - хранилище с объектом ИБ (сериализованным в Fast InfoSet)
   //
   Процедура ЗаписатьВерсиюОбъекта(знач Ссылка,
	   знач ЧислоВерсийОбъекта,
	   знач ХранилищеДанных) Экспорт
	   
	   УстановитьПривилегированныйРежим(Истина);
	 
	   МенеджерЗаписиВерсииОбъектов = РегистрыСведений.ВерсииОбъектов.СоздатьМенеджерЗаписи();
	   МенеджерЗаписиВерсииОбъектов.Объект        = Ссылка;
	   МенеджерЗаписиВерсииОбъектов.ДатаВерсии    = ТекущаяДата();
	   МенеджерЗаписиВерсииОбъектов.ВерсияОбъекта = ХранилищеДанных;
	   МенеджерЗаписиВерсииОбъектов.НомерВерсии   = Число(ЧислоВерсийОбъекта) + 1;
	   МенеджерЗаписиВерсииОбъектов.АвторВерсии   = глЗначениеПеременной("глТекущийПользователь");
	   
	   МенеджерЗаписиВерсииОбъектов.КомпьютерВерсии = ПараметрыСеанса.ТекущийКомпьютер;  //ПолучитьСерверТО().ПолучитьКомпьютерТО();
	   Попытка
		   МенеджерЗаписиВерсииОбъектов.Записать();
	   Исключение
		   Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	   КонецПопытки; 
   КонецПроцедуры
