
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Владелец.
	Если (Не ЗначениеЗаполнено(Владелец)) И (Не ЗначениеЗаполнено(ПолучитьСвойство(ДанныеЗаполнения, "Владелец"))) Тогда
		Владелец = Справочники.КлассификаторСтранМира.ОсновнаяСтрана();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// ТелефонныеКода.
	__УправлениеКонтактнойИнформациейСервер.ТелефонныеКодаОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	// Удаляем значения некопируемых реквизитов.
	Если Не ОбъектКопирования.ПометкаУдаления Тогда
		Наименование = Неопределено;
		ТелефонныеКода.Очистить();
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	// КраткийСостав.
	__УправлениеДаннымиСервер.УстановитьКраткийСостав(ЭтотОбъект, "КраткийСоставСпарвочника", ТелефонныеКода, , "Код");
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)

	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// ТелефонныеКода.
	__УправлениеКонтактнойИнформациейСервер.ТелефонныеКодаПриЗаписи(Отказ);
	
КонецПроцедуры // ПриЗаписи()
