
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	Объект.Загружать 	= Истина;
	Объект.Адрес 		= ЭтотОбъект.ПолучитьАдрес();
	Объект.Пользователь = ЭтотОбъект.ПолучитьПользователя();
	Объект.Пароль 		= ЭтотОбъект.ПолучитьПароль();
	Объект.Каталог 		= ЭтотОбъект.ПолучитьКаталог();
	Элементы.Кодировка.СписокВыбора.ЗагрузитьЗначения(ЭтотОбъект.ЗаполнитьСписокКодировок());
	Объект.Кодировка 	= Элементы.Кодировка.СписокВыбора[0];
	Объект.УдалятьФайлы = Истина;
	УстановитьДоступностьНаСервере();
КонецПроцедуры
 
&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.Заголовок					    = "Выберите каталог";
	ДиалогВыбораФайла.ПредварительныйПросмотр		= Ложь;
	ДиалогВыбораФайла.Фильтр                        = "Файлы dbf (*.dbf)|*.dbf";
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	= Ложь;
	ДиалогВыбораФайла.МножественныйВыбор            = Ложь;  
	ДиалогВыбораФайла.Каталог 						= Объект.Каталог;
	Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	Объект.Каталог = РаботаСФайлами.НормализоватьКаталог(ДиалогВыбораФайла.Каталог);
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьПриИзменении(Элемент)
	Объект.УдалятьФайлы = Объект.Загружать;
	УстановитьДоступностьНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьНаСервере()
	Элементы.Адрес.Доступность 			= Объект.Загружать;
	Элементы.Пользователь.Доступность 	= Объект.Загружать;
	Элементы.Пароль.Доступность 		= Объект.Загружать;
	Элементы.УдалятьФайлы.Доступность 	= Объект.Загружать;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ВыполнитьОбработкуНаСервере();
	ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ВыполнитьОбработку(Объект.Загружать, Объект.Адрес, Объект.Пользователь, Объект.Пароль, Объект.Каталог, Объект.Кодировка, Объект.ПолноеОбновление, Объект.УдалятьФайлы);
КонецПроцедуры

