
//	1С:Touch. Touch-ориентированные элементы управления и диалоговые формы, 
//	построенные с использованием только стандартных элементов управления платформы.
//	Copyright (C) 2008-2010 Переверзев Александр Владимирович.
//
//	Это программа является свободным программным обеспечением. Вы можете 
//	распространять и/или модифицировать её согласно условиям Стандартной 
//	Общественной Лицензии GNU, опубликованной Фондом Свободного Программного 
//	Обеспечения, версии 3 или, по Вашему желанию, любой более поздней версии. 
//
//	Эта программа распространяется в надежде, что она будет полезной, но БЕЗ 
//	ВСЯКИХ ГАРАНТИЙ, в том числе подразумеваемых гарантий ТОВАРНОГО СОСТОЯНИЯ ПРИ 
//	ПРОДАЖЕ и ГОДНОСТИ ДЛЯ ОПРЕДЕЛЁННОГО ПРИМЕНЕНИЯ. Смотрите Стандартную 
//	Общественную Лицензию GNU для получения дополнительной информации. 
//
//	Вы должны были получить копию Стандартной Общественной Лицензии GNU вместе 
//	с программой. В случае её отсутствия, посмотрите <http://www.gnu.org/licenses/>.


#Если Клиент Тогда

// Инициализация значений по умолчанию.

// -- Вверх.
Попытка Вверх = БиблиотекаКартинок.TouchВверх; Исключение Вверх = Новый Картинка; КонецПопытки;
// -- Влево.
Попытка Влево = БиблиотекаКартинок.TouchВлево; Исключение Влево = Новый Картинка; КонецПопытки;
// -- Вниз.
Попытка Вниз = БиблиотекаКартинок.TouchВниз; Исключение Вниз = Новый Картинка; КонецПопытки;
// -- Вправо.
Попытка Вправо = БиблиотекаКартинок.TouchВправо; Исключение Вправо = Новый Картинка; КонецПопытки;

// -- Полностью вверх.
Попытка ПолностьюВверх = БиблиотекаКартинок.TouchПолностьюВверх; Исключение ПолностьюВверх = Новый Картинка; КонецПопытки;
// -- Полностью влево.
Попытка ПолностьюВлево = БиблиотекаКартинок.TouchПолностьюВлево; Исключение ПолностьюВлево = Новый Картинка; КонецПопытки;
// -- Полностью вниз.
Попытка ПолностьюВниз = БиблиотекаКартинок.TouchПолностьюВниз; Исключение ПолностьюВниз = Новый Картинка; КонецПопытки;
// -- Полностью вправо.
Попытка ПолностьюВправо = БиблиотекаКартинок.TouchПолностьюВправо; Исключение ПолностьюВправо = Новый Картинка; КонецПопытки;

// -- Пометка истина.
Попытка ИерархияЭлеменит = БиблиотекаКартинок.TouchИерархияЭлеменит; Исключение ИерархияЭлеменит = Новый Картинка; КонецПопытки;
// -- Пометка истина просмотр.
Попытка ИерархияГруппа = БиблиотекаКартинок.TouchИерархияГруппа; Исключение ИерархияГруппа = Новый Картинка; КонецПопытки;
// -- Пометка ложь.
Попытка ИерархияРодитель = БиблиотекаКартинок.TouchИерархияРодитель; Исключение ИерархияРодитель = Новый Картинка; КонецПопытки;

// -- Пометка истина.
Попытка ПометкаИстина = БиблиотекаКартинок.TouchПометкаИстина; Исключение ПометкаИстина = Новый Картинка; КонецПопытки;
// -- Пометка истина просмотр.
Попытка ПометкаИстинаПросмотр = БиблиотекаКартинок.TouchПометкаИстинаПросмотр; Исключение ПометкаИстинаПросмотр = Новый Картинка; КонецПопытки;
// -- Пометка ложь.
Попытка ПометкаЛожь = БиблиотекаКартинок.TouchПометкаЛожь; Исключение ПометкаЛожь = Новый Картинка; КонецПопытки;
// -- Пометка ложь просмотр.
Попытка ПометкаЛожьПросмотр = БиблиотекаКартинок.TouchПометкаЛожьПросмотр; Исключение ПометкаЛожьПросмотр = Новый Картинка; КонецПопытки;
// -- Пометка неопределено.
Попытка ПометкаНеопределено = БиблиотекаКартинок.TouchПометкаНеопределено; Исключение ПометкаНеопределено = Новый Картинка; КонецПопытки;
// -- Пометка неопределено просмотр.
Попытка ПометкаНеопределеноПросмотр = БиблиотекаКартинок.TouchПометкаНеопределеноПросмотр; Исключение ПометкаНеопределеноПросмотр = Новый Картинка; КонецПопытки;


// Инициализация по единым стандартам.
Попытка Выполнить("Touch.БиблиотекаКартинок(ЭтотОбъект)"); Исключение КонецПопытки;

#КонецЕсли
		