
&НаКлиенте
Процедура УстановитьВидимость()
	
	// Командная панель.
	Элементы.ПодробныйРежим.Пометка = ПодробныйРежим;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ПодробныйРежим(Команда)
	
	ПодробныйРежим = Не ПодробныйРежим;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПодробныйРежим()


&НаКлиенте
Процедура ВладелецПриАктивизацииСтроки(Элемент)
	
	__РаботаСДиалогамиКлиентСервер.ВладелецСпискаПриИзменении(Список, Элементы.Владелец);
	
КонецПроцедуры // ВладелецПриАктивизацииСтроки()


&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)

	//__ИнтерактивноеУправлениеДаннымиКлиент.АктуальностьСправочникаПриАктивизацииЯчейки(Элемент); //Костенюк Александр-Закомментировано 31.03.2014
	
КонецПроцедуры	// СписокПриАктивизацииЯчейки()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Владелец.
	__РаботаСДиалогамиКлиентСервер.ВладелецСпискаПриСоздании(Список, Элементы.Владелец, Справочники.Рестораны.ОсновнойРесторан());
	
	// Режим выбора.
	РежимВыбора = __РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список, 
		"ПодробныйРежим, ИндексАктуальности,ПериодДействия,ПредставлениеОборудования,Комментарий,Код");
	Элементы.Список.ВертикальныеЛинии = Не РежимВыбора;	
	Элементы.Список.ГоризонтальныеЛинии = Не РежимВыбора;	
	Элементы.Список.ЧередованиеЦветовСтрок = Не РежимВыбора;
	Элементы.Список.Шапка = Не РежимВыбора;	

КонецПроцедуры // ПриСозданииНаСервере()

