
&НаКлиенте
//Перем ТекущийЭлементСписка; //Костенюк Александр-Закомментировано 14.08.2013


&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)

	//Костенюк Александр-Закомментировано 14.08.2013
	// При таком алгоритме слетает флаг актуальности, при открытии элемента справочника из отчета по продажам
	//Если (Элемент.ТекущийЭлемент = Элементы.ИндексАктуальности) Тогда
	//	Если (ТекущийЭлементСписка = Неопределено) Тогда
	//		Элемент.ТекущийЭлемент = Элементы.Наименование;
	//	Иначе
	//		Элемент.ТекущийЭлемент = ТекущийЭлементСписка;
	//	КонецЕсли;
	//	
	//	Если Не __РаботаСДиалогамиКлиентСервер.СтрокаГруппировкиДинамическогоСписка(Элемент) Тогда
	//	
	//		__РаботаСДаннымиКлиентСервер.УстановитьАктуальность(Элемент.ТекущаяСтрока);
	//		Элемент.Обновить();
	//		
	//	КонецЕсли; 

	//КонецЕсли; 
	//ТекущийЭлементСписка = Элемент.ТекущийЭлемент;
	
КонецПроцедуры	// СписокПриАктивизацииЯчейки()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Режим выбора.
	__РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список);
	
	// Настойка формы.
	РежимВыбора = Элементы.Список.РежимВыбора;
	Элементы.ИндексАктуальности.Видимость = Не РежимВыбора;
	Элементы.РежимРаботы.Видимость = Не РежимВыбора;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
//Костенюк Александр-Старт 14.08.2013
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ИндексАктуальности" Тогда
		СтандартнаяОбработка = Ложь;
		__ИнтерактивноеУправлениеДаннымиКлиент.АктуальностьСправочникаПриАктивизацииЯчейки(Элемент);
	КонецЕсли;
КонецПроцедуры
//Костенюк Александр-Финиш 14.08.2013
