
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Параметры.
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
	// Режим выбора.
	__РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список, 
		"ГруппаДата,ИндексАктуальности,Дата,АстрономическаяДата");
	
	// Настройка формы.
	РежимВыбора = Элементы.Список.РежимВыбора;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриПовторномОткрытии()

	// Параметры.
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
КонецПроцедуры // ПриПовторномОткрытии()
