
&НаСервере
Процедура СформироватьТелефонныеКода(Отказ) Экспорт
	
	// Выборка.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КлассификаторСтранМираТелефонныеКода.Код КАК Поле1,
	                      |	КлассификаторСтранМираТелефонныеКода.Ссылка КАК СтранаМира
	                      |ИЗ
	                      |	Справочник.КлассификаторСтранМира.ТелефонныеКода КАК КлассификаторСтранМираТелефонныеКода
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	NULL,
	                      |	Константы.ОсновнойГород.Владелец
	                      |ИЗ
	                      |	Константы КАК Константы
	                      |ГДЕ
	                      |	(НЕ Константы.ОсновнойГород = ЗНАЧЕНИЕ(Справочник.КлассификаторГородов.ПустаяСсылка))
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Поле1");
				   
	НаборЗаписей = СоздатьНаборЗаписей();			   
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Отказ = Истина;
		// TODO: Сообщение об ошибке.
	КонецПопытки;
	
КонецПроцедуры // СформироватьТелефонныеКода()