
Функция ПолучитьВидДисконтнойКарты(Тип, Диск = 0) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Диск", Диск);
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВидыДисконтныхКарт.Ссылка
	               |ИЗ
	               |	Справочник.ВидыДисконтныхКарт КАК ВидыДисконтныхКарт
	               |ГДЕ
	               |	ВидыДисконтныхКарт.Диск = &Диск";
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Если Выборка.Следующий() Тогда
		Ссылка = Выборка.Ссылка;
	Иначе 
		Ссылка = Справочники.ВидыДисконтныхКарт.ПустаяСсылка();
	КонецЕсли; 
		
	ИзменитьЭлементСправочника(Тип, Диск , Ссылка );
	
	Возврат Ссылка;
	
КонецФункции
          
Процедура ИзменитьЭлементСправочника(Тип, Диск = 0, ССылка = Неопределено)			
	
	Если ССылка.Пустая() Тогда	
		
		НовыйСправочник = Справочники.ВидыДисконтныхКарт.СоздатьЭлемент();
		НовыйСправочник.УстановитьНовыйКод();
		НовыйСправочник.Наименование = "Дисконтная " + Строка(Диск);
		НовыйСправочник.ПометкаУдаления = ?(Тип = 2, Истина, Ложь);
		НовыйСправочник.Диск = Диск;	
		
		Попытка
			НовыйСправочник.ОбменДанными.Загрузка =Истина;
			НовыйСправочник.Записать();		
		Исключение
			
		КонецПопытки;
		
	Иначе 	
		
		НовыйСправочник = Ссылка.ПолучитьОбъект();	
		НовыйСправочник.Диск  = Диск;
		НовыйСправочник.ПометкаУдаления = ?(Тип = 2, Истина, Ложь);	
		
		Попытка
			НовыйСправочник.ОбменДанными.Загрузка = Истина;
			НовыйСправочник.Записать();		
		Исключение
						
		КонецПопытки;
		
	КонецЕсли;	
	
	Ссылка = НовыйСправочник.Ссылка;
	
КонецПроцедуры

//Костенюк Александр-Старт 17.10.2013
Функция НайтиВидКарты(Диск) Экспорт
	
	Возврат Справочники.ВидыДисконтныхКарт.НайтиПоРеквизиту("Диск", Диск);
	
КонецФункции
//Костенюк Александр-Финиш 17.10.2013
