
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ТипМонетарности = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(ТипМонетарности, Перечисления.ТипыМонетарности.НеИспользуется);
	
	Если (Не ТипМонетарности = Перечисления.ТипыМонетарности.НеИспользуется) Тогда
		__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, "Оплата");
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПередЗаписью(Отказ)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	// Нормализация.
	Если Не ЭтоГруппа Тогда
		
		OnLine = Не Локальная;
		ТипМонетарности = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(ТипМонетарности, Перечисления.ТипыМонетарности.НеИспользуется);
		ТипКарты = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(ТипКарты, Перечисления.ТипыИнформационныхКарт.Дисконтная); //Костенюк Александр 17.06.2014
		
		Если (ТипМонетарности = Перечисления.ТипыМонетарности.НеИспользуется) Тогда
			Накопительная = Ложь;
			Оплата = Неопределено;
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Рефакторинг:
//	1. Удалить и перенести в другое место "Диск";
//	2. Переименовать "СкидкаПоУсловию" в "Условная";
//	3. Удалить предопределенный элемент.
