
Функция ОсновнаяСтрана() Экспорт
	
	Результат = Справочники.КлассификаторГородов.ОсновнойГород();
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат.Владелец;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                      |	КлассификаторСтранМира.Ссылка
	                      |ИЗ
	                      |	Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КлассификаторСтранМира.ПометкаУдаления,
	                      |	КлассификаторСтранМира.Наименование");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.КлассификаторСтранМира.ПустаяСсылка();

КонецФункции // ОсновнаяСтрана()

Функция КоличествоСтранБолееОдной() Экспорт
	
	Запрос = новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КлассификаторСтранМира.Ссылка) КАК Количество
	                      |ИЗ
	                      |	Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира");
						  
	Возврат (Запрос.Выполнить().Выгрузить()[0].Количество > 1);

КонецФункции // КоличествоСтранБолееОдной()
