
&НаСервере
Процедура НастроитьФорму()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ВидСобытия = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Объект.ВидСобытия, Перечисления.ВидыСобытий.ЧерныйСписокДобавление);
	Иначе	
		Если РегистрыСведений.ЧерныйСписокКонтрагентов.ПолучитьВхождениеКонтрагента(Объект.Контрагент) Тогда
			Объект.ВидСобытия = Перечисления.ВидыСобытий.ЧерныйСписокУдаление;
		Иначе
			Объект.ВидСобытия = Перечисления.ВидыСобытий.ЧерныйСписокДобавление;
		КонецЕсли;
	КонецЕсли; 
	
	Если (Объект.ВидСобытия = Перечисления.ВидыСобытий.ЧерныйСписокДобавление) Тогда
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Заголовок = НСтр("ru = 'Добавление в «черний» список'; uk = 'Додавання в «чорний» список'");
		Иначе
			Заголовок = НСтр("ru = 'Добавить в «черний» список'; uk = 'Додати в «чорний» список'");
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Заголовок = НСтр("ru = 'Удаление из «черного» списока'; uk = 'Видалення з «чорного» списку'");
		Иначе
			Заголовок = НСтр("ru = 'Удалить из «черного» списока'; uk = 'Видалити з «чорного» списку'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Параметры.
	Объект.Контрагент = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Объект.Контрагент, Параметры.Контрагент);
	
	// Настройка формы.
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		НастроитьФорму();
	КонецЕсли; 
	
	Элементы.Дата.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.Ресторан.Видимость = Справочники.Рестораны.КоличествоАктуальныхРесторановБолееОдного() Или (Не ЗначениеЗаполнено(Объект.Ресторан));
	Элементы.ГруппаОтветственный.Видимость = Элементы.Дата.Видимость;
	Элементы.Разделитель.Видимость = Не Элементы.ГруппаОтветственный.Видимость;
	
	Элементы.Комментарий.Высота = 4 + (Не Элементы.Дата.Видимость) + (Не Элементы.Ресторан.Видимость);
	
	Элементы.Отмена.Видимость = Не Элементы.Дата.Видимость;
	Элементы.Закрыть.Видимость = Элементы.Дата.Видимость;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
		Объект.Контрагент = ОткрытьФормуМодально("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
		
		Отказ = Не ЗначениеЗаполнено(Объект.Контрагент);
		
		// Настройка формы.
		Если Не Отказ Тогда
			НастроитьФорму();
		КонецЕсли; 
		
	КонецЕсли; 
		
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	__УправлениеДаннымиКлиент.ОповеститьИзменениеЧерногоСпискаКонтрагентов();
	
КонецПроцедуры // ПослеЗаписи()
