
Функция ПолучитьНаименование(Объект) Экспорт

	Если ЗначениеЗаполнено(Объект.ТипКомнаты) Тогда
		Возврат Шаблон("[ТипКомнаты] № [Номер]", 
			Новый Структура("ТипКомнаты,Номер", Объект.ТипКомнаты, Объект.Номер));
	КонецЕсли; 
	
	Возврат "№ " + Объект.Номер; 
		
КонецФункции // ПолучитьНаименование()

Функция ПолучитьОчереднойКод(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	МАКСИМУМ(Комнаты.Номер) КАК Код
		|ИЗ
		|	Справочник.Комнаты КАК Комнаты
		|ГДЕ
		|	НЕ Комнаты.Ссылка = &Ссылка");
	Если (Объект = Неопределено) Тогда
		Запрос.УстановитьПараметр("Ссылка", Неопределено);
	Иначе
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	КонецЕсли; 	
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Код) Тогда
		Возврат Выборка.Код + 1;
	КонецЕсли;
	
	Возврат 1;
	
КонецФункции // ПолучитьОчереднойКод()
