
Функция ОсновнойГород() Экспорт
	
	Результат = Константы.ОсновнойГород.Получить();
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                      |	КлассификаторГородов.Ссылка
	                      |ИЗ
	                      |	(ВЫБРАТЬ ПЕРВЫЕ 1
	                      |		КлассификаторГородов.Ссылка КАК Ссылка,
	                      |		КлассификаторГородов.Ранг КАК Ранг
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			КлассификаторУлиц.Владелец КАК Ссылка,
	                      |			КОЛИЧЕСТВО(КлассификаторУлиц.Ссылка) КАК Ранг
	                      |		ИЗ
	                      |			Справочник.КлассификаторУлиц КАК КлассификаторУлиц
	                      |		ГДЕ
	                      |			НЕ КлассификаторУлиц.ЭтоГруппа
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			КлассификаторУлиц.Владелец) КАК КлассификаторГородов
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ ПЕРВЫЕ 1
	                      |		КлассификаторГородов.Ссылка,
	                      |		-1
	                      |	ИЗ
	                      |		Справочник.КлассификаторГородов КАК КлассификаторГородов
	                      |	ГДЕ
	                      |		НЕ КлассификаторГородов.ЭтоГруппа
	                      |	
	                      |	УПОРЯДОЧИТЬ ПО
	                      |		Ранг УБЫВ,
	                      |		Ссылка) КАК КлассификаторГородов
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КлассификаторГородов.Ранг УБЫВ,
	                      |	КлассификаторГородов.Ссылка.ПометкаУдаления,
	                      |	КлассификаторГородов.Ссылка.Наименование");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.КлассификаторГородов.ПустаяСсылка();

КонецФункции // ОсновнойГород()

Функция КоличествоГородовБолееОдного() Экспорт
	
	Запрос = новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КлассификаторГородов.Ссылка) КАК Количество
	                      |ИЗ
	                      |	Справочник.КлассификаторГородов КАК КлассификаторГородов
	                      |ГДЕ
	                      |	НЕ КлассификаторГородов.ЭтоГруппа");
						  
	Возврат (Запрос.Выполнить().Выгрузить()[0].Количество > 1);

КонецФункции // КоличествоГородовБолееОдного()
