 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.НачалоПериода = НачалоДня(ТекущаяДата());
	Объект.КонецПериода = КонецДня(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	ПараметрыПериода = Новый Структура;
	ПараметрыПериода.Вставить("ДатаНачала", Объект.НачалоПериода);
	ПараметрыПериода.Вставить("ДатаОкончания", Объект.КонецПериода);
	ПараметрыПериода.Вставить("ИнтервалПериод", Истина);	
	РедактированиеПериода = ПолучитьФорму("ОбщаяФорма.РедактированиеПериода", ПараметрыПериода, ЭтаФорма);
	Если РедактированиеПериода.Открыта() Тогда
		РедактированиеПериода.Активизировать();
	Иначе
		РедактированиеПериода.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПериодИзменен" Тогда
		Объект.НачалоПериода = Параметр.ДатаНачала;
		Объект.КонецПериода = КонецДня(Параметр.ДатаОкончания);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ВыполнитьОбработкуНаСервере();
	ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ВыполнитьОбработку(Объект.Ресторан, НачалоДня(Объект.НачалоПериода), КонецДня(Объект.КонецПериода));
КонецПроцедуры
