
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если (ВидФормы = "ФормаСписка") Или (ВидФормы = "ФормаВыбора") Тогда
		
		Модуль = ПолучитьСвойство(Параметры, "ТекущаяСтрока", Документы.СписаниеТоваров.ПустаяСсылка()).Модуль;
		Если Не ЗначениеЗаполнено(Модуль) Тогда
			Если Параметры.Свойство("Отбор") Тогда
				Модуль = ПолучитьСвойство(Параметры.Отбор, "Модуль"); 
			КонецЕсли; 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Модуль) Тогда
			
			Если (Модуль = Перечисления.МодулиИПодсистемы.Ресторан) Тогда
				Уникальность = "-Ресторан";
			КонецЕсли; 
			Если (Модуль = Перечисления.МодулиИПодсистемы.Доставка) Тогда
				Уникальность = "-Доставка";
			КонецЕсли; 
			
			Если Параметры.Свойство("Отбор") Тогда
				Параметры.Отбор.Вставить("Модуль", Модуль);
			Иначе
				Параметры.Вставить("Отбор", Новый Структура("Модуль", Модуль));
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПолученияФормы()
