
Процедура СгенерироватьСоответствия() Экспорт
	
	Очистить();
	
	// Генерация соответсвий.
	МассивСоответсвий = Новый Массив; Количество = Pow(10, Метаданные().Измерения.Номер.Тип.КвалификаторыЧисла.Разрядность);
	Для Индекс = 0 По Количество - 1 Цикл 
		МассивСоответсвий.Добавить(Индекс);
	КонецЦикла;
		
	ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел(ТекущаяДата() - '00010101000000');
	
	Для Индекс = 0 По Количество - 1 Цикл 
		
		ИндексСоответсвия = ГенераторСлучайныхЧисел.СлучайноеЧисло(0, Количество - Индекс - 1);
		
		Запись = Добавить();
		Запись.Номер = Индекс;
		Запись.НомерСокращенный = МассивСоответсвий[ИндексСоответсвия];
		
		МассивСоответсвий.Удалить(ИндексСоответсвия);
		
	КонецЦикла;
	
КонецПроцедуры // СгенерироватьСоответствия()
