
Процедура ОповеститьИзменениеАктуализацииМеню() Экспорт
	
	Оповестить("АктуализацияМеню");
	
КонецПроцедуры // ОповеститьИзменениеАктуализацииМеню()

Процедура ОповеститьИзменениеМодификаторовУсловий() Экспорт
	
	Оповестить("МодификаторыУсловия");
	
КонецПроцедуры // ОповеститьИзменениеМодификаторовУсловий()

Процедура ОповеститьИзменениеРаспределениеНоменклатуры(Справочник) Экспорт
	
	Оповестить("РаспределениеНоменклатуры", Справочник);
	
КонецПроцедуры // ОповеститьИзменениеРаспределениеНоменклатуры()

Процедура ОповеститьИзмененияНастроекРабочихЦентров() Экспорт
	
	Оповестить("НастройкаРабочихЦентров");
	
КонецПроцедуры // ОповеститьИзмененияНастроекРабочихЦентров()

Процедура ОповеститьИзменениеЧерногоБелогоСписка() Экспорт
	
	Оповестить("ЧерныйБелыйСписко");
	
КонецПроцедуры // ПроверитьОповещениеЧерногоБелогоСписка()

Процедура ОповеститьИзменениеЧерногоСпискаКонтрагентов() Экспорт
	
	Оповестить("ЧерныйСпискоКонтрагентов");
	
КонецПроцедуры // ОповеститьИзменениеЧерногоСпискаКонтрагентов()

Процедура ОповеститьИзменениеЗаказаПокупателя(Документ) Экспорт
	
	Оповестить("ЗаказПокупателя", Документ);
	
КонецПроцедуры // ОповеститьИзменениеЗаказаПокупателя()

Процедура ОповеститьИзменениеСтиля() Экспорт
	
	Оповестить("Стиль");
	
КонецПроцедуры // ОповеститьИзменениеСтиля()
