
&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	__РаботаСДиалогамиКлиентСервер.ВладелецСпискаПриИзменении(Список, Владелец);
	
КонецПроцедуры // ВладелецПриИзменении()


&НаКлиенте
Процедура OK(Команда)
	
	Закрыть(Элементы.Список.ТекущаяСтрока);

КонецПроцедуры // OK()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверка.
	Если (Параметры.Справочник = "Меню") Тогда
		Отказ = (Не Параметры.Номенклатура.ЭтоГруппа) И (Не Параметры.Номенклатура.ИспользуетсяТоварами);
	КонецЕсли; 
	Если (Параметры.Справочник = "МодификаторыНоменклатуры") Тогда
		Отказ = (Не Параметры.Номенклатура.ЭтоГруппа) И (Не Параметры.Номенклатура.ИспользуетсяМодификаторами);
	КонецЕсли; 
	Если (Параметры.Справочник = "УсловияНоменклатуры") Тогда
		Отказ = (Не Параметры.Номенклатура.ЭтоГруппа) И (Не Параметры.Номенклатура.ИспользуетсяУсловиями);
	КонецЕсли;
	
	Если Не Отказ Тогда
			
		// Список.
		Список.ОсновнаяТаблица = "Справочник." + Параметры.Справочник;
		
		Если (Параметры.Справочник = "Меню") Тогда
				
			// Владелец.
			Владелец = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(
				__РаботаСДиалогамиКлиентСервер.ПолучитьВладелецаСписка(Список, Элементы.Список), 
				Справочники.ВидыМеню.ОсновнойВидМеню());
			
			// Владелец.
			__РаботаСДиалогамиКлиентСервер.ВладелецСпискаПриСоздании(Список, Элементы.Владелец, Владелец);
			
		Иначе
			
			Элементы.ГруппаВладелец.Видимость = Ложь;
			
		КонецЕсли;
	
		// Настройка формы.
		Заголовок = Метаданные.Справочники[Параметры.Справочник].Синоним;
		
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()
