
Процедура ПроверитьСоставОбщегоРеквизитаУзелИсточникСоставПланОбмена(Сообщение) Экспорт

	Сообщение = "Сравнение составов плана обмена и использования общего реквизита:"+Символы.ПС;
	
	Использовать = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать;
	
	мОР_Состав = Новый Массив;
	мПО_Состав = Новый Массив;
	
	ОР_Состав = Метаданные.ОбщиеРеквизиты.УзелИсточник.Состав;
	ПО_Состав = Метаданные.ПланыОбмена.ОбменДанными2K_CRS.Состав;
		                                                        
	Для каждого ЭлСостава Из ОР_Состав Цикл
		Если ЭлСостава.Использование = Использовать Тогда
			мОР_Состав.Добавить(ЭлСостава.Метаданные)
		КонецЕсли;
	КонецЦикла;
	Для каждого ЭлСостава Из ПО_Состав Цикл
		Если Не ОбщегоНазначения.ЭтоРегистр(ЭлСостава.Метаданные)
			И Не ОбщегоНазначения.ЭтоКонстанта(ЭлСостава.Метаданные) Тогда
			мПО_Состав.Добавить(ЭлСостава.Метаданные)
		КонецЕсли;
	КонецЦикла;
	
	Если мОР_Состав.Количество() = мПО_Состав.Количество() Тогда
		Сообщение = Сообщение + "Количество совпадает ( и равно "+Формат(мОР_Состав.Количество(), "ЧГ=")+" шт. )"
	Иначе	
		Сообщение = Сообщение + "Количество не совпадает ( и равно ПО:"+Формат(мПО_Состав.Количество(), "ЧГ=")+" шт. ОР:"+Формат(мОР_Состав.Количество(), "ЧГ=")+" шт.)"
	КонецЕсли;
	
	КоличествоИтераций = мОР_Состав.Количество();
	
	Пока КоличествоИтераций > 0 Цикл
		
		КоличествоИтераций = КоличествоИтераций - 1;
		ЭлСостава = мОР_Состав[КоличествоИтераций];
		Найден = мПО_Состав.Найти(ЭлСостава);
		Если Не Найден = Неопределено Тогда
			мОР_Состав.Удалить(КоличествоИтераций);
			мПО_Состав.Удалить(Найден);
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоИтераций = мПО_Состав.Количество();
	
	Пока КоличествоИтераций > 0 Цикл
		
		КоличествоИтераций = КоличествоИтераций - 1;
		ЭлСостава = мПО_Состав[КоличествоИтераций];
		Найден = мОР_Состав.Найти(ЭлСостава);
		Если Не Найден = Неопределено Тогда
			мПО_Состав.Удалить(КоличествоИтераций);
			мОР_Состав.Удалить(Найден);
		КонецЕсли;
		
	КонецЦикла;
	
	Если мПО_Состав.Количество() Тогда
		Сообщение = Сообщение + Символы.ПС + "Есть элементы состава плана обмена не вошедшие в состав общего реквизита ( "+Формат(мПО_Состав.Количество(), "ЧГ=")+" шт. )";
		Для каждого ЭлСостава Из мПО_Состав Цикл
			Сообщение = Сообщение + Символы.ПС + ": " + Строка(ЭлСостава)
		КонецЦикла;
	Иначе
		Сообщение = Сообщение + Символы.ПС + "Отсутствуют элементы состава плана обмена не вошедшие в состав общего реквизита"
	КонецЕсли;
	
	Если мОР_Состав.Количество() Тогда
		Сообщение = Сообщение + Символы.ПС + "Есть элементы состава общего реквизита не вошедшие в состав плана обмена ( "+Формат(мОР_Состав.Количество(), "ЧГ=")+" шт. )";
		Для каждого ЭлСостава Из мОР_Состав Цикл
			Сообщение = Сообщение + Символы.ПС + ": " + Строка(ЭлСостава)
		КонецЦикла;
	Иначе
		Сообщение = Сообщение + Символы.ПС + "Отсутствуют элементы состава общего реквизита не вошедшие в состав плана обмена"
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУзелИсточникДляОбъекта(Источник, МетаданныеОбъекта, Отказ) Экспорт

	Если Отказ Тогда Возврат КонецЕсли;
	ИспользованиеРеквизитаУзелИсточникПоПолномуИмени = Неопределено;
	ОбменДаннымиПравилаИсточников = ПараметрыСеанса.ОбменДаннымиПравилаИсточников.Получить();
	Если Не ОбменДаннымиПравилаИсточников.Свойство("ИспользованиеРеквизитаУзелИсточникПоПолномуИмени", ИспользованиеРеквизитаУзелИсточникПоПолномуИмени) Тогда
		Возврат
	КонецЕсли;
	Использование = ИспользованиеРеквизитаУзелИсточникПоПолномуИмени.Получить(МетаданныеОбъекта.ПолноеИмя());
	
	Если Использование = Неопределено Или Использование = Ложь Тогда Возврат КонецЕсли;
	
	ЭтотУзел = ОбменДаннымиПравилаИсточников.ЭтотУзел;
	
	Если Источник.УзелИсточник.Пустая() Тогда
	
		Источник.УзелИсточник = ЭтотУзел;
    
	КонецЕсли;

	Если Источник.ОбменДанными.Загрузка И Источник.УзелИсточник.Пустая() Тогда
	
		Источник.УзелИсточник = Источник.ОбменДанными.Отправитель;	
	
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка И Источник.УзелИсточник = ЭтотУзел Тогда
	
		Источник.УзелИсточник = Источник.ОбменДанными.Отправитель;	
	
	ИначеЕсли Источник.ОбменДанными.Загрузка И Источник.УзелИсточник <> ЭтотУзел Тогда
	
		Источник.УзелИсточник = ЭтотУзел;	
	
	КонецЕсли;
	
	//УзелИсточник = Источник.УзелИсточник;
	
КонецПроцедуры

Процедура ОбменДаннымиПередЗаписьюОбъектаОбменаПередЗаписью(Источник, Отказ, ВидОбъектаИсточника)
	
	ЭтотУзел = ПланыОбмена.ОбменДанными2K_CRS.ЭтотУзел();
	МетаданныеОбъекта = Источник.Метаданные();
	УзелИсточник = ПланыОбмена.ОбменДанными2K_CRS.ПустаяСсылка();
	ЭтоНовыйОбъект = Ложь;
	Если Не ВидОбъектаИсточника = "РегистрыСведений" Тогда
		ЭтоНовыйОбъект = Источник.ЭтоНовый();	
		//УстановитьУзелИсточникДляОбъекта(Источник, ЭтоНовыйОбъект, МетаданныеОбъекта, ЭтотУзел, УзелИсточник, Отказ);
	КонецЕсли;	
	//ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменДанными2K_CRS", Источник, Отказ);
	Возврат;
	ПроцедурыОбменаДаннымиFrontOffice_Restoran.ЗарегистрироватьИзменения(Источник, ВидОбъектаИсточника, ЭтоНовыйОбъект, МетаданныеОбъекта, ЭтотУзел, УзелИсточник);
	
КонецПроцедуры

Процедура ОбменДанными_FrontOffice_Restoran_ПередЗаписьюСправочникаПередЗаписью(Источник, Отказ) Экспорт
	Возврат;
	ОбменДаннымиПередЗаписьюОбъектаОбменаПередЗаписью(Источник, Отказ, "Справочники")	
КонецПроцедуры

Процедура ОбменДанными_FrontOffice_Restoran_ПередЗаписьюДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Возврат;
	ОбменДаннымиПередЗаписьюОбъектаОбменаПередЗаписью(Источник, Отказ, "Документы")	
КонецПроцедуры

Процедура ОбменДанными_FrontOffice_Restoran_ПередЗаписьюРегистраСведенийПередЗаписью(Источник, Отказ, Замещение) Экспорт
	Возврат;
	//Если Источник.Количество() = 0 Тогда
	//	Возврат	
	//КонецЕсли;
	
	ЭтотУзел = ПланыОбмена.ОбменДанными2K_CRS.ЭтотУзел();
	МетаданныеОбъекта = Источник.Метаданные();
	//ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменДанными2K_CRS", Источник, Отказ);
	//ПроцедурыОбменаДаннымиFrontOffice_Restoran.ЗарегистрироватьИзмененияРегистраСведений(Источник, ВидОбъектаИсточника, ЭтоНовыйОбъект, МетаданныеОбъекта, ЭтотУзел);

	ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	
	НастройкиСвязейМеждуБазамиРС = ПроцедурыОбменаДаннымиFrontOffice_Restoran.ПолучитьНастройкиДляВидаОбъекта(ПолноеИмяОбъекта, ЭтотУзел);

    Если НастройкиСвязейМеждуБазамиРС.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	//Если Не НеобходимоЗарегистрироватьИзмененияДляОбъекта(Объект, ПолноеИмяОбъекта, ЭтотУзел, УзелИсточник) Тогда
	//	Возврат;
	//КонецЕсли;
	
	МассивУзлов = ПроцедурыОбменаДаннымиFrontOffice_Restoran.ПолучитьМассивУзловДляРегистрации();
	
	Если МассивУзлов.Количество() Тогда   
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, Источник);
	КонецЕсли;

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////
// Обработчики событий подписок для плана обмена "ОбменДанными2K_CRS"

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью
//
Процедура ОбменВРаспределеннойСтруктуреЦРСЗарегистрироватьИзменение(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменДанными2K_CRS", Источник, Отказ);
	
КонецПроцедуры

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента
//
Процедура ОбменВРаспределеннойСтруктуреЦРСЗарегистрироватьИзменениеДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ОбменДанными2K_CRS", Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюКонстанты
//
Процедура ОбменВРаспределеннойСтруктуреЦРСЗарегистрироватьИзменениеКонстанты(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюКонстанты("ОбменДанными2K_CRS", Источник, Отказ);
	
КонецПроцедуры

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра
//
Процедура ОбменВРаспределеннойСтруктуреЦРСЗарегистрироватьИзменениеНабораЗаписей(Источник, Отказ, Замещение) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменДанными2K_CRS", Источник, Отказ, Замещение);
	
КонецПроцедуры

// Описание см. в ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением
//
Процедура ОбменВРаспределеннойСтруктуреЦРСЗарегистрироватьУдаление(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменДанными2K_CRS", Источник, Отказ);
	
КонецПроцедуры
