
Функция ПроверитьУникальностьДокумента(Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ПланПродаж.Ссылка
	              |ИЗ
	              |	Документ.ПланПродаж КАК ПланПродаж
	              |ГДЕ
	              |	ПланПродаж.Проведен
	              |	И ПланПродаж.Ресторан = &Ресторан
	              |	И НАЧАЛОПЕРИОДА(ПланПродаж.ДатаПланирования, ДЕНЬ) = &ДатаПланирования
	              |	И ПланПродаж.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Ресторан", Объект.Ресторан);
	Запрос.УстановитьПараметр("ДатаПланирования", НачалоДня(Объект.ДатаПланирования));
	
	// Новый документ
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПланПродаж.Ссылка <> &Ссылка", "ИСТИНА");
	Иначе
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции
