
&НаКлиенте
Процедура УстановитьДоступность()
	
	// Элементы.
	Элементы.Сохранить.Доступность = Не ПустаяСтрока(Картинка);
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Функция ОткрытьКартинку(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Открыть";
	ДиалогВыбораФайла.Фильтр = "Точечные рисунки|*.bmp;*.dib|EMF|*.emf|GIF|*.gif|ICO|*.ico|JPEG|*.jpg;*.jpeg;*.jpe;*.jfif|PNG|*.png|TIFF|*.tif;*.tiff|WMF|*.wmf|Все файлы изображений|*.bmp;*.dib;*.emf;*.gif;*.ico;*.jpg;*.jpeg;*.png;*.tif;*.tiff;*.wmf|Все файлы|*";
	ДиалогВыбораФайла.ИндексФильтра = 8;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		Если Не ПустаяСтрока(Картинка) Тогда
			УдалитьИзВременногоХранилища(Картинка); Картинка = Неопределено;
		КонецЕсли;
		ПоместитьФайл(Картинка, ДиалогВыбораФайла.ПолноеИмяФайла, , Ложь, УникальныйИдентификатор);
		
		Файл = СтрЗаменить(ДиалогВыбораФайла.ПолноеИмяФайла, ДиалогВыбораФайла.Каталог, "");
		Если ПустаяСтрока(Объект.Наименование) Или (СокрЛП(НРег(Объект.Наименование) = Файл)) Тогда
			Объект.Наименование = Файл;
		КонецЕсли;
		Объект.Файл = Файл;
		
		Модифицированность = Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	// Настройка формы.
	УстановитьДоступность();
	
	Возврат Истина;
	
КонецФункции // ОткрытьКартинку() 

&НаКлиенте
Процедура СохранитьКартинку(Команда)

	ПолучитьФайл(Картинка, Объект.Файл, Истина);

КонецПроцедуры // СохранитьКартинку()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Автовыор картинки.
	Если ПустаяСтрока(Картинка) Тогда
		Отказ = Не ОткрытьКартинку(Неопределено);
	КонецЕсли;
	
	// Настройка формы.
	УстановитьДоступность();
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Изображение.
	Картинка = ПоместитьВоВременноеХранилище(ТекущийОбъект.Изображение.Получить(), УникальныйИдентификатор);
	
КонецПроцедуры  // ПриЧтенииНаСервере()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Изображение.
	ТекущийОбъект.Изображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Картинка), Новый СжатиеДанных(9));
	
КонецПроцедуры // ПередЗаписьюНаСервере()
