
// Функция возвращает признак можно ли пользователю изменять цены в расходных накладных или нет.
//
// Возвращаемое значение:
//  Истина. Если операция доступна.
//
Функция РазрешитьРедактированиеЦенВДокументах() Экспорт

	Возврат Истина;
	
	// TODO: Реализовать функцию.
	
	//СписокФильтров = УправлениеПользователями.ПолучитьЗначениеПраваДляТекущегоПользователя(ПланыВидовХарактеристик.ПраваПользователей.РедактированиеЦенВДокументах, Ложь);

	//Если СписокФильтров.Количество() = 0 Тогда
	//	Возврат Ложь;
	//ИначеЕсли СписокФильтров.Количество() > 1 Тогда
	//	Возврат Истина;
	//Иначе
	//	Возврат СписокФильтров[0].Значение;
	//КонецЕсли;

КонецФункции // РазрешитьРедактированиеЦенВДокументах()

Функция РазрешитьРедактированиеСкидокВДокументах() Экспорт

	Возврат Истина;
	
	// TODO: Реализовать функцию.
	
	//СписокФильтров = УправлениеПользователями.ПолучитьЗначениеПраваДляТекущегоПользователя(ПланыВидовХарактеристик.ПраваПользователей.РедактированиеЦенВДокументах, Ложь);

	//Если СписокФильтров.Количество() = 0 Тогда
	//	Возврат Ложь;
	//ИначеЕсли СписокФильтров.Количество() > 1 Тогда
	//	Возврат Истина;
	//Иначе
	//	Возврат СписокФильтров[0].Значение;
	//КонецЕсли;

КонецФункции // РазрешитьРедактированиеЦенВДокументах()

// Функция возвращает признак можно ли пользователю изменять признаки распечатанности и выполненности в документах или нет.
//
// Возвращаемое значение:
//  Истина. Если операция доступна.
//
Функция РазрешитьРедактированиеСостоянийНоменклатурыДокументах(Документ) Экспорт

	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.ПолныеПрава) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции // РазрешитьРедактированиеСостоянийНоменклатурыДокументах()

Функция РазрешитьВыполненияОтчетаОбработки(Отчет) Экспорт

	Возврат НастройкаПравДоступа.ОпределитьДоступностьВыполненияОтчетаОбработки(Отчет);

КонецФункции // РазрешитьВыполненияОтчетаОбработки()

