
&НаКлиенте
Процедура УстановитьДоступность()
	
	Редактирование = Запись.Использовать;
	
	// Элементы.
	Элементы.URL.Доступность = Редактирование;
	Элементы.ИмяПользователя.Доступность = Редактирование;
	Элементы.Пароль.Доступность = Редактирование;
	Элементы.ВидСертификата.Доступность = Редактирование;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ИспользоватьПриИзменении(Элемент)
	
	// Настройка формы.
	УстановитьДоступность();

КонецПроцедуры // ВебСервисИспользоватьПриИзменении()


&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	// Подавление проверки.
	Если Не Запись.Использовать Тогда
		ПроверяемыеРеквизиты.Очистить();	
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Подмена объекта формы.
	ЗаписьНастроек = РегистрыСведений.НастройкиСервисаPodarIm.СоздатьМенеджерЗаписи();	
	ЗаписьНастроек.Прочитать();
	Если ЗаписьНастроек.Выбран() Тогда
		ЗначениеВДанныеФормы(ЗаписьНастроек, Запись);
	КонецЕсли;
	
	// Заголовок.
	Заголовок = Метаданные.РегистрыСведений.НастройкиСервисаPodarIm.ПредставлениеЗаписи;

КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Модальный режим.
	Если Не МодальныйРежим Тогда
		ОткрытьФормуМодально("РегистрСведений.НастройкиСервисаPodarIm.ФормаЗаписи");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Настройка формы.
	УстановитьДоступность();
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Признак приостановки сервера печати.
	ЗаписьНастроек = РегистрыСведений.НастройкиСервисаPodarIm.СоздатьМенеджерЗаписи();	

	// Удаление записи.
	Если Не Отказ Тогда
		ЗаписьНастроек.Удалить();
	КонецЕсли;

КонецПроцедуры // ПередЗаписьюНаСервере()
