
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Ссылка.Пустая() Тогда
		Если Не Справочники.ПроизводственныеГруппы.ПроверитьМаксимальноеКоличествоЭлементов() Тогда
			__ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru = 'Превышен предел количества элементов справочника'; uk = 'Перевищено межа кількості елементів довідника'"), ЭтотОбъект, ,, Отказ);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПередЗаписью(Отказ)

	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Поиск.
	УстановитьПривилегированныйРежим(Истина);
	
	Поиск = Ссылка.Поиск;
	Если ПустаяСтрока(Поиск) Тогда
		МаксимальноеКоличество = Справочники.ПроизводственныеГруппы.ПолучитьМаксимальноеКоличествоЭлементов();
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ПроизводственныеГруппы.Поиск
		                      |ИЗ
		                      |	Справочник.ПроизводственныеГруппы КАК ПроизводственныеГруппы");
		МассивИспользованнхЗначений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Поиск");
		
		Для Индекс = 0 По МаксимальноеКоличество - 1 Цикл
			Поиск = __ОбщегоНазначенияКлиентСервер.ПеревестиИзДесятичной(Индекс, 36, 2);
			Если (МассивИспользованнхЗначений.Найти(Поиск) = Неопределено) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)

	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Запись комбинаций.
	Справочники.КомбинацииПроизводственныхГрупп.СформироватьКомбинацииГрупп(Отказ, ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи()


