
Процедура ПередНачаломРаботыСистемы(Отказ)
	
	// Сервер печати.
	Если Не Отказ Тогда
		Если __СерверПечатиКлиент.РежимЗапускаПриложенияСерверПечати() Тогда
			__СерверПечатиКлиент.ПередНачаломРаботыСистемы(Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПередНачаломРаботыСистемы()

Процедура ПриНачалеРаботыСистемы()
	
	// Сервер печати.
	Если __СерверПечатиКлиент.РежимЗапускаПриложенияСерверПечати() Тогда
		__СерверПечатиКлиент.ПриНачалеРаботыСистемы();
		Возврат;
	КонецЕсли;
	
	// МониторМоментальныхПоказателей.
	//ПолучитьФорму("Обработка.МониторМоментальныхПоказателей.Форма.Форма").Открыть();
	
КонецПроцедуры // ПриНачалеРаботыСистемы()

Процедура ПередЗавершениемРаботыСистемы(Отказ)
	
	// Сервер печати.
	Если Не Отказ Тогда
		Если __СерверПечатиКлиент.РежимЗапускаПриложенияСерверПечати() Тогда
			__СерверПечатиКлиент.ПередЗавершениемРаботыСистемы(Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПередЗавершениемРаботыСистемы()

Процедура ПриЗавершенииРаботыСистемы()
	
	// Сервер печати.
	Если __СерверПечатиКлиент.РежимЗапускаПриложенияСерверПечати() Тогда
		__СерверПечатиКлиент.ПриЗавершенииРаботыСистемы(); 
		Возврат;
	КонецЕсли;

КонецПроцедуры // ПриЗавершенииРаботыСистемы()
