
// Установка параметров сеанса.
//
Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)

	//.. Начало изменения Dim)on  23 октября 2013 г. 14:29:49
	//
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	//
	//.. Конец изменения Dim)on  23 октября 2013 г. 14:29:50
	
	// Веб-сервис или сервер печати.
	Если __ВебСервисСервер.РежимЗапускаПриложенияВебСервис() Или
		 __СерверПечатиСервер.РежимЗапускаПриложенияСерверПечати() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСеанса.ОбщиеЗначения = Новый ХранилищеЗначения(Новый Структура, Новый СжатиеДанных(0));
	
	ПолныеПрава.УстановитьПараметрыСеанса();			

КонецПроцедуры // УстановкаПараметровСеанса()
