
&НаКлиенте
Процедура Сформировать(Команда)
	
	ОбновитьОтчет();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтчет()
	
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Авто);
	
	// Удаление области "Кол во"
	ОбластьКолВо = Результат.НайтиТекст("Кол во");
	Если НЕ ОбластьКолВо = Неопределено Тогда
		ОбластьКолВоВерх = ОбластьКолВо.Верх;
		ОбластьКолВоНиз = ОбластьКолВо.Низ;
		Результат.УдалитьОбласть(Результат.Область("R"+Строка(ОбластьКолВоВерх)+":R"+Строка(ОбластьКолВоНиз)),ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
	// Объединение горизонтальных областей с одинаковым названием 
	ОбластьНоменклатура = Результат.НайтиТекст("Номенклатура");
	Для ТекСтрока = ОбластьНоменклатура.Верх По ОбластьНоменклатура.Низ Цикл 
		ТекТекст = "";
		ИндексНачала = 2;
		СтрокаОбласти = "R"+Строка(ТекСтрока)+"C¤1¤:R"+Строка(ТекСтрока)+"C¤2¤";
		Для ТекКолонка = 2 По Результат.ШиринаСтраницы Цикл 
			ТекОбласть = Результат.Область(Локализация.СтрокаШаблон(СтрокаОбласти, Строка(ТекКолонка), Строка(ТекКолонка)));
			Если НЕ ТекТекст = ТекОбласть.Текст Тогда 
				Если ТекКолонка - 1 > ИндексНачала Тогда 
					Результат.Область(Локализация.СтрокаШаблон(СтрокаОбласти, Строка(ИндексНачала), Строка(ТекКолонка-1))).Объединить();
				КонецЕсли;
				ТекТекст = ТекОбласть.Текст;
				ИндексНачала = ТекКолонка;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

