
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Структура = Новый Структура("ЗакрыватьПриВыборе,ЗакрыватьПриЗакрытииВладельца,ЗначениеКопирования,ЗначенияЗаполнения,Ключ,КлючНазначенияИспользования,Основание,ПараметрыФункциональныхОпций,ТолькоПросмотр,ЭтоГруппа");
	ЗаполнитьЗначенияСвойств(Структура, Параметры);
	
	Если (Объект.ТипКарты = Перечисления.ТипыИнформационныхКарт.Дисконтная) Тогда
		ИмяФормыПеренаправления = "ФормаЭлементаДисконтнаяКарта";
		ПараметрыПеренаправления = Новый ФиксированнаяСтруктура(Структура);
	ИначеЕсли (Объект.ТипКарты = Перечисления.ТипыИнформационныхКарт.Регистрационная) Тогда
		ИмяФормыПеренаправления = "ФормаЭлементаРегистрационнаяКарта";
		ПараметрыПеренаправления = Новый ФиксированнаяСтруктура(Структура);
	Иначе
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	
	Если МодальныйРежим Тогда
		Закрыть(ОткрытьФормуМодально("Справочник.ИнформационныеКарты.Форма." + ИмяФормыПеренаправления, __ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ПараметрыПеренаправления), ВладелецФормы));
	Иначе
		ОткрытьФорму("Справочник.ИнформационныеКарты.Форма." + ИмяФормыПеренаправления, __ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ПараметрыПеренаправления), ВладелецФормы, УникальныйИдентификатор, Окно);
	КонецЕсли; 
	
КонецПроцедуры // ПриОткрытии()
