
&НаКлиенте
Процедура УстановитьДоступность()
	
	// Элементы.
	Элементы.БелыйСписокНоменклатурыУчетКоличества.Доступность = Запись.БелыйСписокНоменклатурыИспользовать;
	Элементы.ЧерныйСписокНоменклатурыУчетКоличества.Доступность = Запись.ЧерныйСписокНоменклатурыИспользовать;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ПриИзменении(Элемент)
	
	// Зависимые значения.
	Запись.БелыйСписокНоменклатурыУчетКоличества = Запись.БелыйСписокНоменклатурыУчетКоличества И Запись.БелыйСписокНоменклатурыИспользовать;
	Запись.ЧерныйСписокНоменклатурыУчетКоличества = Запись.ЧерныйСписокНоменклатурыУчетКоличества И Запись.ЧерныйСписокНоменклатурыИспользовать;
	
	// Настройка формы.
	УстановитьДоступность();
	
КонецПроцедуры // ПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Подмена объекта формы.
	ЗаписьНастроек = РегистрыСведений.НастройкаПараметровУчета.СоздатьМенеджерЗаписи();	
	ЗаписьНастроек.Прочитать();
	Если ЗаписьНастроек.Выбран() Тогда
		ЗначениеВДанныеФормы(ЗаписьНастроек, Запись);
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Модальный режим.
	Если Не МодальныйРежим Тогда
		ОткрытьФормуМодально("РегистрСведений.НастройкаПараметровУчета.ФормаЗаписи");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Настройка формы.
	УстановитьВидимость(); //Костенюк Александр 12.04.2016
	УстановитьДоступность();
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Признак приостановки сервера печати.
	ЗаписьНастроек = РегистрыСведений.НастройкаПараметровУчета.СоздатьМенеджерЗаписи();	

	// Удаление записи.
	Если Не Отказ Тогда
		ЗаписьНастроек.Удалить();
	КонецЕсли;

КонецПроцедуры // ПередЗаписьюНаСервере()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Сброс повторно используемых значений.
	ОбновитьПовторноИспользуемыеЗначения();	
	
	// Обновление интерфейса.
	ОбновитьИнтерфейс();
	
КонецПроцедуры // ПослеЗаписи()

//Костенюк Александр-Старт 12.04.2016
&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ГруппаУчетРабочегоВремени.Видимость = Запись.УчетРабочегоВремениИспользовать;
	
КонецПроцедуры // УстановитьВидимость()
//Костенюк Александр-Финиш 12.04.2016

//Костенюк Александр-Старт 12.04.2016
&НаКлиенте
Процедура ОрганизацииУчетРабочегоВремениИспользоватьПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры
//Костенюк Александр-Финиш 12.04.2016
