
&НаКлиенте
Процедура РасширенныеНастройки(Команда)
	
	// Настройка формы.
	РасширенныеНастройкиНаСервере(Истина, Истина);
	
КонецПроцедуры // РасширенныеНастройки()

&НаСервере
Процедура РасширенныеНастройкиНаСервере(Режим, Полный = Ложь)
	
	// Настройка формы.
	Если Режим Тогда
	
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		
		Элементы.ГруппаРасширенныеНастройкиДополнительная.ОтображатьЗаголовок = Ложь;
		Элементы.ГруппаРасширенныеНастройкиДополнительная.Отображение = ОтображениеОбычнойГруппы.Нет;
		
		Если Полный Тогда
			Элементы.ГруппаНастройкиПользователей.Видимость = Истина;
			Элементы.ГруппаДополнительныеПраваПользователей.Видимость = Истина;
			Элементы.ГруппаПраваДоступаОбъектов.Видимость = Истина;
			Элементы.ГруппаПраваДоступаПользователей.Видимость = Истина;
		КонецЕсли;
		
		Элементы.ГруппаРасширенныеНастройки.Видимость = (Не Элементы.ГруппаНастройкиПользователей.Видимость) Или
														(Не Элементы.ГруппаПраваДоступаОбъектов.Видимость) Или
														(Не Элементы.ГруппаПраваДоступаПользователей.Видимость);

	Иначе
	
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		
		Элементы.ГруппаРасширенныеНастройкиДополнительная.ОтображатьЗаголовок = Истина;
		Элементы.ГруппаРасширенныеНастройкиДополнительная.Отображение = ОтображениеОбычнойГруппы.Линия;
		
		Элементы.ГруппаНастройкиПользователей.Видимость = Ложь;
		Элементы.ГруппаДополнительныеПраваПользователей.Видимость = Ложь;
		Элементы.ГруппаПраваДоступаОбъектов.Видимость = Ложь;
		Элементы.ГруппаПраваДоступаПользователей.Видимость = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры // РасширенныеНастройкиНаСервере()


&НаКлиенте
Процедура ДополнительныеПраваПользователейФлажокПриИзменении(Элемент)
	
	Элементы.ДополнительныеПраваПользователей.ТекущиеДанные.Значение = Элементы.ДополнительныеПраваПользователей.ТекущиеДанные.Флажок;
	Элементы.ДополнительныеПраваПользователей.ТекущиеДанные.Актуальность = Элементы.ДополнительныеПраваПользователей.ТекущиеДанные.Значение;
	
КонецПроцедуры // ДополнительныеПраваПользователейФлажокПриИзменении()

&НаКлиенте
Процедура ДополнительныеПраваПользователейЗначениеПриИзменении(Элемент)
	
	Элементы.ДополнительныеПраваПользователей.ТекущиеДанные.Актуальность = ЗначениеЗаполнено(Элементы.ДополнительныеПраваПользователей.ТекущиеДанные.Значение);
	
КонецПроцедуры // ДополнительныеПраваПользователейЗначениеПриИзменении()

&НаКлиенте
Процедура НастройкиПользователейФлажокПриИзменении(Элемент)
	
	Элементы.НастройкиПользователей.ТекущиеДанные.Значение = Элементы.НастройкиПользователей.ТекущиеДанные.Флажок;
	Элементы.НастройкиПользователей.ТекущиеДанные.Актуальность = Элементы.НастройкиПользователей.ТекущиеДанные.Значение;
	
КонецПроцедуры // НастройкиПользователейФлажокПриИзменении()

&НаКлиенте
Процедура НастройкиПользователейЗначениеПриИзменении(Элемент)
	
	Элементы.НастройкиПользователей.ТекущиеДанные.Актуальность = ЗначениеЗаполнено(Элементы.НастройкиПользователей.ТекущиеДанные.Значение);
	
КонецПроцедуры // НастройкиПользователейЗначениеПриИзменении()

&НаКлиенте
Процедура ПраваДоступаПользователейАктуальностьПриИзменении(Элемент)

	// Актуальность.
	__РаботаСДаннымиКлиентСервер.ИзменитьПравилаАктуальностиПодчиненных(Элемент, ПраваДоступаПользователей);
	
КонецПроцедуры // ПраваДоступаПользователейАктуальностьПриИзменении()

&НаКлиенте
Процедура ПраваДоступаОбъектовАктуальностьПриИзменении(Элемент)

	ПользователиКлиент.ПриИзмененииАктуальностиПраваДоступаОбъектов(Элемент, ПраваДоступаОбъектов);

КонецПроцедуры // ПраваДоступаОбъектовАктуальностьПриИзменении()

&НаКлиенте
Процедура ПраваДоступаОбъектовРазделениеПриИзменении(Элемент)

	ПользователиКлиент.ПриИзмененииРазделенияПраваДоступаОбъектов(Элемент, ПраваДоступаОбъектов);
	
КонецПроцедуры // ПраваДоступаОбъектовАктуальностьПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Параметры.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Параметры.
	Если ЗначениеЗаполнено(ПолучитьСвойство(Параметры, "ЗначениеКопирования")) Тогда
		ОбъектЗаполнения = Параметры.ЗначениеКопирования;
	Иначе
		ОбъектЗаполнения = ТекущийОбъект;
	КонецЕсли; 
	РегистрыСведений.НастройкиПользователей.ПолучитьНастройкиПользователей(ОбъектЗаполнения, НастройкиПользователей);
	РегистрыСведений.ЗначенияДополнительныхПравПользователя.ПолучитьПраваПользователей(ОбъектЗаполнения, ДополнительныеПраваПользователей);
	РегистрыСведений.НастройкиПравДоступаОбъектов.ПолучитьПраваДоступаОбъектов(ОбъектЗаполнения, ПраваДоступаОбъектов);
	//РегистрыСведений.НастройкиПравДоступаПользователей.ПолучитьПраваДоступаПользователей(ОбъектЗаполнения, Новый ОписаниеТипов("СправочникСсылка.ВидыМеню, СправочникСсылка.Меню"), ПраваДоступаПользователей);
	
	//Костенюк Александр-Старт 08.10.2012
	РегистрыСведений.НастройкиПравДоступаПользователей.ПолучитьПраваДоступаПользователей(ОбъектЗаполнения, Новый ОписаниеТипов("СправочникСсылка.ВидыМеню, СправочникСсылка.Меню, СправочникСсылка.ТипыСкидокНаценок"), ПраваДоступаПользователей);
	//Костенюк Александр-Финиш 08.10.2012
	
	// Настройка формы.
	Элементы.ГруппаНастройкиПользователей.Видимость = РегистрыСведений.НастройкиПользователей.ПолучитьПрисутсвиеНастроекПользователей(ОбъектЗаполнения);
	Элементы.ГруппаПраваДоступаОбъектов.Видимость = РегистрыСведений.НастройкиПравДоступаОбъектов.ПолучитьПрисутсвиеПравДоступаОбъектов(ОбъектЗаполнения);
	Элементы.ГруппаПраваДоступаПользователей.Видимость = РегистрыСведений.НастройкиПравДоступаПользователей.ПолучитьПрисутсвиеПравДоступаПользователей(ОбъектЗаполнения);
	
	РасширенныеНастройкиНаСервере(Элементы.ГруппаНастройкиПользователей.Видимость Или
								  Элементы.ГруппаПраваДоступаОбъектов.Видимость Или
								  Элементы.ГруппаПраваДоступаПользователей.Видимость);
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Параметры.
	Если Не Отказ Тогда
		РегистрыСведений.НастройкиПользователей.УстановитьНастройкиПользователей(ТекущийОбъект, НастройкиПользователей, Отказ);
		
		Элементы.ГруппаНастройкиПользователей.Видимость = Элементы.ГруппаНастройкиПользователей.Видимость Или Отказ;
	КонецЕсли; 
	Если Не Отказ Тогда
		РегистрыСведений.ЗначенияДополнительныхПравПользователя.УстановитьПраваПользователей(ТекущийОбъект, ДополнительныеПраваПользователей, Отказ);
		
		Элементы.ГруппаДополнительныеПраваПользователей.Видимость = Элементы.ГруппаДополнительныеПраваПользователей.Видимость Или Отказ;
	КонецЕсли; 
	Если Не Отказ Тогда
		РегистрыСведений.НастройкиПравДоступаОбъектов.УстановитьПраваДоступаОбъектов(ТекущийОбъект, ПраваДоступаОбъектов, Отказ);
		
		Элементы.ГруппаПраваДоступаОбъектов.Видимость = Элементы.ГруппаПраваДоступаОбъектов.Видимость Или Отказ;
	КонецЕсли; 
	Если Не Отказ Тогда
		РегистрыСведений.НастройкиПравДоступаПользователей.УстановитьПраваДоступаПользователей(ТекущийОбъект, ПраваДоступаПользователей, Отказ);
		
		Элементы.ГруппаПраваДоступаПользователей.Видимость = Элементы.ГруппаПраваДоступаПользователей.Видимость Или Отказ;
	КонецЕсли; 
	
	// Настройка формы.
	РасширенныеНастройкиНаСервере(Элементы.ГруппаНастройкиПользователей.Видимость Или
								  Элементы.ГруппаПраваДоступаОбъектов.Видимость Или
								  Элементы.ГруппаПраваДоступаПользователей.Видимость);

КонецПроцедуры // ПриЗаписиНаСервере()
