
&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	// Наследуемые реквизиты.
	РодительПриИзмененииСервер();

КонецПроцедуры // РодительПриИзменении()

&НаСервере
Процедура РодительПриИзмененииСервер()
	
	__РаботаСДаннымиКлиентСервер.ПолучитьНаследуемыеРеквизиты(Объект);

КонецПроцедуры // РодительПриИзмененииСервер()

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	// Наименование.
	Объект.Наименование = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеНаименование(Объект.Номенклатура);
	
	// Изображения.
	НоменклатураПриИзмененииСервер();

КонецПроцедуры // НоменклатураПриИзменении()

&НаСервере
Процедура НоменклатураПриИзмененииСервер()
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		ЗначениеВРеквизитФормы(Объект.Номенклатура.ПолучитьОбъект(), "Номенклатура");
	Иначе
		ЗначениеВРеквизитФормы(Новый (Тип("СправочникОбъект.Номенклатура")), "Номенклатура");
	КонецЕсли; 

КонецПроцедуры // НоменклатураПриИзмененииСервер()

&НаКлиенте
Процедура НоменклатураОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры // НоменклатураОчистка()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Изображения.
	НоменклатураПриИзмененииСервер();

КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Связанные данные.
	__РаботаСДаннымиКлиентСервер.УстановитьСвязанныеДанные(
		Номенклатура.Ссылка, 
		Новый Структура("Изображение,Миниатюра,Иконка, Комментарий",
			Номенклатура.Изображение,
			Номенклатура.Миниатюра,
			Номенклатура.Иконка,
			Номенклатура.Комментарий),
		Отказ);
		
КонецПроцедуры // ПриЗаписиНаСервере()
