
&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	// Наследуемые реквизиты.
	РодительПриИзмененииСервер();

КонецПроцедуры // РодительПриИзменении()

&НаСервере
Процедура РодительПриИзмененииСервер()
	
	__РаботаСДаннымиКлиентСервер.ПолучитьНаследуемыеРеквизиты(Объект);

КонецПроцедуры // РодительПриИзмененииСервер()

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииСервер();

КонецПроцедуры // ОрганизацияПриИзменении()

&НаСервере
Процедура ОрганизацияПриИзмененииСервер()
	
	// Код.
	Объект.Код = Справочники.СотрудникиОрганизаций.ПолучитьОчереднойКод(Объект);	
	
КонецПроцедуры // ОрганизацияПриИзмененииСервер()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Код.
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииНаСервере(Объект);	
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Код.
	Если ПустаяСтрока(ТекущийОбъект.Код) Тогда
		ТекущийОбъект.Код = Справочники.СотрудникиОрганизаций.ПолучитьОчереднойКод(ТекущийОбъект);	
	КонецЕсли;
	
КонецПроцедуры // ПриЧтенииНаСервере()



