#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура добавляет запись в регистр по переданным значениям структуры
Процедура ДобавитьЗапись(СтруктураЗаписи) Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
		И ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		
		ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "СостоянияУспешныхОбменовДаннымиОбластейДанных");
	Иначе
		ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "СостоянияУспешныхОбменовДанными");
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьЗапись(СтруктураЗаписи) Экспорт
	
	ОбменДаннымиСервер.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, "СостоянияУспешныхОбменовДанными");
	
КонецПроцедуры

//Костенюк Александр-Старт 26.11.2014
//
// Функция формирует таблицу состояний успешных обменов данными
//
// Параметры:
// УзелИнформационнойБазы - Тип: ПланыОбменаСсылка. Узел информационной базы.
// ДействиеПриОбмене - Тип: ПеречислениеСсылка.ДействияПриОбмене. Действие при обмене данными(выгрузка/загрузка).
// 
Функция ПолучитьТаблицуСостояниий(УзелИнформационнойБазы = Неопределено, ДействиеПриОбмене = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостоянияУспешныхОбменовДанными.УзелИнформационнойБазы,
	               |	СостоянияУспешныхОбменовДанными.УзелИнформационнойБазы.Ресторан КАК Ресторан,
	               |	СостоянияУспешныхОбменовДанными.ДатаОкончания
	               |ИЗ
	               |	РегистрСведений.СостоянияУспешныхОбменовДанными КАК СостоянияУспешныхОбменовДанными
	               |ГДЕ
	               |	СостоянияУспешныхОбменовДанными.УзелИнформационнойБазы = &УзелИнформационнойБазы
	               |	И СостоянияУспешныхОбменовДанными.ДействиеПриОбмене = &ДействиеПриОбмене";
	Если ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
		Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СостоянияУспешныхОбменовДанными.УзелИнформационнойБазы = &УзелИнформационнойБазы", "ИСТИНА");
	КонецЕсли;
	Если ЗначениеЗаполнено(ДействиеПриОбмене) Тогда
		Запрос.УстановитьПараметр("ДействиеПриОбмене", ДействиеПриОбмене);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СостоянияУспешныхОбменовДанными.ДействиеПриОбмене = &ДействиеПриОбмене", "ИСТИНА");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
//Костенюк Александр-Финиш 26.11.2014

#КонецЕсли