
Функция ОсновнаяОрганизация() Экспорт
	
	Результат = Константы.ОсновнаяОрганизация.Получить();
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                      |	Организации.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Организации КАК Организации
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Организации.ПометкаУдаления,
	                      |	Организации.Наименование");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Организации.ПустаяСсылка();

КонецФункции // ОсновнаяОрганизация()

Функция КоличествоОрганизацийБолееОдной() Экспорт
	
	Запрос = новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Организации.Ссылка) КАК Количество
	                      |ИЗ
	                      |	Справочник.Организации КАК Организации");
						  
	Возврат (Запрос.Выполнить().Выгрузить()[0].Количество > 1);

КонецФункции // КоличествоОрганизацийБолееОдной()
