
&НаКлиенте
Процедура СхемаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры // СхемаПриНажатии()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Параметры.
	Стол = Параметры.Стол;
	СтруктураСхемы = Параметры.СтруктураСхемы;
	
	// Схема.
	ЗаполнитьЗначенияСвойств(ЭтаФорма, РегистрыСведений.СхемыСтолов.ПолучитьСхемуHTML(Стол, СтруктураСхемы));
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Стол) Тогда
		Стол = НСтр("ru = 'Столы'; uk = 'Столи'");
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()
