
Процедура СформироватьТелефонныеКода(Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Выборка.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СтраныМира.Код КАК Поле1,
	                      |	ОператорыСвязи.Поле2 КАК Поле2,
	                      |	СтраныМира.Ссылка КАК СтранаМира,
	                      |	ОператорыСвязи.ОператорСвязи КАК ОператорСвязи
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		КлассификаторГородовТелефонныеКода.Код КАК Поле2,
	                      |		КлассификаторГородовТелефонныеКода.Ссылка КАК ОператорСвязи,
	                      |		КлассификаторГородовТелефонныеКода.Ссылка.Владелец КАК СтранаМира
	                      |	ИЗ
	                      |		Справочник.КлассификаторГородов.ТелефонныеКода КАК КлассификаторГородовТелефонныеКода
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		КлассификаторОператоровСвязиТелефонныеКода.Код,
	                      |		КлассификаторОператоровСвязиТелефонныеКода.Ссылка,
	                      |		КлассификаторОператоровСвязиТелефонныеКода.Ссылка.Владелец
	                      |	ИЗ
	                      |		Справочник.КлассификаторОператоровСвязи.ТелефонныеКода КАК КлассификаторОператоровСвязиТелефонныеКода) КАК ОператорыСвязи
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира.ТелефонныеКода КАК СтраныМира
	                      |		ПО ОператорыСвязи.СтранаМира = СтраныМира.Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	NULL,
	                      |	ОператорыСвязи.Поле2,
	                      |	ОператорыСвязи.СтранаМира,
	                      |	ОператорыСвязи.ОператорСвязи
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		КлассификаторГородовТелефонныеКода.Код КАК Поле2,
	                      |		КлассификаторГородовТелефонныеКода.Ссылка КАК ОператорСвязи,
	                      |		КлассификаторГородовТелефонныеКода.Ссылка.Владелец КАК СтранаМира
	                      |	ИЗ
	                      |		Справочник.КлассификаторГородов.ТелефонныеКода КАК КлассификаторГородовТелефонныеКода
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		КлассификаторОператоровСвязиТелефонныеКода.Код,
	                      |		КлассификаторОператоровСвязиТелефонныеКода.Ссылка,
	                      |		КлассификаторОператоровСвязиТелефонныеКода.Ссылка.Владелец
	                      |	ИЗ
	                      |		Справочник.КлассификаторОператоровСвязи.ТелефонныеКода КАК КлассификаторОператоровСвязиТелефонныеКода) КАК ОператорыСвязи
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	                      |		ПО ОператорыСвязи.СтранаМира = Константы.ОсновнойГород.Владелец
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	NULL,
	                      |	NULL,
	                      |	Константы.ОсновнойГород.Владелец,
	                      |	Константы.ОсновнойГород
	                      |ИЗ
	                      |	Константы КАК Константы
	                      |ГДЕ
	                      |	(НЕ Константы.ОсновнойГород = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка))
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Поле1,
	                      |	Поле2");
				   
	НаборЗаписей = СоздатьНаборЗаписей();			   
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Отказ = Истина;
		// TODO: Сообщение об ошибке.
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Истина);
	
КонецПроцедуры // СформироватьТелефонныеКода()