
&НаКлиенте
Процедура ВладелецПриАктивизацииСтроки(Элемент)
	
	__РаботаСДиалогамиКлиентСервер.ВладелецСпискаПриИзменении(Список, Элементы.Владелец);
	
КонецПроцедуры // ВладелецПриАктивизацииСтроки()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Владелец.
	__РаботаСДиалогамиКлиентСервер.ВладелецСпискаПриСоздании(Список, Элементы.Владелец, Справочники.Рестораны.ОсновнойРесторан());
	
	// Режим выбора.
	РежимВыбора = __РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список);

КонецПроцедуры // ПриСозданииНаСервере()

