
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не ЭтоГруппа Тогда
		Если Не __УправлениеДаннымиСервер.ПроверитьУникальностьРеквизитаСправочника(ЭтотОбъект, "Номенклатура") Тогда
			Отказ = Истина; // ERR
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		Наименование = Неопределено;
		Номенклатура = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	// Заполнение реквизитов.
	Если Не ЭтоГруппа Тогда
		Наименование = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеНаименование(Номенклатура);
	Иначе
		Наименование = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеНаименование(Наименование);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()
