
&НаКлиенте
Процедура НаименованиеСокращенноеПриИзменении(Элемент)
	
	// НаименованиеСокращенное.
	__УправлениеКонтактнойИнформациейКлиент.НаименованиеСокращенноеПриИзменении(Объект);
	
КонецПроцедуры // НаименованиеСокращенноеПриИзменении()


&НаКлиенте
Процедура ТелефонныеКодаКодПриИзменении(Элемент)
	
	__УправлениеКонтактнойИнформациейКлиент.ТелефонныеКодаКодПриИзменении(Объект, Элемент);
	
КонецПроцедуры // ТелефонныеКодаКодПриИзменении()

&НаКлиенте
Процедура ТелефонныеКодаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	__УправлениеКонтактнойИнформациейКлиент.ТелефонныеКодаПриОкончанииРедактирования(Объект, Элемент, НоваяСтрока, ОтменаРедактирования);
	
КонецПроцедуры // ТелефонныеКодаПриОкончанииРедактирования()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Настройка формы.
	Элементы.Владелец.Видимость = ПолучитьПараметрыУчета().КонтактнаяИнформацияСтраныМираИспользовать;
	
КонецПроцедуры // ПриСозданииНаСервере()
