
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// Код.
	Если ЭтоГруппа Тогда
		__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, , "Код");
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = Неопределено;
	Если Не ЭтоГруппа Тогда
		Наименование = Неопределено;
		ИдентификаторПользователяИБ = Неопределено;
		ИдентификаторПользователяСервиса = Неопределено;
		Недействителен = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Код.
	Если ЭтоГруппа Тогда
		Если ПустаяСтрока(Код) Тогда
			Код = Справочники.Пользователи.ПолучитьОчереднойКод(ЭтотОбъект);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()
