
Процедура ПолучитьГруппыПользователей(Ссылка, Объект) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	// Выборка данных.
	НаборЗаписей = РегистрыСведений.ГруппыПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Ссылка.Ссылка);
	НаборЗаписей.Прочитать();
	
	ЗначениеВДанныеФормы(НаборЗаписей, Объект);	

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПолучитьГруппыПользователей()

Процедура УстановитьГруппыПользователей(Ссылка, Объект, Отказ) Экспорт

	Если Не Отказ Тогда

		УстановитьПривилегированныйРежим(Истина);
		
		НаборЗаписей = ДанныеФормыВЗначение(Объект, Тип("РегистрСведенийНаборЗаписей.ГруппыПользователей"));
		
		НаборЗаписей.Отбор.Пользователь.Установить(Ссылка.Ссылка);
		Для Каждого Запись Из НаборЗаписей Цикл 
			Запись.Пользователь = Ссылка.Ссылка;
		КонецЦикла; 

		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			// TODO: Регистрация ошибки.
			__ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru = 'Не удалось изменить принадлежность к группам'; uk = 'Не вдалося змінити приналежність до груп'"), ,, "ГруппыПользователей", Отказ);
		КонецПопытки;

		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьГруппыПользователей()
