
Функция НайтиПоНоменклатуре(Номенклатура) Экспорт
	
	// Проверка.
	Если (ТипЗнч(Номенклатура) = Тип("СправочникСсылка.МодификаторыНоменклатуры")) Тогда
		Возврат Номенклатура;
	КонецЕсли; 
	
	// Поиск.
	Возврат Справочники.МодификаторыНоменклатуры.НайтиПоРеквизиту("Номенклатура", Номенклатура);

КонецФункции // НайтиПоНоменклатуре()


Процедура ПеренестиНоменклатуру(Номенклатура, ПараметрыПереноса) Экспорт
	
	Справочники.Меню.ПеренестиНоменклатуру(Номенклатура, ПараметрыПереноса, "МодификаторыНоменклатуры");
	
КонецПроцедуры // ПеренестиНоменклатуру()
