Процедура ОтчетПродажиПоДням() Экспорт
	
	ОткрытьФорму("Отчет.ПродажиНовый.Форма",Новый Структура("КлючВарианта","ПоДням"));
	
КонецПроцедуры

Процедура ОтчетПродажиПоЧасам() Экспорт
	
	ОткрытьФорму("Отчет.ПродажиНовый.Форма",Новый Структура("КлючВарианта","ПоЧасам"));
	
КонецПроцедуры

Процедура ОтчетРасходБлюдПоДням() Экспорт
	
	ОткрытьФорму("Отчет.РасходБлюд.Форма",Новый Структура("КлючВарианта","ПоДням"));
	
КонецПроцедуры

//Костенюк Александр-Старт 27.08.2012
Процедура ОтчетРасходБлюдПоЧасам() Экспорт
	
	ОткрытьФорму("Отчет.РасходБлюд.Форма", Новый Структура("КлючВарианта","ПоЧасам"));
	
КонецПроцедуры
//Костенюк Александр-Финиш 27.08.2012

//Костенюк Александр-Старт 06.12.2012
Процедура ОбщаяВыручкаРесторана() Экспорт
	ОткрытьФорму("Отчет.ПродажиНовый.Форма", Новый Структура("КлючВарианта", "ПоВидуОплаты"));
КонецПроцедуры
//Костенюк Александр-Финиш 06.12.2012

//Костенюк Александр-Старт 06.12.2012
Процедура ВыручкаРесторанаПоДням() Экспорт
	ОткрытьФорму("Отчет.ПродажиНовый.Форма", Новый Структура("КлючВарианта", "ПоДням"));
КонецПроцедуры
//Костенюк Александр-Финиш 06.12.2012

//Костенюк Александр-Старт 06.12.2012
Процедура ВыручкаРесторанаПоДнямНедели() Экспорт
	ОткрытьФорму("Отчет.ПродажиПоДнямНедели.Форма", Новый Структура("КлючВарианта", "Основной"));
КонецПроцедуры
//Костенюк Александр-Финиш 06.12.2012

//Костенюк Александр-Старт 06.12.2012
Процедура ВыручкаРесторанаПоЧасам() Экспорт
	ОткрытьФорму("Отчет.ПродажиНовый.Форма", Новый Структура("КлючВарианта", "ПоЧасам"));
КонецПроцедуры
//Костенюк Александр-Финиш 06.12.2012

//Костенюк Александр-Старт 06.12.2012
Процедура РасходБлюд() Экспорт
	ОткрытьФорму("Отчет.РасходБлюд.Форма", Новый Структура("КлючВарианта", "Основной"));
КонецПроцедуры
//Костенюк Александр-Финиш 06.12.2012

//Костенюк Александр-Старт 06.12.2012
Процедура РасходБлюдПоДням() Экспорт
	ОткрытьФорму("Отчет.РасходБлюд.Форма", Новый Структура("КлючВарианта", "ПоДням"));
КонецПроцедуры
//Костенюк Александр-Финиш 06.12.2012

//Костенюк Александр-Старт 06.12.2012
Процедура РасходБлюдПоЧасам() Экспорт
	ОткрытьФорму("Отчет.РасходБлюд.Форма", Новый Структура("КлючВарианта", "ПоЧасам"));
КонецПроцедуры
//Костенюк Александр-Финиш 06.12.2012

//Костенюк Александр-Старт 06.12.2012
Процедура РасходБлюдПоКатегориям() Экспорт
	ОткрытьФорму("Отчет.РасходБлюд.Форма", Новый Структура("КлючВарианта", "ПоНоменклатурнымГруппам"));
КонецПроцедуры
//Костенюк Александр-Финиш 06.12.2012

//Костенюк Александр-Старт 06.12.2012
Процедура Скидки() Экспорт
	ОткрытьФорму("Отчет.Скидки.Форма", Новый Структура("КлючВарианта", "Основной"));
КонецПроцедуры
//Костенюк Александр-Финиш 06.12.2012

//Костенюк Александр-Старт 06.12.2012
Процедура ПрохождениеДисконтныхКарт() Экспорт
	ОткрытьФорму("Отчет.ПрохождениеДисконтныхКарт.Форма", Новый Структура("КлючВарианта", "Основной"));
КонецПроцедуры
//Костенюк Александр-Финиш 06.12.2012

//Костенюк Александр-Старт 06.12.2012
Процедура СомнительныеСитуации() Экспорт
	ОткрытьФорму("Отчет.СомнительныеСитуации.Форма", Новый Структура("КлючВарианта", "Журнал"));
КонецПроцедуры
//Костенюк Александр-Финиш 06.12.2012

//Костенюк Александр-Старт 06.12.2012
Процедура УдалениеБлюд() Экспорт
	ОткрытьФорму("Отчет.УдалениеБлюд.Форма", Новый Структура("КлючВарианта", "Основной"));
КонецПроцедуры
//Костенюк Александр-Финиш 06.12.2012

//Костенюк Александр-Старт 06.12.2012
Процедура ОтчетПоСтолам() Экспорт
	ОткрытьФорму("Отчет.ОтчетПоСтолам.Форма", Новый Структура("КлючВарианта", "Основной"));
КонецПроцедуры
//Костенюк Александр-Финиш 06.12.2012

//Костенюк Александр-Старт 06.12.2012
Процедура СписокЧеков() Экспорт
	ОткрытьФорму("Отчет.Реализация.Форма", Новый Структура("КлючВарианта", "Основной"));
КонецПроцедуры
//Костенюк Александр-Финиш 06.12.2012

//Костенюк Александр-Старт 18.02.2013
Процедура ОтчетПоКатегориямГостей() Экспорт
	
	ОткрытьФорму("Отчет.ПродажиНовый.Форма",Новый Структура("КлючВарианта","ПоКатегориямГостейГоризонтальнаяГруппировка"));
	
КонецПроцедуры
//Костенюк Александр-Финиш 18.02.2013

//Костенюк Александр-Старт 24.05.2013
Процедура ОтчетМаркетингУзнаваемость() Экспорт
	
	ОткрытьФорму("Отчет.ПродажиНовый.Форма",Новый Структура("КлючВарианта","МаркетингУзнаваемость"));
	
КонецПроцедуры
//Костенюк Александр-Финиш 24.05.2013

//Костенюк Александр-Старт 29.05.2013
Процедура ПоКомпьютерамУстройствам() Экспорт
	
	ОткрытьФорму("Отчет.ПродажиНовый.Форма",Новый Структура("КлючВарианта","ПоКомпьютерамУстройствам"));
	
КонецПроцедуры
//Костенюк Александр-Финиш 29.05.2013

//Костенюк Александр-Старт 06.06.2013
Процедура ПродажиПоКассирам() Экспорт
	
	ОткрытьФорму("Отчет.ПродажиНовый.Форма",Новый Структура("КлючВарианта","ПоКассирам"));
	
КонецПроцедуры
//Костенюк Александр-Финиш 06.06.2013

//Костенюк Александр-Старт 07.07.2013
Процедура ПоКатегориямТоваров() Экспорт
	
	ОткрытьФорму("Отчет.ПродажиНовый.Форма",Новый Структура("КлючВарианта","ПоКатегориямТоваров"));
	
КонецПроцедуры
//Костенюк Александр-Финиш 07.07.2013
