
&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	__РаботаСДиалогамиКлиентСервер.ВладелецСпискаПриИзменении(Список, Владелец);
	
КонецПроцедуры // ВладелецПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Владелец.
	__РаботаСДиалогамиКлиентСервер.ВладелецСпискаПриСоздании(Список, Элементы.Владелец, Справочники.КлассификаторСтранМира.ОсновнаяСтрана());
	
	// Режим выбора.
	__РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список, 
		"КраткийСоставСпарвочника");

КонецПроцедуры // ПриСозданииНаСервере()
