
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если (ОткрытьФормуМодально("Справочник.Столы.Форма.ФормаФормирования", Новый Структура("ТекущийРодитель", Элементы.Список.ТекущийРодитель), ЭтаФорма) = Истина) Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры // Сформировать()


&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)

	//__ИнтерактивноеУправлениеДаннымиКлиент.АктуальностьСправочникаПриАктивизацииЯчейки(Элемент); //Костенюк Александр-Закомментировано 31.03.2014
	
КонецПроцедуры	// СписокПриАктивизацииЯчейки()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Режим выбора.
	__РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список, 
		"Сформировать, ИндексАктуальности,ТипСтола");

КонецПроцедуры // ПриСозданииНаСервере()

