
&НаКлиенте
Процедура ПараметрыРезервированияНажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.СхемыСтолов.Форма.ФормаПараметров", , ЭтаФорма);
	
КонецПроцедуры // ПараметрыРезервированияНажатие()

&НаКлиенте
Процедура СтилиСхемСтоловНажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.СтилиСхемСтолов.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры // СтилиСхемСтоловНажатие()

&НаКлиенте
Процедура ПереходСхемаНажатие(Элемент)
	
	Закрыть();
	
	ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ФормаСхемыРабочегоСтола", , ВладелецФормы, , __УправляемыеФормыКлиент.ПолучитьОкно(Окно));
	
КонецПроцедуры // ПереходСхемаНажатие()

&НаКлиенте
Процедура ПереходСписокНажатие(Элемент)
	
	Закрыть();
	
	ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ФормаЖурналаРабочегоСтола", , ВладелецФормы, , __УправляемыеФормыКлиент.ПолучитьОкно(Окно));
	
КонецПроцедуры // ПереходСписокНажатие()
