
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	Объект.НачалоПериода 	= НачалоДня(ТекущаяДата());
	Объект.КонецПериода 	= КонецДня(ТекущаяДата());
	Объект.Выгружать 		= Истина;
	Объект.Адрес 			= ЭтотОбъект.ПолучитьАдрес();
	Объект.Пользователь 	= ЭтотОбъект.ПолучитьПользователя();
	Объект.Пароль 			= ЭтотОбъект.ПолучитьПароль();
	Объект.Каталог 			= ЭтотОбъект.ПолучитьКаталог();
	Объект.УдалятьФайлы 	= Истина;
	УстановитьДоступностьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	ПараметрыПериода = Новый Структура;
	ПараметрыПериода.Вставить("ДатаНачала", Объект.НачалоПериода);
	ПараметрыПериода.Вставить("ДатаОкончания", Объект.КонецПериода);
	ПараметрыПериода.Вставить("ИнтервалПериод", Истина);	
	РедактированиеПериода = ПолучитьФорму("ОбщаяФорма.РедактированиеПериода", ПараметрыПериода, ЭтаФорма);
	Если РедактированиеПериода.Открыта() Тогда
		РедактированиеПериода.Активизировать();
	Иначе
		РедактированиеПериода.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.Заголовок = "Выберите каталог";
	ДиалогВыбораФайла.Каталог = Объект.Каталог;
	Если НЕ ДиалогВыбораФайла.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	Объект.Каталог = РаботаСФайлами.НормализоватьКаталог(ДиалогВыбораФайла.Каталог);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПериодИзменен" Тогда
		Объект.НачалоПериода = Параметр.ДатаНачала;
		Объект.КонецПериода = КонецДня(Параметр.ДатаОкончания);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьНаСервере()
	Элементы.Адрес.Доступность 			= Объект.Выгружать;
	Элементы.Пользователь.Доступность 	= Объект.Выгружать;
	Элементы.Пароль.Доступность 		= Объект.Выгружать;
	Элементы.УдалятьФайлы.Доступность 	= Объект.Выгружать;
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьПриИзменении(Элемент)
	Объект.УдалятьФайлы = Объект.Выгружать;
	УстановитьДоступностьНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ВыполнитьОбработкуНаСервере();
	ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.ВыполнитьОбработку(НачалоДня(Объект.НачалоПериода), КонецДня(Объект.КонецПериода), Объект.Ресторан, Объект.Выгружать, Объект.Адрес, Объект.Пользователь, Объект.Пароль, Объект.Каталог, Объект.УдалятьФайлы);
КонецПроцедуры

