
#Если Клиент Тогда
	
//////////////////////////////////////////////////////////////////////////
// ВЫБОР СОТРУДНИКА закрытия смены
Процедура ПоискСотрудникаВыбор(Элемент, Значение, Колонка, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ПоискСотрудникаПриИзмененииДанных(Элемент) Экспорт
	
	ТабличноеПоле = Элемент; 
	ПолучитьСерверFrontOffice().ТабличноеПолеПоместить(ТабличноеПоле);
	
КонецПроцедуры

Процедура ПоискСотрудникаПриПоискеЗначения(Элемент, Значение, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Данные = Элемент.Данные();
	Данные.Очистить();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СотрудникиОрганизаций.Ссылка,
	|	СотрудникиОрганизаций.Код,
	|	СотрудникиОрганизаций.Организация,
	|	СотрудникиОрганизаций.Наименование КАК ОбъектПредставление
	|ИЗ
	|	Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций";
	
	Если Не ПустаяСтрока(Значение) Тогда
		ТекстЗапроса = ТекстЗапроса + " ГДЕ
		|	(СотрудникиОрганизаций.Наименование ПОДОБНО &Наименование
		|			ИЛИ СотрудникиОрганизаций.Код ПОДОБНО &Код)";
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Если Не ПустаяСтрока(Значение) Тогда
		Запрос.УстановитьПараметр("Наименование", Значение+"%");
		Запрос.УстановитьПараметр("Код", "%"+Значение+"%");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицы = Данные.Добавить();	
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы,Выборка);
		
	КонецЦикла;
	
	Элемент.ОбновитьСтроки();
	
	Выборка = Неопределено;
	
КонецПроцедуры

Процедура ПоискСотрудникаПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки) Экспорт
	
КонецПроцедуры

Функция ВыборСотрудника(Сотрудник) Экспорт
	Данные = Новый ТаблицаЗначений;
	Данные.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка"),"Код (Таб. №)");
	Данные.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.СотрудникиОрганизаций"),"Сотрудник");
	Данные.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"),"Организация");	
	Строкой = "";	
	//Если FrontOffice.ПоискСтроки(Строкой,"Выберите сотрудника",,,,Данные,
	//Костенюк Александр-Старт 05.06.2012
	Если FrontOffice.ПоискСтроки(Строкой,НСтр("ru='Выберите сотрудника';uk='Виберіть співробітника'"),,,,Данные,
	//Костенюк Александр-Финиш 05.06.2012
		"Код,Ссылка,Организация",
		НЕ УправлениеПользователями.ПолучитьЗначениеНастройки(ПланыВидовХарактеристик.НастройкиПользователей.FrontOfficeИспользоватьУчетРабочегоВремениВнештатныхСотрудников),
		ЭтотОбъект,"ПоискСотрудника") Тогда	
		Если Строкой = Неопределено Тогда
			 Возврат Ложь; 
		КонецЕсли;
		Если ТипЗнч(Строкой)=Тип("Строка") Тогда
			Сотрудник = Строкой;			
		Иначе
			Сотрудник = Строкой.Ссылка;				
		КонецЕсли;
		Данные = Неопределено;
		Возврат Истина;		
	КонецЕсли;	
	Возврат Ложь; 	
КонецФункции
	
// Процедура инициализация модуля рабочего места.
//
Процедура Инициализация() Экспорт
	
	// Проверка режима.
	Если ПолучитьСерверFrontOffice().РежимBackOffice Тогда
		Возврат;
	КонецЕсли;
	
	// Создание формы.
	Если (Форма = Неопределено) Тогда
		Форма = ЭтотОбъект.ПолучитьФорму("Форма");
		ПолучитьСерверFrontOffice().__ОткрытьФорму(Форма);
	КонецЕсли;
		
КонецПроцедуры // Инициализация()

// Процедура открытия формы рабочего места.
//
Процедура Открыть() Экспорт
	
	// Открытие формы.
	ПолучитьСерверFrontOffice().__ОткрытьФорму(Форма);
		
КонецПроцедуры // Открыть()

#КонецЕсли

