
Функция ВыбратьПричинуОтказа(Значение) Экспорт
	
	// Форма выбора.
	Форма = ПолучитьФорму("Форма");
	Форма.НачальноеЗначениеВыбора = Значение;
	
	// Выбор.
	Результат = Форма.ОткрытьМодально();
	Если (ТипЗнч(Результат) = Тип("СправочникСсылка.ПричиныОтказов")) И (Не Результат.Пустая()) Тогда
	    Значение = Результат;
		Возврат Истина;
	КонецЕсли; 
	
	// Результат.
	Возврат Ложь;

КонецФункции // ВыбратьПричинуОтказа()
 
Функция ВыбратьПричинуОтказаИЧерныйСписок(Значение, ЧерныйСписокДобавление, ЧерныйСписокКомментарий) Экспорт
	
	// Форма выбора.
	Форма = ПолучитьФорму("Форма");
	Форма.НачальноеЗначениеВыбора = Значение;
	Форма.УправлениеЧернымСписоком = Истина;
	
	// Выбор.
	Результат = Форма.ОткрытьМодально();
	Если (ТипЗнч(Результат) = Тип("СправочникСсылка.ПричиныОтказов")) И (Не Результат.Пустая()) Тогда
	    Значение = Результат;
		ЧерныйСписокДобавление = Форма.ЧерныйСписокДобавление;
		ЧерныйСписокКомментарий = Форма.ЧерныйСписокКомментарий;
		Возврат Истина;
	КонецЕсли; 
	
	// Результат.
	Возврат Ложь;

КонецФункции // ВыбратьПричинуОтказаИЧерныйСписок()
