
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Схема = Запись.Схема.Получить();
		//Если (Схема = Неопределено) Тогда
		//	Отказ = Истина;
		//	// TODO
		//КонецЕсли;
		//Если Не Отказ Тогда
		//	Картинка = Новый Картинка(Картинка);
		//	Если (Картинка.Формат() = ФорматКартинки.НеизвестныйФормат) Тогда
		//		Отказ = Истина;
		//		// TODO
		//	КонецЕсли;
		//КонецЕсли;
		
		Если Не Отказ Тогда
			ИндексКартинки = __РаботаСФайламиКлиентСервер.ПолучитьИндексПиктограммыФайла(__РаботаСФайламиКлиентСервер.ПолучитьРасширениеФайла(Запись.Файл));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
