
Процедура ПриЗаписи(Отказ, Замещение)

	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Номенклатура меню.
	Если ДополнительныеСвойства.Свойство("ПредотвратитьДеактуализациюНоменклатурыМеню") Тогда
		ДополнительныеСвойства.Удалить("ПредотвратитьДеактуализациюНоменклатурыМеню");
	Иначе
		
		Если Количество() Тогда
			МассивНомменклатур = ВыгрузитьКолонку("Номенклатура");
		Иначе
			Если Отбор.Номенклатура.Использование Тогда
				МассивНомменклатур = Новый Массив; МассивНомменклатур.Добавить(Отбор.Номенклатура.Значение);
		    КонецЕсли;
		КонецЕсли;
		
		Для Каждого Номменклатура Из МассивНомменклатур Цикл
			
			РегистрыСведений.НоменклатураМеню.ДеактуализорватьНоменклатуру(Номменклатура, Отказ);
			Если Отказ Тогда
				Прервать;
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры // ПриЗаписи()
