
Процедура ПередЗаписью(Отказ)
	
	Возврат; //Костенюк Александр 12.05.2014
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	ТипыЦен.Ссылка
		|ИЗ
		|	Справочник.ТипыЦен КАК ТипыЦен";

	Результат = Запрос.Выполнить();

	ДополнительныеСвойства.Вставить("ПроставитьТипыЦен", Результат.Пустой());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//Если ДополнительныеСвойства.ПроставитьТипыЦен Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Рестораны.Ссылка
	//	|ИЗ
	//	|	Справочник.Рестораны КАК Рестораны";
	//	
	//	Результат = Запрос.Выполнить();
	//	
	//	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	//	
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		//ТекущийРесторан = ОбменДаннымиПовтИсп.ПолучитьТекущийРесторан();
	//		ТекущийРесторан = ВыборкаДетальныеЗаписи.Ссылка;
	//		Если Не ЗначениеЗаполнено(ТекущийРесторан.ТипЦен) Тогда
	//			Ресторан = ТекущийРесторан.ПолучитьОбъект();
	//			Ресторан.ТипЦен = ЭтотОбъект.Ссылка;
	//			Ресторан.Записать();
	//		КонецЕсли;
	//	КонецЦикла;

	//	РегистрыСведений.ЦеныНоменклатуры.ЗаполнитьТипЦен(Ссылка);	
	//КонецЕсли;
	
	РегистрыСведений.ЦеныНоменклатуры.ЗаполнитьТипЦен(Ссылка); //Костенюк Александр 12.05.2014
	
КонецПроцедуры
