
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заглушка.
	Отказ = Не ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Идентификатор);
	
	// Параметры.
	ЗначенияСеанса.Параметры.УстановитьЗначениеПараметра("Идентификатор", Запись.Идентификатор);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка форма.
	Если Не МодальныйРежим Тогда
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СеансАктивен = (ТекущийОбъект.ДатаОкончанияПериода >= РегистрыСведений.__НастройкиВебСервиса.ПолучитьГраницуНеактивностиСеансов());

КонецПроцедуры // ПриЧтенииНаСервере()
