
Функция ПолучитьСобытия(Сеанс)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Сеанс));
	
	// Получение данных.
	Реузльтат = Новый Структура("Сообщения,События",
		РегистрыСведений.__СостоянияСообщенийПользователей.ПолучитьСообщения(),
		РегистрыСведений.__СостоянияУведомленийДокументов.ПолучитьУведомления());
		
	// Результат.
	Возврат __В(Реузльтат);
	
КонецФункции // ПолучитьСобытия()

Функция ПодтвердитьСообщение(Сеанс, Сообщение)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Сеанс));
	
	// Изменение данных.
	РегистрыСведений.__СостоянияСообщенийПользователей.ПодтвердитьСообщение(__Из(Сообщение));
	Возврат Истина;
	
КонецФункции // ПодтвердитьСообщение()

Функция ПодтвердитьУведомление(Сеанс, Документ)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Сеанс));
	
	// Изменение данных.
	РегистрыСведений.__СостоянияУведомленийДокументов.ПодтвердитьУведомление(__Из(Документ));
	Возврат Истина;
	
КонецФункции // ПодтвердитьУведомление()

Функция ПолучитьПолучателейСообщения(Сеанс)
	
	// Продление сеанса.
	__ВебСервисСервер.ПродлениеСеанса(__Из(Сеанс));
	
	// Получение данных.
	Реузльтат = Новый Структура("Получатели,Сообщения",
		РегистрыСведений.__СообщенияПользователей.ПолучитьПолучателей(),
		РегистрыСведений.__СообщенияПользователей.ПолучитьСообщения());
		
	// Результат.
	Возврат __В(Реузльтат);
	
КонецФункции // ПолучитьПолучателейСообщения()

Функция ОтправитьСообщение(Сеанс, Получатель, Документ, Сообщение)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Сеанс));
	
	// Сообщить.
	РегистрыСведений.__СостоянияСообщенийПользователей.ДобавитьСообщение(__Из(Получатель), __Из(Документ, Истина), Сообщение);
	Возврат Истина;
	
КонецФункции // ОтправитьСообщение()

Функция SendMessage(Session, Receiver, Document, Message)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Session));
	
	// Сообщить.
	РегистрыСведений.__СостоянияСообщенийПользователей.ДобавитьСообщение(__Из(Receiver), __Из(Document, Истина), Message);
	
	Возврат Истина;
	
КонецФункции

Функция ConfirmMessage(Session, Message)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Session));
	
	// Изменение данных.
	РегистрыСведений.__СостоянияСообщенийПользователей.ПодтвердитьСообщение(__Из(Message));
	
	Возврат Истина;
	
КонецФункции

Функция GetMessageReceivers(Session)
	
	// Продление сеанса.
	__ВебСервисСервер.ПродлениеСеанса(__Из(Session));
	
	// Получение данных.
	Реузльтат = Новый Структура("Получатели, Сообщения", РегистрыСведений.__СообщенияПользователей.ПолучитьПолучателей(), РегистрыСведений.__СообщенияПользователей.ПолучитьСообщения());
	
	// Результат.
	Возврат __В(Реузльтат);
	
КонецФункции

Функция ConfirmNotification(Session, Document)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Session));
	
	// Изменение данных.
	РегистрыСведений.__СостоянияУведомленийДокументов.ПодтвердитьУведомление(__Из(Document));
	
	Возврат Истина;
	
КонецФункции

Функция GetEvents(Session)
	
	// Восстановление сеанса.
	__ВебСервисСервер.ВосстановлениеСеанса(__Из(Session));
	
	// Получение данных.
	Реузльтат = Новый Структура("Сообщения, События", РегистрыСведений.__СостоянияСообщенийПользователей.ПолучитьСообщения(), РегистрыСведений.__СостоянияУведомленийДокументов.ПолучитьУведомления());
	
	// Результат.
	Возврат __В(Реузльтат);
	
КонецФункции

