
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Владелец 	= ЭтаФорма.Параметры.Владелец;
	ИмяОбъекта 	= ЭтаФорма.Параметры.ИмяОбъекта;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьТаблицуНастроекНаСервере(ИмяОбъекта, Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Отказ = Ложь;
	
	ТекущиеДанные = Элементы.ТаблицаНастроек.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Настройка = ТекущиеДанные.НаименованиеНастройки;
	
	ВосстановитьНаСервере(Отказ, ИмяОбъекта, Настройка);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Отказ = Ложь;
	
	ТекущиеДанные 	= Элементы.ТаблицаНастроек.ТекущиеДанные;
	Настройка 		= ТекущиеДанные.НаименованиеНастройки;
	
	ВосстановитьНаСервере(Отказ, ИмяОбъекта, Настройка);
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНастроекНаСервере(ИмяОбъекта, Владелец)
	
	Настройки = РегистрыСведений.НастройкаАктуальности.СформироватьТаблицуНастроек(ИмяОбъекта, Владелец);
	
	ЗначениеВРеквизитФормы(Настройки, "ТаблицаНастроек");
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНаСервере(Отказ, ИмяОбъекта, Настройка)
	
	РегистрыСведений.НастройкаАктуальности.ВосстановитьНастройку(Отказ, ИмяОбъекта, Настройка, Владелец);
	
КонецПроцедуры



