
// Рефакторинг:
//	1. Переименовать СчитываемаяДорожка -> ИзвлекаемаяДорожка;
//	2. Переименовать ШаблонКода -> ШаблонДорожки;
//	3. Переименовать ШаблонНомера -> ШаблонКодаКарты;
//	4. Переименовать ЗначениеЛево -> НачальноеОграничение;
//	5. Переименовать ЗначениеПраво -> КонечноеОграничение;
//	6. Удалить ОперацияЛево;
//	7. Удалить ОперацияПраво.

// TODO: Переписать алгоритм распознования карты с учетом того, что дорожка может не извлекаться и могут быть использованы символы, а не только цыфры.

