
&НаКлиенте
Процедура ПериодическиеПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)

	Если Не ОтменаРедактирования Тогда
		Если Не __ОбщегоНазначенияКлиентСервер.ЗначенияЗаполненныОбъединение(Элементы.Периодические.ТекущиеДанные, "МесяцГода,ДеньНедели,ВремяНачала,ВремяОкончания") Тогда
			Объект.Периодические.Удалить(Элементы.Периодические.ТекущаяСтрока);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ПериодическиеПередОкончаниемРедактирования()

&НаКлиенте
Процедура ПериодическиеВремяНачалаПриИзменении(Элемент)

	Элементы.Периодические.ТекущиеДанные.ВремяНачала = __ОбщегоНазначенияКлиентСервер.ОкрВремя(Элементы.Периодические.ТекущиеДанные.ВремяНачала, 300);
	
КонецПроцедуры	// ПериодическиеВремяНачалаПриИзменении()

&НаКлиенте
Процедура ПериодическиеВремяОкончанияПриИзменении(Элемент)

	Элементы.Периодические.ТекущиеДанные.ВремяОкончания = __ОбщегоНазначенияКлиентСервер.ОкрВремя(Элементы.Периодические.ТекущиеДанные.ВремяОкончания, 300);
	
КонецПроцедуры // ПериодическиеВремяОкончанияПриИзменении()

&НаКлиенте
Процедура АстрономическиеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если Не ОтменаРедактирования Тогда
		Если Не __ОбщегоНазначенияКлиентСервер.ЗначенияЗаполненныОбъединение(Элементы.Астрономические.ТекущиеДанные, "ДатаНачала,ДатаОкончания,ВремяНачала,ВремяОкончания") Тогда
			Объект.Астрономические.Удалить(Элементы.Астрономические.ТекущаяСтрока);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // АстрономическиеПриОкончанииРедактирования()

&НаКлиенте
Процедура АстрономическиеВремяНачалаПриИзменении(Элемент)

	//Элементы.Астрономические.ТекущиеДанные.ВремяНачала = __ОбщегоНазначенияКлиентСервер.ОкрВремя(Элементы.Астрономические.ТекущиеДанные.ВремяНачала, 300); //Костенюк Александр-Закомментировано 26.05.2016
	
КонецПроцедуры // АстрономическиеВремяНачалаПриИзменении()

&НаКлиенте
Процедура АстрономическиеВремяОкончанияПриИзменении(Элемент)

	//Элементы.Астрономические.ТекущиеДанные.ВремяОкончания = __ОбщегоНазначенияКлиентСервер.ОкрВремя(Элементы.Астрономические.ТекущиеДанные.ВремяОкончания, 300); //Костенюк Александр-Закомментировано 26.05.2016
	
КонецПроцедуры // АстрономическиеВремяОкончанияПриИзменении()
