
Функция ПолучитьНастройкиПараметровУчета() Экспорт
	
	Возврат РегистрыСведений.НастройкаПараметровУчета.Получить();
	
КонецФункции // ПолучитьНастройкиПараметровУчета()


Функция ПолучитьНастройкуТекущегоПользователеля(Настройка, ПоУмолчанию = Неопределено) Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить(Настройка, ПоУмолчанию);
	
	Настройки = __ОбщегоНазначенияСервер.ПолучитьНастройкиТекущегоПользователеля(Настройки);
	
	Возврат Настройки[Настройка];
	
КонецФункции // ПолучитьНастройкуТекущегоПользователеля()

Функция ПолучитьНастройкиТекущегоПользователеля(Настройки) Экспорт
	
	Возврат __ОбщегоНазначенияСервер.ПолучитьНастройкиТекущегоПользователеля(Настройки);
	
КонецФункции // ПолучитьНастройкиТекущегоПользователеля()

Функция ПолучитьНастройкуПользователеля(Пользователь, Настройка, ПоУмолчанию = Неопределено) Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить(Настройка, ПоУмолчанию);
	
	Настройки = __ОбщегоНазначенияСервер.ПолучитьНастройкиПользователеля(Пользователь, Настройки);
	
	Возврат Настройки[Настройка];
	
КонецФункции // ПолучитьНастройкуПользователеля()

Функция ПолучитьНастройкиПользователеля(Пользователь, Настройки) Экспорт
	
	Возврат __ОбщегоНазначенияСервер.ПолучитьНастройкиПользователеля(Пользователь, Настройки);
	
КонецФункции // ПолучитьНастройкиПользователеля()
