
Функция __В(Значение, ВозможноПустое = Ложь, ПустоеЗначение = Неопределено) Экспорт
	
	// Пустое значение.
	Если ВозможноПустое Тогда
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Возврат JSON.ЗаписатьJSON_(ПустоеЗначение, Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Возврат JSON.ЗаписатьJSON_(Значение, Ложь);
	
КонецФункции // __В()

Функция __Из(Значение, ВозможноПустое = Ложь, ПустоеЗначение = Неопределено) Экспорт
	
	// Пустое значение.
	Если ВозможноПустое Тогда
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Возврат ПустоеЗначение;
		КонецЕсли;
		
		Результат = JSON.ПрочитатьJSON_(Значение, Неопределено);
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Возврат ПустоеЗначение;
		КонецЕсли;
		
		Возврат Результат;
	КонецЕсли;
	
	Возврат JSON.ПрочитатьJSON_(Значение, Неопределено);
	
КонецФункции // __Из()


Функция __Исходящие(Значение1 = Неопределено, Значение2 = Неопределено, Значение3 = Неопределено, Значение4 = Неопределено) Экспорт
	
	Если (Не Значение1 = Неопределено) Тогда
		Значение1 = JSON.ЗаписатьJSON_(Значение1, Ложь);
	КонецЕсли;
	
	Если (Не Значение2 = Неопределено) Тогда
		Значение2 = JSON.ЗаписатьJSON_(Значение2, Ложь);
	КонецЕсли;
	
	Если (Не Значение3 = Неопределено) Тогда
		Значение3 = JSON.ЗаписатьJSON_(Значение3, Ложь);
	КонецЕсли;
	
	Если (Не Значение4 = Неопределено) Тогда
		Значение4 = JSON.ЗаписатьJSON_(Значение4, Ложь);
	КонецЕсли;
	
КонецФункции // __Исходящие()

Функция __Входящие(Значение1 = Неопределено, Значение2 = Неопределено, Значение3 = Неопределено, Значение4 = Неопределено) Экспорт
	
	Если (Не Значение1 = Неопределено) Тогда
		Значение1 = JSON.ПрочитатьJSON_(Значение1, Неопределено);
	КонецЕсли;
	
	Если (Не Значение2 = Неопределено) Тогда
		Значение2 = JSON.ПрочитатьJSON_(Значение2, Неопределено);
	КонецЕсли;
	
	Если (Не Значение3 = Неопределено) Тогда
		Значение3 = JSON.ПрочитатьJSON_(Значение3, Неопределено);
	КонецЕсли;
	
	Если (Не Значение4 = Неопределено) Тогда
		Значение4 = JSON.ПрочитатьJSON_(Значение4, Неопределено);
	КонецЕсли;
	
КонецФункции // __Входящие()


Функция __Восстановалеие(Значение1 = Неопределено, Значение2 = Неопределено, Значение3 = Неопределено, Значение4 = Неопределено) Экспорт
	
	Значение1 = Строка(Неопределено);
	
	Значение2 = Строка(Неопределено);
	
	Значение3 = Строка(Неопределено);
	
	Значение4 = Строка(Неопределено);

КонецФункции // __Восстановалеие()


Функция __Свойство(Структура, Свойство, Значение = Неопределено, ПоУмолчанию = Неопределено) Экспорт
	
	Если (Структура = Неопределено) Тогда
		Значение = ПоУмолчанию; Возврат Ложь;
	КонецЕсли;
	
	СтруктураПриемник = Новый Структура(Свойство); ЗаполнитьЗначенияСвойств(СтруктураПриемник, Структура); Если СтруктураПриемник.Свойство(Свойство, Значение) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Значение = ПоУмолчанию; Возврат Ложь;
	
КонецФункции // Свойство()

Функция __ПолучитьСвойство(Структура, Свойство, ПоУмолчанию = Неопределено) Экспорт
	
	Если (Структура = Неопределено) Тогда
		Возврат ПоУмолчанию;
	КонецЕсли;
	
	СтруктураПриемник = Новый Структура(Свойство); ЗаполнитьЗначенияСвойств(СтруктураПриемник, Структура); Если (Не СтруктураПриемник[Свойство] = Неопределено) Тогда
		Возврат СтруктураПриемник[Свойство];
	КонецЕсли;
	
	Возврат ПоУмолчанию;
	
КонецФункции // ПолучитьСвойство()

Процедура __УстановитьСвойство(Структура, Свойство, Значение = Неопределено) Экспорт
	
	Если (Структура = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураИсточник = Новый Структура(Свойство, Значение); ЗаполнитьЗначенияСвойств(Структура, СтруктураИсточник);
	
КонецПроцедуры // УстановитьСвойство()
