
&НаКлиенте
Процедура УстановитьВидимость()
	
	// Командная панель.
	Элементы.ПодробныйРежим.Пометка = ПодробныйРежим;
	
	// Элементы.
	Элементы.ГруппаОтражатьВУправленческомУчете.Видимость = (Не РежимВыбора) И ИспользоватьУправленческийУчет И ПодробныйРежим;
	Элементы.ГруппаОтражатьВБухгалтерскомУчете.Видимость = Элементы.ГруппаОтражатьВУправленческомУчете.Видимость;
	Элементы.ГруппаПериод.Видимость = (Не РежимВыбора) И ПодробныйРежим;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ПодробныйРежим(Команда)
	
	ПодробныйРежим = Не ПодробныйРежим;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПодробныйРежим()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Управленчиский учет.
	ИспользоватьУправленческийУчет = ПолучитьФункциональнуюОпцию("ИспользоватьУправленческийУчет");

	// Режим выбора.
	РежимВыбора = __РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список,
		"ПодробныйРежим, ГруппаПериод,СуммаДокументаБезСкидок,СуммаНаценкиДокумента,СуммаСкидкиДокумента,Ответственный,Комментарий");
		
	// Настройка формы.
	Если Параметры.Свойство("Отбор") Тогда
		Если (__ПолучитьСвойство(Параметры.Отбор, "Модуль") = Перечисления.МодулиИПодсистемы.Ресторан) Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Реализации товаров и услуг: ресторан'; uk = 'Реалізації товарів і послуг: ресторан'");
			//Элементы.Модуль.Видимость = Ложь;
			
		КонецЕсли; 
		Если (__ПолучитьСвойство(Параметры.Отбор, "Модуль") = Перечисления.МодулиИПодсистемы.Доставка) Тогда
			
			АвтоЗаголовок = Ложь;
			Заголовок = НСтр("ru = 'Реализации товаров и услуг: доставка'; uk = 'Реалізації товарів і послуг: доставка'");
			//Элементы.Модуль.Видимость = Ложь;
			
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПриОткрытии()
