
#Если Клиент Тогда
	
// Обработчик события НакладнаяНаДоставку.ПередЗаписью формы документа.
//
Процедура ПередЗаписьюДокументаНакладнаяНаДоставку(ДокументОбъект, ФормаДокумента, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	// Проверка.
	Если (Не ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.НакладнаяНаДоставку")) Тогда
		Возврат;
	КонецЕсли;

	// ПометкаУдаления.
	ПередЗаписьюДокументаНакладнаяНаДоставкуПометкаУдаления(ДокументОбъект, ФормаДокумента, Отказ);
	
КонецПроцедуры // ПередЗаписьюДокумента()

// Обработчик события НакладнаяНаДоставку.ПриЗаписи формы документа.
//
Процедура ПриЗаписиДокументаНакладнаяНаДоставку(ДокументОбъект, ФормаДокумента, Отказ) Экспорт
	
	// Проверка.
	Если (Не ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.НакладнаяНаДоставку")) Тогда
		Возврат;
	КонецЕсли;

	// ДокументыОснования.
	ПриЗаписиДокументаНакладнаяНаДоставкуДокументыОснования(ДокументОбъект, ФормаДокумента, Отказ);
	
КонецПроцедуры // ПередЗаписьюДокумента()

// Обработчик события НакладнаяНаДоставку.ПриПечати формы документа.
//
Процедура ПриПечатиДокументаНакладнаяНаДоставку(ДокументОбъект, ФормаДокумента) Экспорт
	
	// Проверка.
	Если (Не ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.НакладнаяНаДоставку")) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриПечатиДокументаНакладнаяНаДоставку()


// Обработчик события НакладнаяНаДоставку.ПриЗаписи.ПометкаУдаления формы документа.
//
Процедура ПередЗаписьюДокументаНакладнаяНаДоставкуПометкаУдаления(ДокументОбъект, ФормаДокумента, Отказ)
	
	// Параметры.
	Параметры = ДокументОбъект.ДополнительныеСвойства;
	
	// ПометкаУдаления.
	Если Не Отказ Тогда
		Если Параметры.ОсновныеСобытия.Уадление Тогда
			Если ОбщегоНазначения.РежимFrontOffice() И (Не ОбщегоНазначения.ПолучитьБулевоеСвойство(Параметры, "НеОчищатьДокумент")) Тогда
				
				ДокументОбъект.ДокументыОснования.Очистить();	
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПередЗаписьюДокументаНакладнаяНаДоставкуПометкаУдаления()


// Обработчик события НакладнаяНаДоставку.ПриЗаписи.ДокументыОснования формы документа.
//
Процедура ПриЗаписиДокументаНакладнаяНаДоставкуДокументыОснования(ДокументОбъект, ФормаДокумента, Отказ) Экспорт
	
	// Параметры.
	Параметры = ДокументОбъект.ДополнительныеСвойства;
	
	// ДокументыОснования.
	Если Не Отказ Тогда
		Если Параметры.ОсновныеСобытия.Печать Тогда
			
			МассивДокументовОснований = Новый Массив;
			Для Каждого СтрокаТабличнойЧасти Из ДокументОбъект.ДокументыОснования Цикл
				Если Не СтрокаТабличнойЧасти.ДокументОснование.Распечатан Тогда
					МассивДокументовОснований.Добавить(СтрокаТабличнойЧасти.ДокументОснование);
				КонецЕсли;
			КонецЦикла;
			Отказ = Не РаботаСДиалогами.ДокументУстановитьПометкуРаспечатанности(МассивДокументовОснований, Неопределено, , РаботаСДиалогами.ДокументУстановитьДополнительныеСвойства(РаботаСДиалогами.ДокументУстановитьПредотвращениеПроверки(), ,, Истина));
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюДокумента()
	
#КонецЕсли

