
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата();
	
	// Заполнение реквизитов.
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Запись.Получено = Запись.Получено Или Запись.Прочитано;
		
		Если Не ЗначениеЗаполнено(Запись.Отправитель) Тогда
			Запись.Отправитель = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.ДатаНачалаПериода) Тогда
			Запись.ДатаНачалаПериода = ТекущаяДата;
		КонецЕсли;
		Если Запись.Прочитано Тогда
			Если Не ЗначениеЗаполнено(Запись.ДатаОкончанияПериода) Тогда
				Запись.ДатаОкончанияПериода = ТекущаяДата;
			КонецЕсли;
		Иначе
			Запись.ДатаОкончанияПериода = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Сообщение.
	МассивСообщений = Новый Массив; Для Каждого Запись Из ЭтотОбъект Цикл Если Не Запись.Получено Тогда МассивСообщений.Добавить(Запись.Сообщение); КонецЕсли;; КонецЦикла;
	
	// Запись связанных данных.
	Если Булево(МассивСообщений.Количество()) Тогда
		Запись = РегистрыСведений.__СообщенияПользователей.СоздатьМенеджерЗаписи(); 
		
		Для Каждого ЭлементСообщений Из МассивСообщений Цикл Запись.Сообщение = ЭлементСообщений; Запись.Записать(Истина); КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()
