
&НаКлиенте
Процедура Сформировать(Команда)
	
	Если (ОткрытьФормуМодально("Справочник.Комнаты.Форма.ФормаФормирования", Новый Структура("ТекущийРодитель", Элементы.Список.ТекущийРодитель), ЭтаФорма) = Истина) Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры // Сформировать()


&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)

	__ИнтерактивноеУправлениеДаннымиКлиент.АктуальностьСправочникаПриАктивизацииЯчейки(Элемент);
	
КонецПроцедуры	// СписокПриАктивизацииЯчейки()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Режим выбора.
	__РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список, 
		"Сформировать, ИндексАктуальности,ТипКомнаты");

КонецПроцедуры // ПриСозданииНаСервере()

