
&НаКлиенте
Процедура УстановитьВидимость()
	
	// Командная панель.
	Элементы.ПодробныйРежим.Пометка = ПодробныйРежим;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ОбработчикОжиданияОбновленияНастроек()

	// Обновление настроек.
	ОбновитьНастройки();
	
КонецПроцедуры // ОбработчикОжиданияОбновленияНастроек()


&НаСервере
Процедура ОбновитьНастройки()

	ГраницаНеактивностиСеансов = РегистрыСведений.__НастройкиВебСервиса.ПолучитьГраницуНеактивностиСеансов();
	
КонецПроцедуры // ОбновитьНастройки()


&НаКлиенте
Процедура ПодробныйРежим(Команда)
	
	ПодробныйРежим = Не ПодробныйРежим;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПодробныйРежим()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Настройки.
	ОбновитьНастройки();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройки.
	ПодключитьОбработчикОжидания("ОбработчикОжиданияОбновленияНастроек", 60);
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПриОткрытии()
