 
 
 Функция  ПечатьСообщения(Документ, Центр ,ТекстСообщения) Экспорт 
	  
	ТабДок = Новый ТабличныйДокумент;
	Макет = РегистрыСведений.РегистрСведенийСообщения.ПолучитьМакет("Печать");
	
	// Сообщение
	РабочийЦентр = Макет.ПолучитьОбласть("ОбластьРабочийЦентр");
	РабочийЦентр.Параметры.РабочийЦентр = Центр;
	ТабДок.Вывести(РабочийЦентр);
	
	// Сообщение
	Сообщения = Макет.ПолучитьОбласть("ОбластьСообщения");
	Сообщения.Параметры.Сообщение = ТекстСообщения;
	ТабДок.Вывести(Сообщения);
	
	Стол = Макет.ПолучитьОбласть("ОбластьСтола");
	Стол.Параметры.НомерСтола = Документ.ПолныйНомерСтола;
	ТабДок.Вывести(Стол);
		
  	
	// Заголовок
	Шапка = Макет.ПолучитьОбласть("ОбластьШапки");
	Шапка.Параметры.номер = ОбщегоНазначенияСервер.УдалениеВедущихНулей(Документ.Номер);
	Шапка.Параметры.Дата = Документ.Дата;	
	ТабДок.Вывести(Шапка);
	
			
	//Подвал
	Подвал = Макет.ПолучитьОбласть("ОбластьПодвала");
	Подвал.Параметры.ТекущаяДата = Формат(ТекущаяДата(), "ДЛФ=T");
	Подвал.Параметры.Сотрудник =  глЗначениеПеременной("глТекущийПользователь").Сотрудник;
	ТабДок.Вывести(Подвал);
 
 
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	Возврат ТабДок;
	 
 КонецФункции
 
 Процедура СоздатьЗаписьСообщения(Сообщение)  Экспорт
	 НаборЗаписей =	РегистрыСведений.РегистрСведенийСообщения.СоздатьНаборЗаписей();
	 НаборЗаписей.Отбор.Сообщения.Установить(Сообщение);		 
	 Запись = НаборЗаписей.Добавить();
	 Запись.Сообщения = Сообщение;
	 
	 Попытка
		 НаборЗаписей.Записать();
	 Исключение		 
	 КонецПопытки;	 
 КонецПроцедуры
 