
Процедура ПриКопировании(ОбъектКопирования)

	// Некопируемые реквизиты.
	Если Не ЭтоГруппа Тогда
		Изображение = Неопределено;
		Идентификатор = Неопределено;
		Файл = Неопределено;
		URL = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ)

	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		
		// Проверка.
		Картинка = Изображение.Получить();
		Если (Картинка = Неопределено) Тогда
			Отказ = Истина;
			// TODO
		КонецЕсли;
		Если Не Отказ Тогда
			Картинка = Новый Картинка(Картинка);
			Если (Картинка.Формат() = ФорматКартинки.НеизвестныйФормат) Тогда
				Отказ = Истина;
				// TODO
			КонецЕсли;
		КонецЕсли;
		
		Если Не Отказ Тогда
			
			// Идентификатор и URL.
			РегистрыСведений.__НастройкиВебСервиса.РесурсПублицкацииИзображениеСгенерироватьURL(ЭтотОбъект);
		
			// Индекс картинки.
			ИндексКартинки = __РаботаСФайламиКлиентСервер.ПолучитьИндексПиктограммыФайла(__РаботаСФайламиКлиентСервер.ПолучитьРасширениеФайла(Файл)) + Число(ПометкаУдаления);
		
		КонецЕсли;
		
	Иначе
		
		// Индекс картинки.
		ИндексКартинки = __РаботаСДиалогамиКлиентСервер.ПолучитьИндексПиктограммыСправочника(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	
	// При обмене данными опубликовать данные необходимо.
	Если Не ЭтоГруппа Тогда
		РегистрыСведений.__НастройкиВебСервиса.РесурсПублицкацииИзображениеРазместить(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры // ПриЗаписи()
