
&НаКлиенте
Процедура УстановитьВидимость()
	
	// Командная панель.
	Элементы.ПодробныйРежим.Пометка = ПодробныйРежим;
	Элементы.Ресторан.Видимость = ПодробныйРежим;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ПодробныйРежим(Команда)
	
	ПодробныйРежим = Не ПодробныйРежим;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПодробныйРежим()

&НаКлиенте
Процедура ОчиститьСписок(Команда)
	
	Если (Вопрос(НСтр("ru = 'Удалить все записи?'; uk = 'Видалити всі записи?'"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да) Тогда
		ОчиститьСписокСервер();
		__УправлениеДаннымиКлиент.ОповеститьИзменениеЧерногоБелогоСписка();
	КонецЕсли;
	
КонецПроцедуры // ОчиститьСписок()

&НаСервере
Процедура ОчиститьСписокСервер()
	
	РегистрыСведений.БелыйСписокНоменклатуры.ОчиститьСписокНоменклатуры(Неопределено, Истина);
	
КонецПроцедуры // ОчиститьСписокСервер()


&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	__УправлениеДаннымиКлиент.ОповеститьИзменениеЧерногоБелогоСписка();
	
КонецПроцедуры // СписокПослеУдаления()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Настройка формы.
	Элементы.ОчиститьСписок.Доступность = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.БелыйСписокНоменклатуры);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если __УправлениеДаннымиКлиентСервер.ОповещениеИзмененияЧерногоБелогоСписка(ИмяСобытия) Тогда
		Элементы.Список.Обновить();
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаОповещения()
