
Функция ПолучитьСписокНоменклатуры(Сопутствующая = Неопределено) Экспорт
	
	Возврат РегистрыСведений.МодификаторыНоменклатуры.ПолучитьСписокНоменклатуры(Сопутствующая, "СопутствующаяНоменклатура");	
	
КонецФункции // ПолучитьСписокНоменклатуры()


Процедура ПолучитьПравилаСопутствующейНоменклатуры(Ссылка, Родитель, Объект) Экспорт

	РегистрыСведений.МодификаторыНоменклатуры.ПолучитьПравилаМодификаторов(Ссылка, Родитель, Объект, "СопутствующаяНоменклатура");
	
КонецПроцедуры // ПолучитьПравилаСопутствующейНоменклатуры()

Процедура УстановитьПравилаСопутствующейНоменклатуры(Ссылка, Родитель, Объект, Отказ) Экспорт

	РегистрыСведений.МодификаторыНоменклатуры.УстановитьПравилаМодификаторов(Ссылка, Родитель, Объект, Отказ, "СопутствующаяНоменклатура");
	
КонецПроцедуры // УстановитьПравилаСопутствующейНоменклатуры()
