
Процедура ПередЗаписью(Отказ, Замещение)

	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Наследование.
	РегистрыСведений.МодификаторыНоменклатуры.ПередЗаписьюНабораЗаписей(ЭтотОбъект, Отказ, Замещение);
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ, Замещение)

	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Наследование.
	РегистрыСведений.МодификаторыНоменклатуры.ПриЗаписиНабораЗаписей(ЭтотОбъект, Отказ, Замещение);
	
КонецПроцедуры // ПриЗаписи()
