
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	//Костенюк Александр-Старт 16.05.2014
	Если ЭтотОбъект.ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ЭтоНовый", Истина);
	КонецЕсли;
	//Костенюк Александр-Финиш 16.05.2014
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	//Костенюк Александр-Старт 16.05.2014
	// Регистрация элемента справочника "НоменклатурныеГруппы"(только новые)
	ЭтоНовый = Неопределено;
	ЭтоНовый = ДополнительныеСвойства.Свойство("ЭтоНовый");
	
	ЭтотУзел = ПланыОбмена.ОбменДанными2K_CRS.ЭтотУзел();
	ЭтоЦБ = ПроцедурыОбменаДаннымиFrontOffice_Restoran.ЭтоЦентральнаяБаза(ЭтотУзел);
	
	Если ЭтоНовый И ЭтоЦБ Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОбменДанными2K_CRS.Ссылка КАК Узел
		               |ИЗ
		               |	ПланОбмена.ОбменДанными2K_CRS КАК ОбменДанными2K_CRS
		               |ГДЕ
		               |	ОбменДанными2K_CRS.Ссылка <> &ЭтотУзел";
		Запрос.УстановитьПараметр("ЭтотУзел", ЭтотУзел);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Узел, ЭтотОбъект.Ссылка);
		КонецЦикла;
	КонецЕсли;
	//Костенюк Александр-Финиш 16.05.2014
	
КонецПроцедуры


