
// Обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(Основание)

	// Рестораны.
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Рестораны") Тогда
		Если Основание.ЭтоГруппа Тогда
			Возврат;
		КонецЕсли;
		
		Владелец = Основание;		
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка заполнения реквизитов.
	Заголовок = "Запись элемента справочника «" + ОбщегоНазначения.ПредставлениеСправочникаДляЗаголовкаСообщения(ЭтотОбъект) + "»: ";
	
	Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Наименование) Тогда
		ОбщегоНазначения.СообщитьОбНезаполненомРеквизитеСправочника(Ссылка, "Наименование", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()
