
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Владелец.
	Если (Не ЗначениеЗаполнено(Владелец)) И (Не ЗначениеЗаполнено(ПолучитьСвойство(ДанныеЗаполнения, "Владелец"))) Тогда
		//Владелец = Справочники.КлассификаторГородов.ОсновнойГород();
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// Наименование.
	__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, , "Наименование");	
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	// Удаляем значения некопируемых реквизитов.
	Если Не ОбъектКопирования.ПометкаУдаления Тогда
		Наименование = Неопределено;
		НаименованиеСокращенное = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	// Наименование.
	__УправлениеКонтактнойИнформациейСервер.НаименованиеСокращенноеПередЗаписью(ЭтотОбъект);
		
КонецПроцедуры // ПередЗаписью()
