
&НаКлиенте
Процедура УстановитьВидимость()
	
	// Командная панель.
	Элементы.ПодробныйРежим.Пометка = ПодробныйРежим;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ПодробныйРежим(Команда)
	
	ПодробныйРежим = Не ПодробныйРежим;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПодробныйРежим()


&НаКлиенте
Процедура ГруппыПользователейПриАктивизацииСтроки(Элемент)
	
	// Параметры.
	ПользователиСписок.Параметры.УстановитьЗначениеПараметра("ГруппаПользователей", Элементы.ГруппыПользователей.ТекущаяСтрока);
	
	// Настройка формы.
	Если ЗначениеЗаполнено(Элементы.ГруппыПользователей.ТекущаяСтрока) Тогда
		Элементы.ПользователиСписок.Отображение = ОтображениеТаблицы.Список;
	Иначе
		Элементы.ПользователиСписок.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	КонецЕсли; 
	
КонецПроцедуры // ГруппыПользователейПриАктивизацииСтроки()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Параметры.
	ПользователиСписок.Параметры.УстановитьЗначениеПараметра("ПустойУникальныйИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ПользователиСписок.Параметры.УстановитьЗначениеПараметра("ГруппаПользователей", Справочники.ГруппыПользователей.ПустаяСсылка());
	
	// Режим выбора.
	__РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.ПользователиСписок, 
		"ПользователиИБ,ГруппаПодробныйРежим, ГруппыПользователей, Код,Сотрудник");
		
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПриОткрытии()
