
Функция ОсновнойТипКомнаты() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                      |	ТипыКомнат.Ссылка
	                      |ИЗ
	                      |	(ВЫБРАТЬ ПЕРВЫЕ 1
	                      |		ТипыКомнат.Ссылка КАК Ссылка,
	                      |		ТипыКомнат.Ранг КАК Ранг
	                      |	ИЗ
	                      |		(ВЫБРАТЬ
	                      |			Комнаты.ТипКомнаты КАК Ссылка,
	                      |			КОЛИЧЕСТВО(Комнаты.Ссылка) КАК Ранг
	                      |		ИЗ
	                      |			Справочник.Комнаты КАК Комнаты
	                      |		ГДЕ
	                      |			НЕ Комнаты.ЭтоГруппа
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			Комнаты.ТипКомнаты) КАК ТипыКомнат
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ ПЕРВЫЕ 1
	                      |		ТипыКомнат.Ссылка,
	                      |		-1
	                      |	ИЗ
	                      |		Справочник.ТипыКомнат КАК ТипыКомнат
	                      |	ГДЕ
	                      |		НЕ ТипыКомнат.ЭтоГруппа
	                      |	
	                      |	УПОРЯДОЧИТЬ ПО
	                      |		Ранг УБЫВ,
	                      |		Ссылка) КАК ТипыКомнат
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТипыКомнат.Ранг УБЫВ,
	                      |	ТипыКомнат.Ссылка.ПометкаУдаления,
	                      |	ТипыКомнат.Ссылка.Наименование");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ТипыКомнат.ПустаяСсылка();

КонецФункции // ОсновнойТипСтола()
