
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Подмена объекта формы.
	ЗаписьСостояния = РегистрыСведений.__СостояниеСервераПечати.СоздатьМенеджерЗаписи();	
	ЗаписьСостояния.Прочитать();
	Если ЗаписьСостояния.Выбран() Тогда
		ЗначениеВДанныеФормы(ЗаписьСостояния, Запись);
	КонецЕсли;
	
	// Данные.
	СерверПечатиАктивен = РегистрыСведений.__СостояниеСервераПечати.ПолучитьАктивностьСервера();
	РегламентноеЗаданиеИспользуется = РегистрыСведений.__СостояниеСервераПечати.ПолучитьИспользованиеРегламентногоЗадания();
	
	// Настройка форма.
	Заголовок = Метаданные.РегистрыСведений.__СостояниеСервераПечати.ПредставлениеЗаписи;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка форма.
	Если Не МодальныйРежим Тогда
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()
