
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заглушка.
	Отказ = Не ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Идентификатор);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// Владелец.
	ЗаписьВладелец = РегистрыСведений.__СостояниеСеансовВебСервиса.СоздатьМенеджерЗаписи();	
	ЗаписьВладелец.Идентификатор = ТекущийОбъект.Идентификатор;
	ЗаписьВладелец.Прочитать();
	Если ЗаписьВладелец.Выбран() Тогда
		ЗначениеВДанныеФормы(ЗаписьВладелец, Владелец);
	КонецЕсли;
	
КонецПроцедуры // ПриЧтенииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка форма.
	Если Не МодальныйРежим Тогда
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

