
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Справочник = "МодификаторыНоменклатуры"; 
	
	// Выбор.
	ПараметрыФормы = Новый Структура("Справочник,Номенклатура", Справочник, ПараметрКоманды);
	Форма = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаВыбораРаспределения", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
	// Проверка.
	Если (Форма = Неопределено) Тогда
		__ИнтерактивноеУправлениеДаннымиКлиент.ПредупреждениеКомандаНеМожетБытьВыполнена();
		Возврат;
	КонецЕсли; 
	
	Результат = Форма.ОткрытьМодально();
	Если (Результат = Неопределено) Или (Результат = КодВозвратаДиалога.Отмена) Тогда
		Возврат;
	КонецЕсли; 
	
	// Перенос.
	Если (ТипЗнч(Результат) = Тип("СправочникСсылка." + Справочник)) Тогда
		__ИнтерактивноеУправлениеДаннымиКлиент.ПереносМенюПеретаскивание(Форма.Элементы.Список, Новый Структура("Значение", ПараметрКоманды), Истина, Результат, Неопределено, Справочник, Форма.Список);
	Иначе
		__ИнтерактивноеУправлениеДаннымиКлиент.ПредупреждениеКомандаНеМожетБытьВыполнена();
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаКоманды()
