
Функция ПолучитьШтрихКод(Владелец, ТипШтрихкода = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РегистрСведенийШтрихкоды.Штрихкод
	               |ИЗ
	               |	РегистрСведений.Штрихкоды КАК РегистрСведенийШтрихкоды
	               |ГДЕ
	               |	РегистрСведенийШтрихкоды.Владелец = &Владелец
	               |	И (&ТипШтрихкода = НЕОПРЕДЕЛЕНО
	               |			ИЛИ РегистрСведенийШтрихкоды.ТипШтрихкода = &ТипШтрихкода)";
	Запрос.УстановитьПараметр("Владелец", Владелец.Ссылка);
	Запрос.УстановитьПараметр("ТипШтрихкода", ТипШтрихкода);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Результат = Выборка.Штрихкод;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;

КонецФункции // ПолучитьШтрихКод()

Функция ПолучитьПараметрыШтрихКода(Владелец, ТипШтрихкода = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Пустой штрих код.
	Результат = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
	Результат.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;

	// Выборка данных.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РегистрСведенийШтрихкоды.Штрихкод,
	               |	РегистрСведенийШтрихкоды.Владелец,
	               |	РегистрСведенийШтрихкоды.ТипШтрихкода
	               |ИЗ
	               |	РегистрСведений.Штрихкоды КАК РегистрСведенийШтрихкоды
	               |ГДЕ
	               |	РегистрСведенийШтрихкоды.Владелец = &Владелец
	               |	И (&ТипШтрихкода = НЕОПРЕДЕЛЕНО
	               |			ИЛИ РегистрСведенийШтрихкоды.ТипШтрихкода = &ТипШтрихкода)";
	Запрос.УстановитьПараметр("Владелец", Владелец.Ссылка);
	Запрос.УстановитьПараметр("ТипШтрихкода", ТипШтрихкода);
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Результат;

КонецФункции // ПолучитьПараметрыШтрихКода()

Процедура УстановитьШтрихКод(Владелец, ТипШтрихкода, Штрихкод, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Запись.
	НаборЗаписей = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Владелец.Установить(Владелец.Ссылка);
	// необходимо ставить отбор по измерениям с установленным свойством "Основной отбор" (с) Дима Черных
	//НаборЗаписей.Отбор.Штрихкод.Установить(Штрихкод); //Костенюк Александр-Закомментировано 29.07.2014 // Непонятно зачем устанавливать отбор по ШК, отбора по владельцу вполне достаточно
	
	Если Не ПустаяСтрока(Штрихкод) Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Владелец = Владелец.Ссылка; 
		Запись.ТипШтрихкода = ТипШтрихкода; 
		Запись.Штрихкод = Штрихкод;
	КонецЕсли; 
	
	Отказ = Не НаборЗаписей.ПроверитьЗаполнение();
	
	Если Не Отказ Тогда
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			Отказ = Истина;	// ERR
		КонецПопытки;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры // УстановитьШтрихКод()


Функция СформироватьШтрихКод(Префикс = Неопределено, ТипШтрихкода = Неопределено, МассивШтрихКодовНеВРегистре = Неопределено) Экспорт

	// TODO: Формирования штрих-кодов.
	
	Возврат Неопределено;

КонецФункции // СформироватьШтрихКод()
