
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// МаксимальноеКоличествоКлиентов.
	Если Не ЭтоГруппа Тогда
		Если Не КоличествоКлиентов Тогда
			__ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, , "МаксимальноеКоличествоКлиентов");
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПередЗаписью(Отказ)

	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Нормализация.
	Если Не ЭтоГруппа Тогда
		Если Не КоличествоКлиентов Тогда
			МаксимальноеКоличествоКлиентов = Неопределено;
		КонецЕсли; 
		ВремяРезервирования = Макс(ВремяРезервирования, '00010101001500');
		ВремяРезервированияСекунд = (ВремяРезервирования - '00010101')
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
