
Функция ПолучитьДату(КассоваяДата) Экспорт
	
	Возврат РегистрыСведений.КассовыеДаты.ПолучитьДату(КассоваяДата);
	
КонецФункции // ПолучитьДату()

Процедура УстановитьДату(КассоваяДата, Дата, Отказ) Экспорт
	
	РегистрыСведений.КассовыеДаты.УстановитьДату(КассоваяДата, Дата, Отказ);
	
КонецПроцедуры // УстановитьДату()


Функция ПолучитьПараметрыКассовойДаты(КассоваяДата) Экспорт
	
	Возврат РегистрыСведений.КассовыеДаты.ПолучитьПараметрыКассовойДаты(КассоваяДата);
	
КонецФункции // ПолучитьПараметрыКассовойДаты()
