
Функция ПолучитьВхождениеНоменклатуры(Номенклатура, Ресторан = Неопределено) Экспорт
	
	Возврат РегистрыСведений.ЧерныйСписокНоменклатуры.ПолучитьВхождениеНоменклатуры(Номенклатура, Ресторан, "БелыйСписокНоменклатуры");
	
КонецФункции // ПолучитьВхождениеНоменклатуры()


Функция ПолучитьСписокНоменклатуры(Ресторан = Неопределено) Экспорт
	
	Возврат РегистрыСведений.ЧерныйСписокНоменклатуры.ПолучитьСписокНоменклатуры(Ресторан, "БелыйСписокНоменклатуры");
	
КонецФункции // ПолучитьСписокНоменклатуры()

Процедура ОчиститьСписокНоменклатуры(Ресторан = Неопределено, Полностью = Ложь) Экспорт
	
	РегистрыСведений.ЧерныйСписокНоменклатуры.ОчиститьСписокНоменклатуры(Ресторан, Полностью, "БелыйСписокНоменклатуры");
	
КонецПроцедуры // ОчиститьИсториюНоменклатуры()


Функция ПолучитьКоличествоНоменклатуры(Ресторан = Неопределено) Экспорт
	
	Возврат РегистрыСведений.ЧерныйСписокНоменклатуры.ПолучитьКоличествоНоменклатуры(Ресторан, "БелыйСписокНоменклатуры");
	
КонецФункции // ПолучитьКоличествоНоменклатуры()


Функция ПолучитьТаблицуВхожденийНоменклатуры(Номенклатура) Экспорт
	
	Возврат РегистрыСведений.ЧерныйСписокНоменклатуры.ПолучитьТаблицуВхожденийНоменклатуры(Номенклатура, "БелыйСписокНоменклатуры");
	
КонецФункции // ПолучитьТаблицуВхожденийНоменклатуры()

Процедура УстановитьТаблицуВхожденийНоменклатуры(Номенклатура, ТаблицаВхождений) Экспорт
	
	РегистрыСведений.ЧерныйСписокНоменклатуры.УстановитьТаблицуВхожденийНоменклатуры(Номенклатура, ТаблицаВхождений, "БелыйСписокНоменклатуры");
	
КонецПроцедуры // УстановитьТаблицуВхожденийНоменклатуры()


Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

	Если (ВидФормы = "ФормаЗаписи") Тогда
		Если ПолучитьПараметрыУчета().БелыйСписокНоменклатурыУчетКоличества И (Не Справочники.Рестораны.КоличествоАктуальныхРесторановБолееОдного()) Тогда
			ВыбраннаяФорма = "ФормаУпрощенная"; СтандартнаяОбработка = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПолученияФормы()

//Костенюк Александр-Старт 28.05.2012
//
// Процедура добавляет позицию в регистр, либо изменяет количество для позиции
//
// Параметры
// Номенклатура - Тип: СправочникСсылка.Номенклатура, позиция, которую необходимо добавить либо изменить количество
// Ресторан - Тип: СправочникСсылка.Рестораны, ресторан, для которого нужно добавить позицию
// Регистр - Тип: Строка, Регистр, в который будет добавлена запись(либо изменена)
//
Процедура УстановитьПозицию(Номенклатура, Количество, Ресторан, Регистр) Экспорт
	
	РегистрыСведений.ЧерныйСписокНоменклатуры.УстановитьПозицию(Номенклатура, Количество, Ресторан, Регистр);
	
КонецПроцедуры
//Костенюк Александр-Финиш 28.05.2012

//Костенюк Александр-Старт 28.05.2012
//
// Процедура удаляет позицию из списка
//
// Параметры
// Номенклатура - Тип: СправочникСсылка.Номенклатура, позиция, которую необходимо удалить
// Ресторан - Тип: СправочникСсылка.Рестораны, ресторан, для которого нужно удалить позицию
// Регистр - Тип: Строка, Регистр, из которого будет произведено удаление позиции
//
Процедура УдалитьПозицию(Номенклатура, Ресторан, Регистр) Экспорт
	
	РегистрыСведений.ЧерныйСписокНоменклатуры.УдалитьПозицию(Номенклатура, Ресторан, Регистр);
	
КонецПроцедуры
//Костенюк Александр-Финиш 28.05.2012
