
// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Нормализация.
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.Комментарий = СокрП(Запись.Комментарий);
		Запись.Представление = СокрП(Запись.Представление);
	КонецЦикла;
	
	// Проверка заполнения реквизитов.
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ОбщегоНазначения.ЗначениеНЕЗаполнено(Запись.Представление) Тогда
			ОбщегоНазначения.СообщитьОбНезаполненомРеквизитеРегистра(ЭтотОбъект, "Представление", Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
