
# Если Клиент Тогда

// Функция показывает таблицу значений в отдельной форме.
//
Функция ПоказатьТаблицуЗначений(ТЗ, Заголовок = "") Экспорт
	
	ФормаТЗ = ПолучитьФорму("ФормаТЗ");
	Если (ФормаТЗ.КлючУникальности = Неопределено) Тогда
		ФормаТЗ.КлючУникальности = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	ФормаТЗ.ТаблицаЗначений = ТЗ;
	ФормаТЗ.ЭлементыФормы.ТаблицаЗначений.СоздатьКолонки();
	ФормаТЗ.Открыть();
	Если Не ПустаяСтрока(Заголовок) Тогда
		ФормаТЗ.Заголовок = Заголовок;
	КонецЕсли; 
	ФормаТЗ.Активизировать();
	
КонецФункции // ПоказатьТаблицуЗначений()

// Функция показывает дерево значений в отдельной форме.
//
Функция ПоказатьДеревоЗначений(ДЗ, Заголовок = "") Экспорт
	
	ФормаДЗ = ПолучитьФорму("ФормаДЗ");
	Если (ФормаДЗ.КлючУникальности = Неопределено) Тогда
		ФормаДЗ.КлючУникальности = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	ФормаДЗ.ДеревоЗначений = ДЗ;
	ФормаДЗ.ЭлементыФормы.ДеревоЗначений.СоздатьКолонки();
	ФормаДЗ.Открыть();
	Если Не ПустаяСтрока(Заголовок) Тогда
		ФормаДЗ.Заголовок = Заголовок;
	КонецЕсли; 
	ФормаДЗ.Активизировать();
	
КонецФункции // ПоказатьДеревоЗначений()

#КонецЕсли
