
#Если Клиент Тогда

Функция НастроитьСписок(ТабличноеПоле, Подсказка = "", Группировка = Неопределено, CallBackФорма = Неопределено, CallBackПриНастройкеСписка = "ПриНастройкеСписка", CallBackЭлементФормы = Неопределено) Экспорт
	
	// Открываем форму ввода.
	Форма = ЭтотОбъект.ПолучитьФорму("ФормаНастройки");
	Форма.ТабличноеПоле = ТабличноеПоле;
	Форма.Группировка = Группировка;
	Если Не ПустаяСтрока(Подсказка) Тогда
		Форма.Заголовок = Подсказка;
	КонецЕсли;
	Форма.CallBackФорма = CallBackФорма;
	Форма.CallBackПриНастройкеСписка = CallBackПриНастройкеСписка;
	Форма.CallBackЭлементФормы = CallBackЭлементФормы;
	
	// Настройка.
	ПараметрЗакрытия = Форма.ОткрытьМодально();
	
	Возврат (ПараметрЗакрытия = Истина);
	
КонецФункции // НастроитьСписок()

Функция НастроитьОтбор(ТабличноеПоле, Подсказка = "", ДеревоОтбора = Неопределено, Сортировка = Неопределено, Очередь = Неопределено) Экспорт
	
	// Открываем форму ввода.
	Форма = ЭтотОбъект.ПолучитьФорму("ФормаОтбора");
	Форма.ТабличноеПоле = ТабличноеПоле;
	Форма.ДеревоОтбора = ДеревоОтбора;
	Форма.Сортировка = Сортировка;
	Форма.Очередь = Очередь;
	Если Не ПустаяСтрока(Подсказка) Тогда
		Форма.Заголовок = Подсказка;
	КонецЕсли;
	
	// Настройка.
	ПараметрЗакрытия = Форма.ОткрытьМодально();
	
	Возврат (ПараметрЗакрытия = Истина);
	
КонецФункции // НастроитьОтбор()

#КонецЕсли

