      //
  //
   Процедура СоздатьЗаписьВСправочнике(CODE, TYPE, SUM, ACTIVE, DISCOUNT, PASSWORD, СтрАнализа) Экспорт 
	          		   
	   Запрос = Новый Запрос;
	   Запрос.УстановитьПараметр("КодСертификата", CODE);	   
	   Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	   |	Сертификаты.Ссылка
	   |ИЗ
	   |	Справочник.Сертификаты КАК Сертификаты
	   |ГДЕ
	   |	Сертификаты.КодСертификата = &КодСертификата";
	   
	   Результат =  Запрос.Выполнить();  
	   Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	   
	   Если Выборка.Следующий() Тогда
		   НовыйСправочник = Выборка.Ссылка.ПолучитьОбъект();
	   Иначе
		   НовыйСправочник  = Справочники.Сертификаты.СоздатьЭлемент();
		   НовыйСправочник.УстановитьНовыйКод();
		   НовыйСправочник.Наименование = "№" + CODE; 
		   НовыйСправочник.КодСертификата = CODE;
		   СтрАнализа.Новых  =  СтрАнализа.Новых + 1;
	   КонецЕсли;
  	   
	   НовыйСправочник.ВидСертификата = Справочники.ВидыСертификатов.НайтиЭлементВСправочнике(TYPE);   
	   НовыйСправочник.ДисконтнаяКарта = Справочники.ИнформационныеКарты.НайтиЭлементВСправочнике(DISCOUNT);           
	   НовыйСправочник.Актуальность = ACTIVE;                              
	   НовыйСправочник.Пароль  = PASSWORD;
	   НовыйСправочник.Сумма = SUM;	  
	   
	   Попытка 
		   НовыйСправочник.ОбменДанными.Загрузка = Истина;
		   НовыйСправочник.Записать();
	   Исключение
		   //ошибка = ОписаниеОшибки();
	   КонецПопытки;	
	   
  КонецПроцедуры
