
//Функция возвращает значение ресурса "НомерОперации"
// Параметры:
// Нет.
//
// Возвращаемое значение:
// НомерОперации - Тип: Число. Порядковый номер последней операции.
//
Функция ПолучитьНомерОперации() Экспорт
	
	Возврат РегистрыСведений.НомерОперацииАнализаДействий.Получить().НомерОперации;
	
КонецФункции

//Функция записывает новое значение ресурса "НомерОперации"
// Параметры:
// НомерОперации - Тип: Число. Значение нового номера операции.
//
// Возвращаемое значение:
// Нет.
//
Функция ЗаписатьНомерОперации(НомерОперации) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.НомерОперацииАнализаДействий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.НомерОперации = НомерОперации;
	МенеджерЗаписи.Записать();
	
КонецФункции 