
&НаКлиенте
Процедура УстановитьВидимость()
	
	// Командная панель.
	Элементы.ПодробныйРежим.Пометка = ПодробныйРежим;
	
	// Элементы.
	Элементы.ГруппаНеобходимаДисконтнаяКарточка.Видимость = (Не РежимВыбора) И ПодробныйРежим;
	Элементы.ГруппаНеобходимПароль.Видимость = Элементы.ГруппаНеобходимаДисконтнаяКарточка.Видимость;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ПодробныйРежим(Команда)
	
	ПодробныйРежим = Не ПодробныйРежим;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПодробныйРежим()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Режим выбора.
	РежимВыбора = __РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список, 
		//"ПодробныйРежим, ГруппаНеобходимаДисконтнаяКарточка,НеобходимаДисконтнаяКарточка, OnLine,ГруппаНеобходимПароль,НеобходимПароль");
		"ПодробныйРежим, ГруппаНеобходимаДисконтнаяКарточка,НеобходимаДисконтнаяКарточка,ПроцентПогашения,OnLine,ГруппаНеобходимПароль,НеобходимПароль"); //Костенюк Александр 10.12.2014
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПриОткрытии()
